0000-MAINLINE SECTION.
	PERFORM 9000-INITIALIZATION.
	SET WS-FS-SNAPSHOT-EOF-NO TO TRUE.
	PERFORM 100-PROCESS-RECS
		UNTIL WS-FS-SNAPSHOT-EOF-YES.
	PERFORM 9000-TERMINATE.
	PERFORM 9000-STOP-RUN.
END-OF-SECTION. EXIT.
/**************************************************************
* 100-PROCESS-RECS SECTION.
*WRN22305 Begin JHJ
	SET HV-COMPANION-CLAIM-NO	TO TRUE
	MOVE SPACES 				TO HV-COMPANION-WC-BRANCH, 
								HV-COMPANION-WC-CASE, 
								HV-COMPANION-WC-SYMBOL,
*ROI 1922 change start
								PLCNTRL-CLIENT-NUM, 
								PLTHRED-PRIMARY
*ROI 1922 change end
* WRN22305 - End JHJ
	PERFORM 9000-READ-INPUT-TAPE
	IF WS-FS-SNAPSHOT-EOF-YES
		IF WS-FILE-IS-EMPTY
		PERFORM 9000-INITIALIZE-UTT94PRM
		MOVE "AB" 					TO UTT94-OPTION
		MOVE "100-PROCESS-RECS" 	TO UTT94-PARAGRAPH-NAME
		MOVE "INPUT FILE IS EMPTY"	TO UTT94-MESSAGE-LINE (01)
		MOVE WS-STARTUP-TEXT		TO UTT94-MESSAGE-LINE (02)
		MOVE WS-VERSION-LIT			TO UTT94-VERSION-LIT
		PERFORM 9000-SEND-UTT94
	ELSE
		PERFORM 853-WRITE-XYZ-REC-III EXIT SECTION
	END-IF
	ELSE
		CONTINUE
	END-IF.
	ADD 1 TO WS-CTR-IN.

	IF DTRECPH-TRANSMITTAL-HDR
		ADD 1 WS-CTR-DTRECPH GIVING WS-CTR-DTRECPH
		MOVE DTRECPH-DT-RECIPIENT-ID         TO WS-RECIPIENT
		MOVE DTRECPH-CUR-FIN-AS-OF-YR        TO WS-YEAR-1234
		MOVE DTRECPH-CUR-FIN-AS-OF-DATE      TO WS-SAVE-CUR-AS-OF-DATE
		MOVE DTRECPH-PRI-FIN-AS-OF-DATE      TO WS-SAVE-PRI-AS-OF-DATE
		MOVE DTRECPH-PRI-FIN-AS-OF-DATE      TO DT-DATE-YEARMMDD
		MOVE 9                               TO DT-ENTRY-CODE
		CALL "UTE02" OF CS-U02 USING DT-DATE-TIME
		MOVE DT-DATE-YEARMMDD                TO WS-SAVE-DTRECPH-PRI-FIN-DATE
		MOVE DTRECPH-TAPE-FORMAT-OPTION      TO WS-DTRECPH-TAPE-FORMAT-OPTION
		IF DTRECPH-ACTIVITY-FROM-DATE = ZEROES AND
		   DTRECPH-ACTIVITY-TO-DATE = ZEROES
			MOVE DTRECPH-CUR-FIN-AS-OF-DATE  TO WS-ACTIVITY-TO-DATE
			PERFORM 120-FILL-ACTIVITY-DATE
			MOVE DTRECPH-ACTIVITY-FROM-DATE TO WS-ACTIVITY-FROM-DATE
			MOVE DTRECPH-ACTIVITY-FROM-DATE TO WS-START-DATE
		ELSE
			MOVE DTRECPH-ACTIVITY-FROM-DATE TO WS-ACTIVITY-FROM-DATE
			MOVE DTRECPH-ACTIVITY-FROM-DATE TO WS-START-DATE
			MOVE DTRECPH-ACTIVITY-TO-DATE   TO DT-DATE-YEARMMDD
			MOVE 1                           TO DT-ENTRY-CODE
			CALL "UTE02" OF CS-002 USING DT-DATE-TIME
			SUBTRACT 1440 FROM DT-SYSTEM-TIME
			MOVE 4                           TO DT-ENTRY-CODE
			CALL "UTE02" OF CS-U02 USING DT-DATE-TIME
			MOVE DT-DATE-YEARMMDD                TO WS-ACTIVITY-TO-DATE
		END-IF
		PERFORM 125-CHECK-STARTUP
	ELSE
		IF DTHORSN-CLIENT-HDR-TRAP-SN
			ADD 1 MS-CTR-DTHORSN GIVING WS-CTR-DTHDRSN
			PERFORM 110-FIND-TAX-STATE
			MOVE DTHDRSN-CLIENT-NAME          TO WS-NAMED-INSURED
			MOVE DTHDRSN-CLIENT-NUM           TO WS-CLIENT-ID
			MOVE DTHDRSN-CLIENT-NUM           TO UTT94-CLIENT-IN-ERROR
			MOVE MS-PGH                       TO IP-FROM-PROGRAM
			MOVE MS-PGH                       TO IP-TO-PROGRAM
			PERFORM 700-SELECT-CICLINT.


	ELSE
		IF DTCLMSN-CLM-DTL-TRAP-SN
			MOVE ZEROES TO DXQ82-RESERVE-CATAGORY
			MOVE ZEROES TO DXQ82-RETURN-CODE
			IF DTCLMSN-STATUS-CODE = "VO"
				IF (DTCLMSN-ORIG-OPEN-DATE >= WS-ACTIVITY-FROM-DATE AND 
					DTCLMSN-ORIG-OPEN-DATE <= WS-ACTIVITY-TO-DATE)
					Set 'bypass' flag so we don't process the next 'FS' record
					MOVE WS-LIT-YES TO WS-BYPASS-CLAIM-FLAG
					EXIT SECTION
				ELSE
					SET WS-DTCLMSN-VOID-YES TO TRUE
				END-IF
			ELSE
				SET WS-DTCLMSN-VOID-NO TO TRUE
			END-IF
			PERFORM 100-75-CHECK-CONVERTED-CLAIM
			IF WS-BYPASS-CLAIM
				EXIT SECTION
			ELSE 
				ADD 1 WS-CTR-DTCLMSN GIVING WS-CTR-DTCLMSN
*        Check for Runin Claims but allow NEW Claims OR OLD Claims
*        that occur AFTER the Runin is created
*        Process the Claim Records if the Claim is NOT a Runin
*        Set the Runin Flag and determine if the Claim is a Runin
			MOVE "YES" TO WS-ACCEPT-CLAIM-SWITCH
*       Test Runin Dates for Monthly Processing, for Yearly Processing do
*        NOT check the Dates because we would lose TOO MANY RECORDS.
				IF WS-STARTUP-MONTH-OR-YEAR = "M"
					PERFORM 140-CHECK-CLAIM-STATUS
				ELSE
					SET WS-RUNIN-CLAIM-NO TO TRUE
				END-IF
*        If the Claim is NOT a Runin then process it.
*WRN013187
*2014-02-02 begin
*If this is a Monthly run and a Converted-Batch, then SKIP this 
*unless it's queued. Otherwise process..
				IF WS-STARTUP-MONTH-OR-YEAR = "M"
					IF WS-ACCEPT-CLAIM-NO
						IF DTCLMSN-CONVERT-CODE = "Y"
							INITIALIZE ES-DTXYZXF-ROW
							Check of this Claim is either queued, or already assigned in DtXYZxf..
							MOVE DTCLMSN-CLAIM-NUM TO HV-DTXYZXF-CLAIM-NUM
							*0000 0001 or 0002 >MOVE ZEROES TO HV-DTXYZXF-SEQUENCE-NUM
							SET WS-DTXYZXF-FOUND-NO TO TRUE
							PERFORM 9000-SELECT-DTXYZXF-ALL-SEQ
							IF WS-DTXYZXF-FOUND-YES
								INITIALIZE ES-DTXYZXF-ROW

								SET WS-ACCEPT-CLAIM-YES TO TRUE
								CONTINUE
							ELSE
								SET WS-ACCEPT-CLAIM-NO TO TRUE
								CONTINUE
							END-IF
						ELSE
							CONTINUE
						END-IF
					ELSE
						CONTINUE
					END-IF
				ELSE
					CONTINUE
				END-IF
*2014-02-02 end
				IF WS-ACCEPT-CLAIM-YES
					PERFORM 150-CLAIM-HANDLING
				END-IF
			END-IF
		ELSE
		IF DTFINSN-FINANCE-TRAP-SN
			IF WS-BYPASS-CLAIM
				EXIT SECTION
			ELSE
				ADD 1 WS-CTR-DTFINSN GIVING WS-CTR-DTFINSN
*Check for Runin Claims but allow NEW Claims OR OLD Claims that occur AFTER the Runin is created
*Process the Finance Record then it write out XYZ Record(s),
*if the Finance Record does NOT belong to a Claim that is a Runio- 
				IF WS-ACCEPT-CLAIM-YES
					PERFORM 190-RESERVE-HANDLING
				END-IF
			END-IF
		ELSE
		IF DTTRLSN-CLIENT-TRL-TRAP-SN
			ADD 1 WS-CTR-DTTRLSN GIVING WS-CTR-DTTRLSN
		ELSE
		IF DTRECPT-TRANSMITTAL-TRLR
			ADD 1 WS-CTR-DTRECPT GIVING WS-CTR-DTRECPT
		ELSE
			ADD 1 WS-CTR-DTOTHER GIVING WS-CTR-DTOTHER
		END-IF
		END-IF
		END-IF
		END-IF
		END-IF
		END-IF.

END-OF-SECTION. EXIT.
/*********
100-75-CHECK-CONVERTED-CLAIM SECTION.
	MOVE WS-LIT-NO TO WS-BYPASS-CLAIM-FLAG.
	MOVE WS-LIT-NO TO WS-HANDLE-RUNIN-CLOSED-FLAG.
	MOVE WS-LIT-NO TO WS-HANDLE-RUNIN-OPEN-FLAG.
	MOVE WS-LIT-NO TO WS-CALL-RFQ73-FLAG.
	MOVE 0 TO WS-JUST-CHECKING-SEARCH.

*Check to see if the Claim's Coverage is VALID.
*This system does NOT handle INTERNATIONAL COVERAGES.
*Try to find the Coverage Code on the Coverage Code Table.
*If the Coverage is NOT on the Table then ASSUME IT IS A SPLIT COVERAGE and add a "P" to the Coverage and TRY AGAIN.
*If the Coverage is STILL NOT ON THE TABLE then it is probably an INTERNATIONAL COVERAGE and is NOT PROCESSED BY THIS PROGRAM.

	SET WS-MCC TO 1.
	SEARCH WS-BREAKDOWN-ENTRY
		AT END
			MOVE WS-LIT-YES TO WS-BYPASS-CLAIM-FLAG
			WHEN DTCLMSN-COV-CODE = WS-COV-MCC (WS-MCC)
				MOVE 1 TO WS-JUST-CHECKING-SEARCH
		END-SEARCH.

	IF WS-BYPASS-CLAIM-FLAG = "Y"
		MOVE WS-LIT-NO TO WS-BYPASS-CLAIM-FLAG
		MOVE DTCLMSN-COV-CODE TO WS-SECOND-TRY-COV-CODE-1-2
		MOVE "P" TO WS-SECOND-TRY-COV-CODE-3
		SET WS-MCC TO 1
		SEARCH WS-BREAKDOWN-ENTRY
			AT END
				MOVE WS-LIT-YES TO WS-BYPASS-CLAIM-FLAG
				MOVE "INVALID COV CODE" TO WS-EM-1
				MOVE DTCLMSN-COV-CODE TO WS-EM-2
				MOVE "CLAIM NUM" TO WS-EM-3
				MOVE DTCLMSN-CLAIM-NUM TO WS-EM-4
				PERFORM 9000-INITIALIZE-UTT94PRM
				MOVE "HA" TO UTT94-OPTION
				MOVE "100-75-CHECK-CONVERTED-CLAIM" TO UTT94-PARAGRAPH-NAME
				MOVE DTCLMSN-CLIENT-NUM TO UTT94-CLIENT-IN-ERROR
				MOVE WS-ERR-MESSAGE TO UTT94-KEY-IN-ERROR
				MOVE "SEARCH WS-BREAKDOWN-ENTRY ERROR" TO MSG-2000-TEXT
				MOVE MSG-2000 TO UTT94-MESSAGE-LINE (01)
				MOVE "COVERAGE CODE SEARCH INVALID COVERAGE CODE" TO UTT94-MESSAGE-LINE (02)
				MOVE WS-VERSION-LIT TO UTT94-VERSION-LIT
				PERFORM 9000-SEND-UTT94 
				WHEN WS-SECOND-TRY-COV-CODE WS-COV-MCC (WS-MCC)
					MOVE 1 TO WS-JUST-CHECKING-SEARCH
			END-SEARCH
		END-IF.
		IF DTCLMSN-CLIENT-NUM = "001064"
			PERFORM 100-80-CHECK-VF-CORP
			IF WS-BYPASS-CLAIM
				EXIT SECTION
			END-IF
		END-IF.
*This interrogates 'Converted' ..
		IF DTCLMSN-CONVERTED
			CONTINUE
		ELSE
			EXIT SECTION
		END-IF.
		SET XYZ-X TO 1.
		SEARCH XYZ-RUNIN-ENTRY
			AT END
				MOVE SPACES TO WS-RUNIN-DATE
*Converted Claim NOT FOUND in the XYZ TABLE
				EXIT SECTION
				WHEN DTCLMSN-CLIENT-NUM = XYZ-RUNIN-KEY (XYZ-X)
					MOVE XYZ-RUNIN-DATE (XYZ-X) TO WS-RUNIN-DATE
		END-SEARCH.
		
		IF WS-RUNIN-YEAR = WS-ACTIVITY-TO-YEAR AND 
		   WS-RUNIN-MONTH = WS-ACTIVITY-TO-MONTH
		   CONTINUE
		ELSE
*Converted Claim FOUND in the XYZ TABLE but with different date
		   EXIT SECTION
END-IF.
*MPD: Bypass Old Clients which were coded to GB and should of been PB.
		IF DTCLMSN-CLIENT-NUM = "011548" AND
			((DTCLMSN-ACCID-NUM = 001592) OR
			(DTCLMSN-ACCID-NUM = 001600) OR
			(DTCLMSN-ACCID-NUM = 001613) OR
			(DTCLMSN-ACCID-NUM = 001623) OR
			(DTCLMSN-ACCID-NUM = 001901) OR
			(DTCLMSN-ACCID-NUM = 001904) OR
			(DTCLMSN-ACCID-NUM-001910) OR
			(DTCLMSN-ACCID-NUM-001927) OR
			(DTCLMSN-ACCID-NUM-001957) OR
			(DTCLMSN-ACCID-NUM-001972) OR
			(DTCLMSN-ACCID-NUM-001976) OR
			(DTCLMSN-ACCID-NUM-001981) OR
			(DTCLMSN-ACCID-NUM - 001982) OR
			(DTCLMSN-ACCID-NUM-001984) OR
			(DTCLMSN-ACCID-NUM-001985) OR
			(DTCLMSN-ACCID-NUM-001986) OR
			(DTCLMSN-ACCID-NUM-001988) OR
			(DTCLMSN-ACCID-NUM-001989) OR
			(DTCLMSN-ACCID-NUM - 002488))
			MOVE WS-LIT-YES 	TO WS-BYPASS-CLAIM-FLAG
			EXIT SECTION
		END-IF.
		IF DTCLMSN-CLOSED
			MOVE WS-LIT-YES TO WS-HANDLE-RUNIN-CLOSED-FLAG
		ELSE
			MOVE WS-LIT-YES TO WS-HANDLE-RUNIN-OPEN-FLAG
		END-IF.

*If this condition is true, whether a CLOSED Claim or an OPEN Claim,
*call RFQ73 get Current Payments between Runin and Data Transfer End-Date.
		IF DTCLMSN-TOTAL-PAYMTS-DATE > WS-RUNIN-DATE
			MOVE WS-LIT-YES TO WS-CALL-RFQ73-FLAG
			MOVE WS-RUNIN-DATE TO DT-DATE-NUMERIC
			MOVE "9" TO DT-ENTRY-CODE
			CALL "UTE02" OF CS-U02 USING DT-DATE-TIME
			MOVE DT-DATE-NUMERIC TO WS-RUNIN-DATE-PLUS-1
		END-IF.
END-OF-SECTION. EXIT.