100-80-CHECK-VF-CORP SECTION.
*WRN013187
*2014-02-02 begin
IF RFCLAIM-CONVERTED-BATCH
INITIALIZE ES-DTXYZXF-ROW
Look to see if this Claim is queued in DtXYZxf table ..
MOVE RFCLAIM-CLAIM-NUM TO HV-DTXYZXF-CLAIM-NUM
MOVE ZEROES TO HV-DTXYZXF-SEQUENCE-NUM
SET WS-DTXYZXF-FOUND-NO TO TRUE
PERFORM 9000-SELECT-DTXYZXF
ELSE
CONTINUE
END-IF.
*2014-02-02 end
MOVE DTCLMSN-CLAIM-NUM TO DTQ74-CLAIM-NUM.
MOVE DTCLMSN-GB-BRANCH-NUM TO DTQ74-BRANCH.
MOVE SPACES TO DTQ74-EXT-CLAIM-ID-PRIMARY.
MOVE SPACES TO DTQ74-EXT-CLAIM-ID-SECONDARY.
MOVE "23" TO DTQ74-OPTION.
This interrogates 'Converted-batch'..
IF DTCLMSN-CONVERTED-BATCH
MOVE "N" TO DTQ74-AUTO-CREATE-FLAG
ELSE
MOVE "Y" TO DTQ74-AUTO-CREATE-FLAG
END-IF.
*WRN013187
*2014-02-02 begin
IF RFCLAIM-CONVERTED-BATCH AND
WS-DTXYZXF-FOUND-YES
MOVE "Y" TO DTQ74-AUTO-CREATE-FLAG
ELSE
CONTINUE
END-IF.
*2014-02-02 end
CALL "DTN74" OF CS-D74 USING WS-IP, DTQ74-PARAMETERS
IF DTQ74-RETURN-CODE NOT - +99
CONTINUE.


ELSE
    PERFORM 9000-INITIALIZE-UTT94PRM
    MOVE "AB"                      TO UTT94-OPTION
    MOVE "100-80-CHECK-VF-CORP"    TO UTT94-PARAGRAPH-NAME
    MOVE DTCLMSN-CLIENT-NUM         TO UTT94-CLIENT-IN-ERROR
    MOVE DTCLMSN-CLAIM-NUM          TO UTT94-KEY-IN-ERROR
    MOVE DTQ74-RETURN-CODE          TO UTT94-ERROR-STATUS
    MOVE "DTQ74"                    TO UTT94-PROG
    MOVE DTQ74-MESSAGE              TO UTT94-MESSAGE-LINE (01)
    MOVE DTQ74-PARAMETERS           TO UTT94-MESSAGE-LINE (02)
    MOVE "DTQ74 CALL ERROR 1"      TO UTT94-MESSAGE-LINE (03)
    MOVE WS-VERSION-LIT             TO UTT94-VERSION-LIT
    PERFORM 9000-SEND-UTT94
END-IF.
IF NOT DTQ74-OK
    MOVE DTQ74-MESSAGE            TO WS-DUMB-MSG-HOLD
    IF WS-DUMB-MSG-HOLD = WS-DUMB-MSG
        MOVE "WS-LIT-YES"          TO WS-BYPASS-CLAIM-FLAG
        MOVE SPACES                TO WS-DUMB-MSG-HOLD
    END-IF
END-IF.
END-OF-SECTION. EXIT.
110-FIND-TAX-STATE SECTION.
END-OF-SECTION. EXIT.
120-FILL-ACTIVITY-DATE SECTION.
    Get Data Transfer Last-Tape-Date and Next-Tape-Date, manipulate and save:
    Call UTC82 validate LAST-TAPE-DATE, then add ONE DAY.
    Call UTC82 retrieve correct format to move to DTRECPH-FROM-DATE.
    Call UTC82 validate NEXT-TAPE-DATE, then add ONE DAY.
    CALL UTCR2 retrieve correct format to move to DTRECPH-TO-DATE.
    MOVE WS-SAVE-PRI-AS-OF-DATE      TO DT-DATE-YEARMMDD.
    MOVE 1                          TO DT-ENTRY-CODE.
    CALL "UTEO3" OF CS-U82 USING OT-DATE-TIME.
    ADD 3640 TO OT-SYSTEM-TIME.
    MOVE 4                          TO DT-ENTRY-CODE.
    CALL "UTEO4" OF CS-U82 USING OT-DATE-TIME.
    MOVE OT-DATE-YEARMMDD           TO DTRECPH-ACTIVITY-FROM-DATE.



MOVE WS-SAVE-CUR-AS-OF-DATE TO DT-DATE-YEARMMDD.
MOVE 1 TO DT-ENTRY-CODE.
CALL "UTE02" OF CS-U02 USING DT-DATE-TIME.
ADD +1440 TO DT-SYSTEM-TIME.
MOVE 4 TO DT-ENTRY-CODE.
CALL "UTE02" OF CS-002 USING DT-DATE-TIME.
MOVE DT-DATE-YEARMMDD TO DTRECPH-ACTIVITY-TO-DATE.
*
END-OF-SECTION. EXIT.
/******************************************************************
125-CHECK-STARTUP SECTION.
Validate Startup Text Date against Standard Input File Date
SET DT-GREG-DATE TO TRUE.
MOVE 1 TO WS-CENT-GET-DD.
MOVE WS-STARTUP-MONTH TO WS-CENT-GET-MM.
MOVE WS-STARTUP-YEAR TO WS-CENT-GET-YY.
MOVE WS-CENT-GET TO WS-CENT-GET-REVISED.
MOVE WS-CENT-GET-REVISED TO DT-DATE-NUMERIC.
CALL "UTE02" OF CS-002 USING DT-DATE-TIME.
MOVE DT-CENT TO WS-STARTUP-CENT.
MOVE WS-STARTUP-YEAR TO WS-STARTUP-YY.
MOVE WS-STARTUP-MONTH TO WS-COMPARE-MO.
MOVE WS-STARTUP-YYYY TO WS-COMPARE-YYYY.
COMPUTE WS-COMPARE-MO = WS-COMPARE-MO - 1
END-COMPUTE.
IF WS-COMPARE-MO = 0
MOVE 12 TO WS-COMPARE-MO
COMPUTE WS-COMPARE-YY = WS-COMPARE-YY - 1
END-COMPUTE
END-IF.

IF WS-STARTUP-MONTH NOT = DTRECPH-ACTIVITY-TO-MO OR
WS-STARTUP-YYYY NOT = DTRECPH-ACTIVITY-TO-YR
    PERFORM 9000-INITIALIZE-UTT94PRM
    MOVE "AB"                           TO UTT94-OPTION
    MOVE "125-CHECK-STARTUP"              TO UTT94-PARAGRAPH-NAME
    MOVE SPACES                          TO UTT94-CLIENT-IN-ERROR
    MOVE SPACES                          TO UTT94-KEY-IN-ERROR
    MOVE "STRTUP DAT HAS - IN DAT"        TO UTT94-MESSAGE-LINE (01)
    STRING "STARTUP TEXT DATE"
           WS-STARTUP-MONTH              DELIMITED BY SIZE
           WS-STARTUP-YYYY               DELIMITED BY SIZE
           DELIMITED BY SIZE             INTO UTT94-MESSAGE-LINE (02)
    END-STRING
    STRING "DTRECPH INPUT FILE DATE"
           DTRECPH-ACTIVITY-TO-MO        DELIMITED BY SIZE
           DTRECPH-ACTIVITY-TO-YR        DELIMITED BY SIZE
           DELIMITED BY SIZE             INTO UTT94-MESSAGE-LINE (03)
    END-STRING
    MOVE WS-VERSION-LIT                   TO UTT94-VERSION-LIT
    PERFORM 9000-SEND-UTT94
END-IF.
END-OF-SECTION. EXIT.
************************************************************************
148-CHECK-CLAIM-STATUS SECTION.
    This section is ONLY invoked for the XYZ MONTHLY D.T. process, **NOT ITD**
    Do NOT process OLD Runin Claims.
    A Run-in Claim is one that belonged to a TPA (Third Party Administrator)
    that we are NOW REPLACING.
    They take a copy of their data.
    Then we check for it's validity, and if it PASSES OUR EDITS
    then we add the data to OUR system.
    If this Claim **IS NOT RUN-IN**, then we ADD the data to OUR Data Base
    and send to our Client so they can ADD IT TO THEIR DATA BASE.
    If this Claim **IS RUNIN** but ALSO a NEW CLAIM,
    then it is processed like a NON RUN-IN Claim.
    If this Claim is a NEW CLAIM, then we process it and it is
    added to BOTH OUR Data Base and our Client's Data Base.
    This flag has to be set BEFORE the DTCLMSN-CONVERT-CODE check ..
    SET WS-RUNIN-CLAIM-NO TO TRUE.




IF DTCLMSN-CONVERT-CODE = SPACES
    EXIT SECTION.
END-IF.
IF this Claim is a RUN-IN Claim, then check to see if it is an
OLD OR NEW CLAIM.
IF it is an OLD CLAIM then REJECT IT NOW.
(Claim will be processed when the Run-in Process adds it to our Data Base.)
This interrogates 'Converted-batch'...
IF DTCLMSN-CONVERTED-BATCH AND
   DTCLMSN-STATUS-DATE = DTCLMSN-ORIG-OPEN-DATE
    INITIALIZE WS-EXCLUDE-RUNIN-PAYMT-TBL
    INITIALIZE WS-EXCLUDE-RUNIN-RECOV-TBL
    SET WS-EXCLUDE-CLAIM-YES TO TRUE
    PERFORM 142-CHECK-CLTRLOG
    Then all CLTRLOG records this Claim this period must be DTQ61 or DTQ62 ..
    IF WS-EXCLUDE-CLAIM-YES
        MOVE "NO" TO WS-ACCEPT-CLAIM-SWITCH
        ADD 1 TO WS-CTR-REJECTED-RUN-INS
        EXIT SECTION
    END-IF
END-IF.

There are RUN-INs but there are ALSO NEW CLAIMS,
therefore we must ACCEPT THE CLAIM (and add to its counter) ..
ADD 1 TO WS-CTR-ACCEPTED-RUN-INS.

END-OF-SECTION. EXIT.
/
142-CHECK-CLTRLOG SECTION.

MOVE DTCLMSN-CLAIM-NUM TO WS-CLTRLOG-ALTKEY-CN.
MOVE DTCLMSN-CLIENT-NUM TO WS-CLTRLOG-CLIENT-NUM.
MOVE WS-ACTIVITY-FROM-YEAR TO WS-CLTRLOG-TRANS-YEAR.
MOVE WS-ACTIVITY-FROM-MONTH TO WS-CLTRLOG-TRANS-MONTH.
MOVE ZEROES TO WS-CLTRLOG-TRANS-DAY.
PERFORM 144-POSITION-CLTRLOG-FILE.
PERFORM 146-READ-CLTRLOG-FILE
UNTIL DBP-EOF (WS-DB-INDEX).
END-OF-SECTION. EXIT.
/
144-POSITION-CLTRLOG-FILE SECTION.
SET WS-FIRST-CLTRLOG-READ-YES TO TRUE.
SET WS-DB-INDEX TO WS-DB-CLTRLOG.
MOVE "OBPOS " TO WS-DB-OPERATION.



ENTER "DBPOS" OF CS-D02 USING WS-IP
    WS-DB (WS-DB-INDEX)
    WS-CLTRLOG-KEY.
IF NOT DBP-OK (WS-DB-INDEX)
    a serious error, will log "FC" ...
    PERFORM 9000-INITIALIZE-UTT94PRM
    MOVE "FC"                          TO UTT94-OPTION
    MOVE "144-POSITION-CLTRLOG-FILE"    TO UTT94-PARAGRAPH-NAME
    MOVE SPACES                        TO UTT94-CLIENT-IN-ERROR
    MOVE WS-CLTRLOG-KEY                TO UTT94-KEY-IN-ERROR
    MOVE DBP-ERROR-CODE (WS-DB-INDEX)   TO UTT94-ERROR-STATUS
    MOVE "DBPOS"                       TO UTT94-DB-ACCESS
    MOVE "DBPOS CLTRLOG ERROR"          TO UTT94-MESSAGE-LINE (02)
    MOVE WS-VERSION-LIT                 TO UTT94-VERSION-LIT
    MOVE UTT94-PARAMETERS               TO WS-HOLD-UTT94-PARAMETERS
    PERFORM 9000-DBT02-ERROR
    MOVE WS-HOLD-UTT94-PARAMETERS      TO UTT94-PARAMETERS
    MOVE "AB"                          TO UTT94-OPTION
    PERFORM 9000-SEND-UTT94
END-IF.
END-OF-SECTION. EXIT.
