000100****************************************************
000200* BLEND152 COPYBOOK: CONTAINS LTCH PROVIDERS WITH  *
000300* THEIR BLENDED IPPS COMPARABLE WAGE INDEX.        *
000400* FOR USE WITH LTCH PRICER VERSION 15.2            *
000500****************************************************
000600 01  W-IPPS-BLEND-WI-FILLS.
000700     03                          PIC X(36)   VALUE
000800         '012012008574072003012257072004011837'.
000900     03                          PIC X(36)   VALUE
001000         '072006011837092002010178092003010178'.
001100     03                          PIC X(36)   VALUE
001200         '142006010179192006008291192010008291'.
001300     03                          PIC X(36)   VALUE
001400         '192011008291192013007603192019007603'.
001500     03                          PIC X(36)   VALUE
001600         '192020007808192022007487192024007603'.
001700     03                          PIC X(36)   VALUE
001800         '192025008291192028007487192029007808'.
001900     03                          PIC X(36)   VALUE
002000         '192032007808192033007808192034007487'.
002100     03                          PIC X(36)   VALUE
002200         '192035007487192037007546192052007487'.
002300     03                          PIC X(36)   VALUE
002400         '232026008895232029008895252004007553'.
002500     03                          PIC X(36)   VALUE
002600         '252005007886252006007553252008007553'.
002700     03                          PIC X(36)   VALUE
002800         '252010007553252013007553312014011119'.
002900     03                          PIC X(36)   VALUE
003000         '312019012973312020011132312022011119'.
003100     03                          PIC X(36)   VALUE
003200         '312024011132332006012973332008012973'.
003300     03                          PIC X(36)   VALUE
003400         '332014012973332022012973342015008937'.
003500     03                          PIC X(36)   VALUE
003600         '342016008669342019007931392024008582'.
003700     03                          PIC X(36)   VALUE
003800         '392025008344392028008582392036008582'.
003900     03                          PIC X(36)   VALUE
004000         '392037008344392041008582392042008344'.
004100     03                          PIC X(36)   VALUE
004200         '392043008582392044008582392045008582'.
004300     03                          PIC X(36)   VALUE
004400         '392048010332392049008582412001011461'.
004500     03                          PIC X(36)   VALUE
004600         '422008008961422009008961442006008919'.
004700     03                          PIC X(36)   VALUE
004800         '442011008919442012007350442015007350'.
004900     03                          PIC X(36)   VALUE
005000         '442016007350512003008693522008011109'.
005100 01  W-IPPS-BLEND-WI-TBL REDEFINES W-IPPS-BLEND-WI-FILLS.
005200     03  IBW-ENTRY OCCURS 66 TIMES
005300             ASCENDING KEY IS IBW-PROV
005400             INDEXED BY IBW-INDX.
005500         05  IBW-PROV            PIC X(6).
005600         05  IBW-WAGE-INDEX      PIC S9(02)V9(04).
005700 01  IBW-MAX                     PIC S9(7)   COMP-3
005800                                 VALUE +66.
