000100 01 DRG-TABLE.                                                    00010002
000200           05 D-TAB.                                              00020001
000300               10 FILLER             PIC X(08) VALUE              00030001
000400             '20101001'.                                          00040001
000500               10 FILLER             PIC X(56) VALUE              00050001
000600       '26344131600419136127176002261812393010036611240322200271'.00060001
000700               10 FILLER             PIC X(56) VALUE              00070001
000800       '10177114900199048353083000930933501540018604963210100117'.00080001
000900               10 FILLER             PIC X(56) VALUE              00090001
001000       '00000000000000037831086000970476661230015503131108500101'.00100001
001100               10 FILLER             PIC X(56) VALUE              00110001
001200       '01950505700068115947211002820595041670019300000000000000'.00120001
001300               10 FILLER             PIC X(56) VALUE              00130001
001400       '00000000000000000000000000000000000000000008247914100173'.00140001
001500               10 FILLER             PIC X(56) VALUE              00150001
001600       '06288612100139041581067000840508830820011803495205700081'.00160001
001700               10 FILLER             PIC X(56) VALUE              00170001
001800       '04757508800115029825058000730213070300003905354910100131'.00180001
001900               10 FILLER             PIC X(56) VALUE              00190001
002000       '02874104700066016433025000330412610860012301922003600053'.00200001
002100               10 FILLER             PIC X(56) VALUE              00210001
002200       '01362602100026035242047000700214370220003201639001300015'.00220001
002300               10 FILLER             PIC X(56) VALUE              00230001
002400       '03154305700084015462024000350101850140001703935309000121'.00240001
002500               10 FILLER             PIC X(56) VALUE              00250001
002600       '02143005000067016905024000320000000000000000000000000000'.00260001
002700               10 FILLER             PIC X(56) VALUE              00270001
002800       '00000000000000000000000000000000000000000000000000000000'.00280001
002900               10 FILLER             PIC X(56) VALUE              00290001
003000       '00000000000000000000000000000000000000000001610904500067'.00300001
003100               10 FILLER             PIC X(56) VALUE              00310001
003200       '00844102900036014863046000630106490350004601674805500071'.00320001
003300               10 FILLER             PIC X(56) VALUE              00330001
003400       '00935003700048015856054000720098110410004900757803200038'.00340001
003500               10 FILLER             PIC X(56) VALUE              00350001
003600       '02956806400084019479048000560152510340003901867405100069'.00360001
003700               10 FILLER             PIC X(56) VALUE              00370001
003800       '01166704000048008198027000330142310420005500875102700033'.00380001
003900               10 FILLER             PIC X(56) VALUE              00390001
004000       '00731102300028018417056000730110540410005100749902500031'.00400001
004100               10 FILLER             PIC X(56) VALUE              00410001
004200       '01290704200056008606032000410165670550007000905003300039'.00420001
004300               10 FILLER             PIC X(56) VALUE              00430001
004400       '01737605100064010154035000440075330260003101190903600049'.00440001
004500               10 FILLER             PIC X(56) VALUE              00450001
004600       '00739202700034020130035000610132640340004700895902200028'.00460001
004700               10 FILLER             PIC X(56) VALUE              00470001
004800       '02142305200072012051037000460079290230002901487204200055'.00480001
004900               10 FILLER             PIC X(56) VALUE              00490001
005000       '00966702900037006927019000230163180440006200940403300042'.00500001
005100               10 FILLER             PIC X(56) VALUE              00510001
005200       '00682702400029036769089001170239770660008401924704600056'.00520001
005300               10 FILLER             PIC X(56) VALUE              00530001
005400       '03219109000116019106064000790120840410005201510704500060'.00540001
005500               10 FILLER             PIC X(56) VALUE              00550001
005600       '00761902800034010288031000430067010240003000000000000000'.00560001
005700               10 FILLER             PIC X(56) VALUE              00570001
005800       '00000000000000000000000000000000000000000000000000000000'.00580001
005900               10 FILLER             PIC X(56) VALUE              00590001
006000       '00000000000000000000000000000000000000000000000000000000'.00600001
006100               10 FILLER             PIC X(56) VALUE              00610001
006200       '01831103900056008989020000260120840350004601267503000044'.00620001
006300               10 FILLER             PIC X(56) VALUE              00630001
006400       '00730501600020000000000000000000000000000000000000000000'.00640001
006500               10 FILLER             PIC X(56) VALUE              00650001
006600       '00910404100051006522033000400071440220002701190303800053'.00660001
006700               10 FILLER             PIC X(56) VALUE              00670001
006800       '00685902700034000000000000000000000000000000000000000000'.00680001
006900               10 FILLER             PIC X(56) VALUE              00690001
007000       '02234903700052012299023000290209150410005601244702100027'.00700001
007100               10 FILLER             PIC X(56) VALUE              00710001
007200       '01700003600054008514017000210190820430006400975101700023'.00720001
007300               10 FILLER             PIC X(56) VALUE              00730001
007400       '01300703600050007841019000250087560140001800000000000000'.00740001
007500               10 FILLER             PIC X(56) VALUE              00750001
007600       '00000000000000000000000000000000000000000000000000000000'.00760001
007700               10 FILLER             PIC X(56) VALUE              00770001
007800       '00000000000000021886065000910124130410005700806602400033'.00780001
007900               10 FILLER             PIC X(56) VALUE              00790001
008000       '00638902200026012808037000500063930230002900958403300043'.00800001
008100               10 FILLER             PIC X(56) VALUE              00810001
008200       '00629002500031013965043000580090170330004200622602400029'.00820001
008300               10 FILLER             PIC X(56) VALUE              00830001
008400       '01579404800067009027034000440058970220002700000000000000'.00840001
008500               10 FILLER             PIC X(56) VALUE              00850001
008600       '00000000000000000000000000000508281150014002623606200074'.00860001
008700               10 FILLER             PIC X(56) VALUE              00870001
008800       '01775803700044037383095001190205670580007401300803300043'.00880001
008900               10 FILLER             PIC X(56) VALUE              00890001
009000       '00000000000000000000000000000000000000000000000000000000'.00900001
009100               10 FILLER             PIC X(56) VALUE              00910001
009200       '00000000000000000000000000000160960570006801070604200049'.00920001
009300               10 FILLER             PIC X(56) VALUE              00930001
009400       '02066706800085014887056000680098610410005001736105700075'.00940001
009500               10 FILLER             PIC X(56) VALUE              00950001
009600       '01218204200054008096028000370149420520006500975503600043'.00960001
009700               10 FILLER             PIC X(56) VALUE              00970001
009800       '00680302600030015637053000670110270390004900767802800035'.00980001
009900               10 FILLER             PIC X(56) VALUE              00990001
010000       '01280904300055011924045000550097350380004600722003100037'.01000001
010100               10 FILLER             PIC X(56) VALUE              01010001
010200       '01479605300065010152042000500070960310003701606205600069'.01020001
010300               10 FILLER             PIC X(56) VALUE              01030001
010400       '01117604200051008203031000380178950630008001025203700048'.01040001
010500               10 FILLER             PIC X(56) VALUE              01050001
010600       '00721002800036008424034000410060810260003200671402100027'.01060001
010700               10 FILLER             PIC X(56) VALUE              01070001
010800       '01297203900053007575026000330520681260014702263005100070'.01080001
010900               10 FILLER             PIC X(56) VALUE              01090001
011000       '00000000000000000000000000000000000000000000000000000000'.01100001
011100               10 FILLER             PIC X(56) VALUE              01110001
011200       '00000000000000000000000000001260860690012210023814600170'.01120001
011300               10 FILLER             PIC X(56) VALUE              01130001
011400       '06803809800109053293072000800808311080013105378707200080'.01140001
011500               10 FILLER             PIC X(56) VALUE              01150001
011600       '04480105600060085230094001180642500450006207581907700097'.01160001
011700               10 FILLER             PIC X(56) VALUE              01170001
011800       '06020204200053064510050000770519360200003107588111800142'.01180001
011900               10 FILLER             PIC X(56) VALUE              01190001
012000       '04774507200083035451046000550785821090012905818308500094'.01200001
012100               10 FILLER             PIC X(56) VALUE              01210001
012200       '07208112100137048281082000890585300930010803770706000065'.01220001
012300               10 FILLER             PIC X(56) VALUE              01230001
012400       '05190307100101030830029000420455441120014302658907800096'.01240001
012500               10 FILLER             PIC X(56) VALUE              01250001
012600       '01463105000060037277063000810265080390004902039802200028'.01260001
012700               10 FILLER             PIC X(56) VALUE              01270001
012800       '04248602500038031802035000500196910180002302924804400060'.01280001
012900               10 FILLER             PIC X(56) VALUE              01290001
013000       '01773202200028028836050000700179920220003002975405200079'.01300001
013100               10 FILLER             PIC X(56) VALUE              01310001
013200       '02401404400060016152020000270250430700009201596905600070'.01320001
013300               10 FILLER             PIC X(56) VALUE              01330001
013400       '00975003400043028880052000700183340240003203550007700107'.01340001
013500               10 FILLER             PIC X(56) VALUE              01350001
013600       '01646903200045011246020000260175650350005602530505500082'.01360001
013700               10 FILLER             PIC X(56) VALUE              01370001
013800       '02315702300034000000000000000000000000000000000000000000'.01380001
013900               10 FILLER             PIC X(56) VALUE              01390001
014000       '00000000000000000000000000000000000000000000000000000000'.01400001
014100               10 FILLER             PIC X(56) VALUE              01410001
014200       '00000000000000000000000000000000000000000000000000000000'.01420001
014300               10 FILLER             PIC X(56) VALUE              01430001
014400       '00000000000000000000000000000000000000000001850305200066'.01440001
014500               10 FILLER             PIC X(56) VALUE              01450001
014600       '01191203600044008064022000280171510320005100888802100030'.01460001
014700               10 FILLER             PIC X(56) VALUE              01470001
014800       '00571201400018020014048000650108790250003202939708600108'.01480001
014900               10 FILLER             PIC X(56) VALUE              01490001
015000       '01849206400078012959044000560149430480006201030204000049'.01500001
015100               10 FILLER             PIC X(56) VALUE              01510001
015200       '00685302800033010373044000540064030340004001169201800028'.01520001
015300               10 FILLER             PIC X(56) VALUE              01530001
015400       '00679201400017004497011000120140720470006100977603900049'.01540001
015500               10 FILLER             PIC X(56) VALUE              01550001
015600       '00661502800035009755030000400058300200002401026303500046'.01560001
015700               10 FILLER             PIC X(56) VALUE              01570001
015800       '00613802200028014667044000590079740270003401233904000052'.01580001
015900               10 FILLER             PIC X(56) VALUE              01590001
016000       '00838703000037005709021000250050700180002200717202400029'.01600001
016100               10 FILLER             PIC X(56) VALUE              01610001
016200       '00549901700021018145050000680096810330004200614702100026'.01620001
016300               10 FILLER             PIC X(56) VALUE              01630001
016400       '00000000000000000000000000000000000000000000000000000000'.01640001
016500               10 FILLER             PIC X(56) VALUE              01650001
016600       '00000000000000000000000000000000000000000000000000000000'.01660001
016700               10 FILLER             PIC X(56) VALUE              01670001
016800       '00000000000000058142126001620272310690008801429802900038'.01680001
016900               10 FILLER             PIC X(56) VALUE              01690001
017000       '05280712500154025830078000910162670480005304863511800142'.01700001
017100               10 FILLER             PIC X(56) VALUE              01710001
017200       '02496007100081015979042000490427771140013702345607200088'.01720001
017300               10 FILLER             PIC X(56) VALUE              01730001
017400       '01478904000051032115083001000186590560006501239303200037'.01740001
017500               10 FILLER             PIC X(56) VALUE              01750001
017600       '02264304900066013246030000380095680170002003158608900112'.01760001
017700               10 FILLER             PIC X(56) VALUE              01770001
017800       '01703506000070011883042000460241830630008801370504100054'.01780001
017900               10 FILLER             PIC X(56) VALUE              01790001
018000       '00798102300029024877056000790135390350004500862801900024'.01800001
018100               10 FILLER             PIC X(56) VALUE              01810001
018200       '02751006300084015523040000500103290230002804029309200127'.01820001
018300               10 FILLER             PIC X(56) VALUE              01830001
018400       '02146605700074013010030000400000000000000000000000000000'.01840001
018500               10 FILLER             PIC X(56) VALUE              01850001
018600       '00000000000000000000000000000000000000000000000000000000'.01860001
018700               10 FILLER             PIC X(56) VALUE              01870001
018800       '00000000000000000000000000000000000000000001757805100067'.01880001
018900               10 FILLER             PIC X(56) VALUE              01890001
019000       '01077203700045007546026000310209860680008801293505300065'.01900001
019100               10 FILLER             PIC X(56) VALUE              01910001
019200       '00859903900046020674063000840128010440005800847802800036'.01920001
019300               10 FILLER             PIC X(56) VALUE              01930001
019400       '01754105000064010274035000420071460260003001965605800076'.01940001
019500               10 FILLER             PIC X(56) VALUE              01950001
019600       '01120703900048008130029000350119820420005300832603000036'.01960001
019700               10 FILLER             PIC X(56) VALUE              01970001
019800       '01910206300084010435042000530078130320003901645705500072'.01980001
019900               10 FILLER             PIC X(56) VALUE              01990001
020000       '00934403900048006369028000330115500390005100717302800034'.02000001
020100               10 FILLER             PIC X(56) VALUE              02010001
020200       '01659304900068009939037000470067490250003100000000000000'.02020001
020300               10 FILLER             PIC X(56) VALUE              02030001
020400       '00000000000000000000000000000000000000000000000000000000'.02040001
020500               10 FILLER             PIC X(56) VALUE              02050001
020600       '00000000000000000000000000000000000000000000000000000000'.02060001
020700               10 FILLER             PIC X(56) VALUE              02070001
020800       '05574312000158027791065000840186650420005203936811000135'.02080001
020900               10 FILLER             PIC X(56) VALUE              02090001
021000       '02487507400089016114049000580368180990011802491207000083'.02100001
021100               10 FILLER             PIC X(56) VALUE              02110001
021200       '01718004500054036675093001140208970620007301308003700044'.02120001
021300               10 FILLER             PIC X(56) VALUE              02130001
021400       '02502906200078016996044000540116980240003003644309200130'.02140001
021500               10 FILLER             PIC X(56) VALUE              02150001
021600       '01891005100070012742030000410445771090014402433507100091'.02160001
021700               10 FILLER             PIC X(56) VALUE              02170001
021800       '01627304400057000000000000000000000000000000000000000000'.02180001
021900               10 FILLER             PIC X(56) VALUE              02190001
022000       '00000000000000000000000000000000000000000001700105000065'.02200001
022100               10 FILLER             PIC X(56) VALUE              02210001
022200       '00954803600046006152025000320180180560007401221504200055'.02220001
022300               10 FILLER             PIC X(56) VALUE              02230001
022400       '00900402800037018342054000750100890400005000689002900035'.02240001
022500               10 FILLER             PIC X(56) VALUE              02250001
022600       '01824205100071009857037000480066150270003301558604800062'.02260001
022700               10 FILLER             PIC X(56) VALUE              02270001
022800       '01068803600045007411025000310000000000000000000000000000'.02280001
022900               10 FILLER             PIC X(56) VALUE              02290001
023000       '00000000000000000000000000000000000000000000000000000000'.02300001
023100               10 FILLER             PIC X(56) VALUE              02310001
023200       '10265310700135072559055000670543080310003709288510800134'.02320001
023300               10 FILLER             PIC X(56) VALUE              02330001
023400       '06202405900070049379035000400650650740009103871303300039'.02340001
023500               10 FILLER             PIC X(56) VALUE              02350001
023600       '04938506700082033425037000410499831100015102852806900089'.02360001
023700               10 FILLER             PIC X(56) VALUE              02370001
023800       '01790504100053049144073000900323210430005002572803300036'.02380001
023900               10 FILLER             PIC X(56) VALUE              02390001
024000       '03472406700080021039034000370473010660009302772202600038'.02400001
024100               10 FILLER             PIC X(56) VALUE              02410001
024200       '02076801500018034905091001190195940610007700992003200041'.02420001
024300               10 FILLER             PIC X(56) VALUE              02430001
024400       '03328608900111022546053000680163670240003403093907700090'.02440001
024500               10 FILLER             PIC X(56) VALUE              02450001
024600       '01888605100056015372041000450240190300003701955402000022'.02460001
024700               10 FILLER             PIC X(56) VALUE              02470001
024800       '03213109000110020339061000720147240440005101721703800047'.02480001
024900               10 FILLER             PIC X(56) VALUE              02490001
025000       '01214102500029017916030000430099140170002103067006800086'.02500001
025100               10 FILLER             PIC X(56) VALUE              02510001
025200       '01851904200050013140027000320286830760010201620704100054'.02520001
025300               10 FILLER             PIC X(56) VALUE              02530001
025400       '01077002000026019912054000730099170220003003028807600103'.02540001
025500               10 FILLER             PIC X(56) VALUE              02550001
025600       '01584604600060010305023000280228090650008501568505000062'.02560001
025700               10 FILLER             PIC X(56) VALUE              02570001
025800       '01077002500031011815027000380187110340004501395601700021'.02580001
025900               10 FILLER             PIC X(56) VALUE              02590001
026000       '01314802300035021704050000630146900320003901046101800021'.02600001
026100               10 FILLER             PIC X(56) VALUE              02610001
026200       '01300703500048008209021000270318940770009801924404700059'.02620001
026300               10 FILLER             PIC X(56) VALUE              02630001
026400       '01479702600034000000000000000000000000000000000000000000'.02640001
026500               10 FILLER             PIC X(56) VALUE              02650001
026600       '00000000000000000000000000000000000000000000000000000000'.02660001
026700               10 FILLER             PIC X(56) VALUE              02670001
026800       '00000000000000000000000000000000000000000000000000000000'.02680001
026900               10 FILLER             PIC X(56) VALUE              02690001
027000       '00000000000000000000000000000000000000000000000000000000'.02700001
027100               10 FILLER             PIC X(56) VALUE              02710001
027200       '01565704900065007601031000390135270450005800719103200037'.02720001
027300               10 FILLER             PIC X(56) VALUE              02730001
027400       '00827503500041006108026000310204670710009401312605400068'.02740001
027500               10 FILLER             PIC X(56) VALUE              02750001
027600       '00871303700047019521063000830115970450005600777503400041'.02760001
027700               10 FILLER             PIC X(56) VALUE              02770001
027800       '02546706400090011712042000540073480290003601964806700088'.02780001
027900               10 FILLER             PIC X(56) VALUE              02790001
028000       '01203504800061008276033000400163980520006800820403300040'.02800001
028100               10 FILLER             PIC X(56) VALUE              02810001
028200       '01135504300055006812030000370109540360004900656802600032'.02820001
028300               10 FILLER             PIC X(56) VALUE              02830001
028400       '01602105400068008823036000440177170520007201002203600046'.02840001
028500               10 FILLER             PIC X(56) VALUE              02850001
028600       '00621102100026013944045000580071530300003601470204900065'.02860001
028700               10 FILLER             PIC X(56) VALUE              02870001
028800       '00909503800047006625028000340000000000000000000000000000'.02880001
028900               10 FILLER             PIC X(56) VALUE              02890001
029000       '00000000000000000000000000000000000000000000000000000000'.02900001
029100               10 FILLER             PIC X(56) VALUE              02910001
029200       '03246109100125018675067000850108990420005203924809100130'.02920001
029300               10 FILLER             PIC X(56) VALUE              02930001
029400       '01703504100062010416024000330295760770010401495903800054'.02940001
029500               10 FILLER             PIC X(56) VALUE              02950001
029600       '00922301800024010567020000270084540150001701515303500050'.02960001
029700               10 FILLER             PIC X(56) VALUE              02970001
029800       '01041101700022000000000000000000000000000000000000000000'.02980001
029900               10 FILLER             PIC X(56) VALUE              02990001
030000       '00000000000000000000000000000000000000000001766906200082'.03000001
030100               10 FILLER             PIC X(56) VALUE              03010001
030200       '01070904800058007591036000460186900590007800877903700046'.03020001
030300               10 FILLER             PIC X(56) VALUE              03030001
030400       '01559605500075010611041000540062650250003200960204100049'.03040001
030500               10 FILLER             PIC X(56) VALUE              03050001
030600       '00672803000036014748053000670083770380004501236103900052'.03060001
030700               10 FILLER             PIC X(56) VALUE              03070001
030800       '00718202700033013082043000600068570280003700000000000000'.03080001
030900               10 FILLER             PIC X(56) VALUE              03090001
031000       '00000000000000000000000000000000000000000000000000000000'.03100001
031100               10 FILLER             PIC X(56) VALUE              03110001
031200       '00000000000000024554047000650139700250003004493412400156'.03120001
031300               10 FILLER             PIC X(56) VALUE              03130001
031400       '02000606500079012006041000510352140460007401862702600034'.03140001
031500               10 FILLER             PIC X(56) VALUE              03150001
031600       '01474701600019034166094001250185580610007601012203800047'.03160001
031700               10 FILLER             PIC X(56) VALUE              03170001
031800       '02242304600069011701021000300078210120001403381907200106'.03180001
031900               10 FILLER             PIC X(56) VALUE              03190001
032000       '02265006500080014164034000450000000000000000000000000000'.03200001
032100               10 FILLER             PIC X(56) VALUE              03210001
032200       '00000000000000000000000000000000000000000000000000000000'.03220001
032300               10 FILLER             PIC X(56) VALUE              03230001
032400       '01446204500059008306032000400055440230002801140003600051'.03240001
032500               10 FILLER             PIC X(56) VALUE              03250001
032600       '00691602900036010290034000470181590600007601065504200052'.03260001
032700               10 FILLER             PIC X(56) VALUE              03270001
032800       '00719802900036000000000000000000000000000000000000000000'.03280001
032900               10 FILLER             PIC X(56) VALUE              03290001
033000       '00000000000000000000000000000000000000000003044206300074'.03300001
033100               10 FILLER             PIC X(56) VALUE              03310001
033200       '06092913600166030054082000930195670480005603571307700100'.03320001
033300               10 FILLER             PIC X(56) VALUE              03330001
033400       '02000404900059014224030000340349880790010801903004500060'.03340001
033500               10 FILLER             PIC X(56) VALUE              03350001
033600       '01264102400029030158075001070147180360005201107401500019'.03360001
033700               10 FILLER             PIC X(56) VALUE              03370001
033800       '02865308700113016440045000640079190180002402517506600089'.03380001
033900               10 FILLER             PIC X(56) VALUE              03390001
034000       '01259703200044007770018000230144000410005600788501800022'.03400001
034100               10 FILLER             PIC X(56) VALUE              03410001
034200       '02926005900095020934046000670133790160002100000000000000'.03420001
034300               10 FILLER             PIC X(56) VALUE              03430001
034400       '00000000000000000000000000000000000000000000000000000000'.03440001
034500               10 FILLER             PIC X(56) VALUE              03450001
034600       '00000000000000016407051000680102430400004900658702800034'.03460001
034700               10 FILLER             PIC X(56) VALUE              03470001
034800       '00894402500034018238058000780108380380005000647902200028'.03480001
034900               10 FILLER             PIC X(56) VALUE              03490001
035000       '01218504600058007864034000410161560330004301118601800023'.03500001
035100               10 FILLER             PIC X(56) VALUE              03510001
035200       '01350503900052007096021000260120820430005700659002600032'.03520001
035300               10 FILLER             PIC X(56) VALUE              03530001
035400       '00777102400031016098052000680099990370004700675702600032'.03540001
035500               10 FILLER             PIC X(56) VALUE              03550001
035600       '00000000000000000000000000000000000000000000000000000000'.03560001
035700               10 FILLER             PIC X(56) VALUE              03570001
035800       '00000000000000000000000000000177470320004201258101600019'.03580001
035900               10 FILLER             PIC X(56) VALUE              03590001
036000       '01863003400057012712014000170176390520007300808402100027'.03600001
036100               10 FILLER             PIC X(56) VALUE              03610001
036200       '01180202900041006544016000180174330410006000997401200014'.03620001
036300               10 FILLER             PIC X(56) VALUE              03630001
036400       '01613804600064008044020000260000000000000000000000000000'.03640001
036500               10 FILLER             PIC X(56) VALUE              03650001
036600       '00000000000000016891054000770101900390005100621102100027'.03660001
036700               10 FILLER             PIC X(56) VALUE              03670001
036800       '01274204700061007013028000350136570490006400761203300041'.03680001
036900               10 FILLER             PIC X(56) VALUE              03690001
037000       '00989203600047006414023000290000000000000000000000000000'.03700001
037100               10 FILLER             PIC X(56) VALUE              03710001
037200       '00000000000000024364052000700116840220002704394311500140'.03720001
037300               10 FILLER             PIC X(56) VALUE              03730001
037400       '02037505700066012324032000360343000740009801528003800047'.03740001
037500               10 FILLER             PIC X(56) VALUE              03750001
037600       '01097902200026013883032000410090790180002101515104000055'.03760001
037700               10 FILLER             PIC X(56) VALUE              03770001
037800       '00804502000024013373030000420088520150001800916901400017'.03780001
037900               10 FILLER             PIC X(56) VALUE              03790001
038000       '02527506200085009368022000280000000000000000000000000000'.03800001
038100               10 FILLER             PIC X(56) VALUE              03810001
038200       '00000000000000020295064000880114440400005300636102300031'.03820001
038300               10 FILLER             PIC X(56) VALUE              03830001
038400       '01656506000078010963047000570073680330004000838802900038'.03840001
038500               10 FILLER             PIC X(56) VALUE              03850001
038600       '00521901800022000000000000000000000000000000000000000000'.03860001
038700               10 FILLER             PIC X(56) VALUE              03870001
038800       '01126903900049007995029000310091110240002701811204700058'.03880001
038900               10 FILLER             PIC X(56) VALUE              03890001
039000       '02063103500057007017016000210000000000000000000000000000'.03900001
039100               10 FILLER             PIC X(56) VALUE              03910001
039200       '00000000000000006848026000320052560210002300651302600034'.03920001
039300               10 FILLER             PIC X(56) VALUE              03930001
039400       '00740601700021004942021000320053110160002100228401200016'.03940001
039500               10 FILLER             PIC X(56) VALUE              03950001
039600       '00680902700039004744019000260000000000000000000000000000'.03960001
039700               10 FILLER             PIC X(56) VALUE              03970001
039800       '00000000000000000000000000000000000000000000000000000000'.03980001
039900               10 FILLER             PIC X(56) VALUE              03990001
040000       '01487701800018049058179001790335051330013302021608600086'.04000001
040100               10 FILLER             PIC X(56) VALUE              04010001
040200       '03441704700047012181034000340016490310003100000000000000'.04020001
040300               10 FILLER             PIC X(56) VALUE              04030001
040400       '00000000000000000000000000000494341040013502587405900075'.04040001
040500               10 FILLER             PIC X(56) VALUE              04050001
040600       '01558603100039036171085001210189050480006501044602300030'.04060001
040700               10 FILLER             PIC X(56) VALUE              04070001
040800       '00000000000000000000000000000000000000000002147906300082'.04080001
040900               10 FILLER             PIC X(56) VALUE              04090001
041000       '01195104000051009230030000370125440380005200795702800036'.04100001
041100               10 FILLER             PIC X(56) VALUE              04110001
041200       '01437203600050016431050000690100240360004600681802600032'.04120001
041300               10 FILLER             PIC X(56) VALUE              04130001
041400       '00000000000000000000000000000000000000000005711213100172'.04140001
041500               10 FILLER             PIC X(56) VALUE              04150001
041600       '02399805300074012253023000310456401220015902305506600087'.04160001
041700               10 FILLER             PIC X(56) VALUE              04170001
041800       '01241802800040048666112001470214590530006901386103100038'.04180001
041900               10 FILLER             PIC X(56) VALUE              04190001
042000       '02709306300094010976024000320000000000000000000000000000'.04200001
042100               10 FILLER             PIC X(56) VALUE              04210001
042200       '00000000000000049277101001620242840570009201138603000045'.04220001
042300               10 FILLER             PIC X(56) VALUE              04230001
042400       '06659917800235031428081001220128230460005702931707800106'.04240001
042500               10 FILLER             PIC X(56) VALUE              04250001
042600       '01637605100068010389032000420183630600008001194004300056'.04260001
042700               10 FILLER             PIC X(56) VALUE              04270001
042800       '00802902900037021961054000800098600280003400807802400030'.04280001
042900               10 FILLER             PIC X(56) VALUE              04290001
043000       '01262704400061000000000000000000000000000000000000000000'.04300001
043100               10 FILLER             PIC X(56) VALUE              04310001
043200       '05523712000156027883082001000137970390005305129611200150'.04320001
043300               10 FILLER             PIC X(56) VALUE              04330001
043400       '02097506200079013050041000510000000000000000000000000000'.04340001
043500               10 FILLER             PIC X(56) VALUE              04350001
043600       '00000000000000019511058000770097900400004900827603000038'.04360001
043700               10 FILLER             PIC X(56) VALUE              04370001
043800       '01565104500065007462028000350247080670009201161404300054'.04380001
043900               10 FILLER             PIC X(56) VALUE              04390001
044000       '00720703000036058305128001510190740540007201154504500054'.04400001
044100               10 FILLER             PIC X(56) VALUE              04410001
044200       '00000000000000000000000000000000000000000002814308100127'.04420001
044300               10 FILLER             PIC X(56) VALUE              04430001
044400       '00000000000000000000000000000000000000000000616102300030'.04440001
044500               10 FILLER             PIC X(56) VALUE              04450001
044600       '00617803100042006276031000430106940490007700930804000053'.04460001
044700               10 FILLER             PIC X(56) VALUE              04470001
044800       '00904105400074007903038000590078880290004100000000000000'.04480001
044900               10 FILLER             PIC X(56) VALUE              04490001
045000       '00000000000000000000000000000000000000000000000000000000'.04500001
045100               10 FILLER             PIC X(56) VALUE              04510001
045200       '00000000000000004074021000300102750850010901456504700065'.04520001
045300               10 FILLER             PIC X(56) VALUE              04530001
045400       '00651303200040000000000000000000000000000000000000000000'.04540001
045500               10 FILLER             PIC X(56) VALUE              04550001
045600       '03904209100140017922054000750106240330004402933507200109'.04560001
045700               10 FILLER             PIC X(56) VALUE              04570001
045800       '01171403400045010356021000310382680780011101925104700063'.04580001
045900               10 FILLER             PIC X(56) VALUE              04590001
046000       '01155402600034000000000000000000000000000000000000000000'.04600001
046100               10 FILLER             PIC X(56) VALUE              04610001
046200       '01344404000056006994026000320142520360005100486701700021'.04620001
046300               10 FILLER             PIC X(56) VALUE              04630001
046400       '01486803700051006269021000270159030440006200978503200043'.04640001
046500               10 FILLER             PIC X(56) VALUE              04650001
046600       '00621602200028013478038000540068080230003200000000000000'.04660001
046700               10 FILLER             PIC X(56) VALUE              04670001
046800       '00000000000000000000000000001266512180028504772410800148'.04680001
046900               10 FILLER             PIC X(56) VALUE              04690001
047000       '02055705200077000000000000000000000000000000000000000000'.04700001
047100               10 FILLER             PIC X(56) VALUE              04710001
047200       '02197902300051013556041000580129190350005200000000000000'.04720001
047300               10 FILLER             PIC X(56) VALUE              04730001
047400       '00000000000000000000000000000287020690010001679703600054'.04740001
047500               10 FILLER             PIC X(56) VALUE              04750001
047600       '01145702000026000000000000000000000000000000000000000000'.04760001
047700               10 FILLER             PIC X(56) VALUE              04770001
047800       '01279508200101011273066000750109520370004900686502700034'.04780001
047900               10 FILLER             PIC X(56) VALUE              04790001
048000       '01000602600044005040022000280065930220004000000000000000'.04800001
048100               10 FILLER             PIC X(56) VALUE              04810001
048200       '00000000000000000000000000000553360890012603370407000085'.04820001
048300               10 FILLER             PIC X(56) VALUE              04830001
048400       '06251910100142037692075000960232080470005900000000000000'.04840001
048500               10 FILLER             PIC X(56) VALUE              04850001
048600       '00000000000000000000000000000281230600008701490104500056'.04860001
048700               10 FILLER             PIC X(56) VALUE              04870001
048800       '00938603100038000000000000000000000000000000000000000000'.04880001
048900               10 FILLER             PIC X(56) VALUE              04890001
049000       '05507312000171026755063000860000000000000000000000000000'.04900001
049100               10 FILLER             PIC X(56) VALUE              04910001
049200       '00000000000000025849068000960136400510006600897503500044'.04920001
049300               10 FILLER             PIC X(56) VALUE              04930001
049400       '01048603700049000000000000000000000000000000000000000000'.04940001
049500               10 FILLER             PIC X(56) VALUE              04950001
049600       '05063411000141029402068000870177670310004303324210500133'.04960001
049700               10 FILLER             PIC X(56) VALUE              04970001
049800       '02150806800090011140027000400344950930012101873905600074'.04980001
049900               10 FILLER             PIC X(56) VALUE              04990001
050000       '01058902500035000000000000000000000000000000000000000000'.05000001
050100               10 FILLER             PIC X(56) VALUE              05010001
050200       '00000000000000000000000000000000000000000000000000000000'.05020001
050300               10 FILLER             PIC X(56) VALUE              05030001
050301       '00000000000000000000000000000000000000000000000000000000'.05030101
050302           05 DRGX-TAB REDEFINES D-TAB.                           05030201
050303               10 DRGX-PERIOD          OCCURS 1                   05030301
050304                                              INDEXED BY DX5.     05030401
050305                   15 DRGX-EFF-DATE    PIC X(08).                 05030501
050306                   15 DRG-DATA         OCCURS 1000                05030601
050307                                              INDEXED BY DX6.     05030701
050308                       20 DRG-WT       PIC 9(02)V9(04).           05030801
050309                       20 DRG-ALOS     PIC 9(02)V9(01).           05030901
050310                       20 DRG-DAYS-TRIM PIC 9(02).                05031001
050320                       20 DRG-ARITH-ALOS PIC 9(02)V9(01).         05032001
