016600 01  DRG-TABLE.                                                   01640000
016700     05  D-TAB.                                                   01650000
016800         10  FILLER                  PIC X(08) VALUE
016900       '20111001'.
017000         10  FILLER                  PIC X(56) VALUE
017100       '24279428600374139700167002131799272910035310925121400260'.
017200         10  FILLER                  PIC X(56) VALUE
017300       '10481415900209051059082000940987101540018905117610100120'.
017400         10  FILLER                  PIC X(56) VALUE
017500       '00000000000000038900085000990499671210015203095708500100'.
017600         10  FILLER                  PIC X(56) VALUE
017700       '01898305600064102792180002480000000000000006312718100198'.
017800         10  FILLER                  PIC X(56) VALUE
017900       '04322411600146000000000000000000000000000008503313400168'.
018000         10  FILLER                  PIC X(56) VALUE
018100       '06436912600143041500056000760536250840011703632705400075'.
018200         10  FILLER                  PIC X(56) VALUE
018300       '04692708500109029770055000700213170290003705647610100130'.
018400         10  FILLER                  PIC X(56) VALUE
018500       '02830804500062016924024000310445290870012501949103500052'.
018600         10  FILLER                  PIC X(56) VALUE
018700       '01408502000026035003045000690214590210003101655001300015'.
018800         10  FILLER                  PIC X(56) VALUE
018900       '03084505600080015804024000350103050140001704033108900120'.
019000         10  FILLER                  PIC X(56) VALUE
019100       '02177505100066017442025000330000000000000000000000000000'.
019200         10  FILLER                  PIC X(56) VALUE
019300       '00000000000000000000000000000000000000000000000000000000'.
019400         10  FILLER                  PIC X(56) VALUE
019500       '00000000000000000000000000000000000000000001539004300057'.
019600         10  FILLER                  PIC X(56) VALUE
019700       '00855402700033014680044000600107600330004501765605500073'.
019800         10  FILLER                  PIC X(56) VALUE
019900       '00965203800049015223053000680101810400004800761803100037'.
020000         10  FILLER                  PIC X(56) VALUE
020100       '02880406200080019506046000540153610330003801855504900068'.
020200         10  FILLER                  PIC X(56) VALUE
020300       '01148503800046008105026000310144750420005400890102600032'.
020400         10  FILLER                  PIC X(56) VALUE
020500       '00734702200027018030053000700105780390004900723702400030'.
020600         10  FILLER                  PIC X(56) VALUE
020700       '01295504100054008644032000400171960540006800875103200038'.
020800         10  FILLER                  PIC X(56) VALUE
020900       '01658704700060010200035000420072180240002901186503600049'.
021000         10  FILLER                  PIC X(56) VALUE
021100       '00737402600033020265035000600135670350004600842202100026'.
021200         10  FILLER                  PIC X(56) VALUE
021300       '02148305200072011759035000440078340230002801617704100054'.
021400         10  FILLER                  PIC X(56) VALUE
021500       '00980902800036007297019000230162380430005900924703200040'.
021600         10  FILLER                  PIC X(56) VALUE
021700       '00675102200028034244087001150237620620007701906904500056'.
021800         10  FILLER                  PIC X(56) VALUE
021900       '03213908700111018279060000760122990400005101525404300058'.
022000         10  FILLER                  PIC X(56) VALUE
022100       '00762002700033010129031000430066770230002900000000000000'.
022200         10  FILLER                  PIC X(56) VALUE
022300       '00000000000000000000000000000000000000000000000000000000'.
022400         10  FILLER                  PIC X(56) VALUE
022500       '00000000000000000000000000000000000000000000000000000000'.
022600         10  FILLER                  PIC X(56) VALUE
022700       '01884104300057009275020000260122460330004401298203000045'.
022800         10  FILLER                  PIC X(56) VALUE
022900       '00765701800024000000000000000000000000000000000000000000'.
023000         10  FILLER                  PIC X(56) VALUE
023100       '01044004100053006304031000370071350210002601170203600051'.
023200         10  FILLER                  PIC X(56) VALUE
023300       '00691802500032000000000000000000000000000000000000000000'.
023400         10  FILLER                  PIC X(56) VALUE
023500       '02214303700054011858023000280225580410005701197402100027'.
023600         10  FILLER                  PIC X(56) VALUE
023700       '01724103700054008722017000210199630430006501011401700023'.
023800         10  FILLER                  PIC X(56) VALUE
023900       '01316003800050007784018000240090090140001700000000000000'.
024000         10  FILLER                  PIC X(56) VALUE
024100       '00000000000000000000000000000000000000000000000000000000'.
024200         10  FILLER                  PIC X(56) VALUE
024300       '00000000000000020669059000840122680410005600752102200032'.
024400         10  FILLER                  PIC X(56) VALUE
024500       '00635002100025013103038000520066010230002800957003200041'.
024600         10  FILLER                  PIC X(56) VALUE
024700       '00629602400030014235042000560089850320004100619202300028'.
024800         10  FILLER                  PIC X(56) VALUE
024900       '01609204900067008971032000420058010210002600000000000000'.
025000         10  FILLER                  PIC X(56) VALUE
025100       '00000000000000000000000000000509101140013902602905900071'.
025200         10  FILLER                  PIC X(56) VALUE
025300       '01785403600043037322092001170205750560007101279103200042'.
025400         10  FILLER                  PIC X(56) VALUE
025500       '00000000000000000000000000000000000000000000000000000000'.
025600         10  FILLER                  PIC X(56) VALUE
025700       '00000000000000000000000000000162120560006701048504000047'.
025800         10  FILLER                  PIC X(56) VALUE
025900       '02065306700083014653054000650100250400004801740305600073'.
026000         10  FILLER                  PIC X(56) VALUE
026100       '01223704000053008446027000360146950510006201008603500043'.
026200         10  FILLER                  PIC X(56) VALUE
026300       '00701302500030015824051000660111230370004800769902700034'.
026400         10  FILLER                  PIC X(56) VALUE
026500       '01269404200053011684044000530096280370004500708103000035'.
026600         10  FILLER                  PIC X(56) VALUE
026700       '01494805200064010026040000480070370300003601657105600070'.
026800         10  FILLER                  PIC X(56) VALUE
026900       '01094304000049007839029000360181450610007800989203500045'.
027000         10  FILLER                  PIC X(56) VALUE
027100       '00712102700035008519033000410061330260003100656402100026'.
027200         10  FILLER                  PIC X(56) VALUE
027300       '01332403900053007565025000320529331260014702270405000070'.
027400         10  FILLER                  PIC X(56) VALUE
027500       '00000000000000000000000000000000000000000000000000000000'.
027600         10  FILLER                  PIC X(56) VALUE
027700       '00000000000000000000000000001376290750013409692214100167'.
027800         10  FILLER                  PIC X(56) VALUE
027900       '06498709400106051734070000780808151040012805260206900076'.
028000         10  FILLER                  PIC X(56) VALUE
028100       '04366305200057086807098001200633090450006207715408000099'.
028200         10  FILLER                  PIC X(56) VALUE
028300       '05951104100051067895060000870515000210003107344511200135'.
028400         10  FILLER                  PIC X(56) VALUE
028500       '04655207200081036603046000540790841080012805669008000088'.
028600         10  FILLER                  PIC X(56) VALUE
028700       '07141811800133048314082000880590630930010803772006000065'.
028800         10  FILLER                  PIC X(56) VALUE
028900       '05122107100102030979028000400474011120014302606307500092'.
029000         10  FILLER                  PIC X(56) VALUE
029100       '01493904800058036835061000780263630380004802053802300028'.
029200         10  FILLER                  PIC X(56) VALUE
029300       '04196702700039031727036000510198280190002402939604500061'.
029400         10  FILLER                  PIC X(56) VALUE
029500       '01813202300029028921050000680184470220002902986505100077'.
029600         10  FILLER                  PIC X(56) VALUE
029700       '02443204400060016521021000270251920670009001603505600069'.
029800         10  FILLER                  PIC X(56) VALUE
029900       '00907103100041029714053000700182170250003303629707600105'.
030000         10  FILLER                  PIC X(56) VALUE
030100       '01675003200043011756021000260162260320004802558005400080'.
030200         10  FILLER                  PIC X(56) VALUE
030300       '02313302400035000000000000000000000000000000000000000000'.
030400         10  FILLER                  PIC X(56) VALUE
030500       '00000000000000000000000000000000000000000000000000000000'.
030600         10  FILLER                  PIC X(56) VALUE
030700       '00000000000000000000000000000000000000000000000000000000'.
030800         10  FILLER                  PIC X(56) VALUE
030900       '00000000000000000000000000000000000000000001790105000063'.
031000         10  FILLER                  PIC X(56) VALUE
031100       '01147803400042007856022000270171180320005000840002000028'.
031200         10  FILLER                  PIC X(56) VALUE
031300       '00540101400017020360049000650107430240003102865408300103'.
031400         10  FILLER                  PIC X(56) VALUE
031500       '01850206100074011141041000500150100470006101021403900047'.
031600         10  FILLER                  PIC X(56) VALUE
031700       '00675602700032009916044000530069920350004101289501900030'.
031800         10  FILLER                  PIC X(56) VALUE
031900       '00657401300016004048011000110137190460005800969703800047'.
032000         10  FILLER                  PIC X(56) VALUE
032100       '00664602800034010029030000400057370190002400979703200042'.
032200         10  FILLER                  PIC X(56) VALUE
032300       '00613002100026013321040000530077320260003201228304000051'.
032400         10  FILLER                  PIC X(56) VALUE
032500       '00815502900036005608020000240050670180002200713902300029'.
032600         10  FILLER                  PIC X(56) VALUE
032700       '00543401700020018386050000680096120320004100606802100025'.
032800         10  FILLER                  PIC X(56) VALUE
032900       '00000000000000000000000000000000000000000000000000000000'.
033000         10  FILLER                  PIC X(56) VALUE
033100       '00000000000000000000000000000000000000000000000000000000'.
033200         10  FILLER                  PIC X(56) VALUE
033300       '00000000000000056803122001550274700670008601384802600035'.
033400         10  FILLER                  PIC X(56) VALUE
033500       '05321512300151025911076000890162540460005104869111200137'.
033600         10  FILLER                  PIC X(56) VALUE
033700       '02475806800079016038041000480428761130013602339207100086'.
033800         10  FILLER                  PIC X(56) VALUE
033900       '01495604000050032639083001010184840540006301230803200037'.
034000         10  FILLER                  PIC X(56) VALUE
034100       '02357005000068013477029000370095870170001903274008800112'.
034200         10  FILLER                  PIC X(56) VALUE
034300       '01698605700067011679040000450253300640008801403104100054'.
034400         10  FILLER                  PIC X(56) VALUE
034500       '00807502200028025207059000790138370350004500862501900023'.
034600         10  FILLER                  PIC X(56) VALUE
034700       '02843306300083015691039000490107430230002803962809000120'.
034800         10  FILLER                  PIC X(56) VALUE
034900       '02183805600072013062030000390000000000000000000000000000'.
035000         10  FILLER                  PIC X(56) VALUE
035100       '00000000000000000000000000000000000000000000000000000000'.
035200         10  FILLER                  PIC X(56) VALUE
035300       '00000000000000000000000000000000000000000001852605100066'.
035400         10  FILLER                  PIC X(56) VALUE
035500       '01088203600044007469025000310203640660008501281105100062'.
035600         10  FILLER                  PIC X(56) VALUE
035700       '00843703700044020951062000840128510430005600871502800036'.
035800         10  FILLER                  PIC X(56) VALUE
035900       '01764004900063010238034000410070670250002901885505500071'.
036000         10  FILLER                  PIC X(56) VALUE
036100       '01131103800046008023027000330125090420005200847403000036'.
036200         10  FILLER                  PIC X(56) VALUE
036300       '01852506100080010598041000520077470320003901660305400071'.
036400         10  FILLER                  PIC X(56) VALUE
036500       '00934503800047006399028000330118440390005100724102700034'.
036600         10  FILLER                  PIC X(56) VALUE
036700       '01675004800067009898036000450066430250003000000000000000'.
036800         10  FILLER                  PIC X(56) VALUE
036900       '00000000000000000000000000000000000000000000000000000000'.
037000         10  FILLER                  PIC X(56) VALUE
037100       '00000000000000000000000000000000000000000000000000000000'.
037200         10  FILLER                  PIC X(56) VALUE
037300       '05716711600155026577062000790185570400005104019710500131'.
037400         10  FILLER                  PIC X(56) VALUE
037500       '02312006800082015243046000550358210970011702398506700078'.
037600         10  FILLER                  PIC X(56) VALUE
037700       '01740904300051036689091001100206370610007001358803700044'.
037800         10  FILLER                  PIC X(56) VALUE
037900       '02531906200078016909043000520118140250003003810808600117'.
038000         10  FILLER                  PIC X(56) VALUE
038100       '01908104900066012324029000370419921030013702441106900089'.
038200         10  FILLER                  PIC X(56) VALUE
038300       '01702403700050000000000000000000000000000000000000000000'.
038400         10  FILLER                  PIC X(56) VALUE
038500       '00000000000000000000000000000000000000000001673704800064'.
038600         10  FILLER                  PIC X(56) VALUE
038700       '00942403500044006084024000290179500550007101196504100052'.
038800         10  FILLER                  PIC X(56) VALUE
038900       '00930902700036017781053000730098640390004800677202800034'.
039000         10  FILLER                  PIC X(56) VALUE
039100       '01887305200071009596036000460065430260003301608304700062'.
039200         10  FILLER                  PIC X(56) VALUE
039300       '01067803500044007222024000290000000000000000000000000000'.
039400         10  FILLER                  PIC X(56) VALUE
039500       '00000000000000000000000000000000000000000000000000000000'.
039600         10  FILLER                  PIC X(56) VALUE
039700       '10919310500132073268053000630564490310003609815210600133'.
039800         10  FILLER                  PIC X(56) VALUE
039900       '06342505800067050565034000390649200720008903858003200038'.
040000         10  FILLER                  PIC X(56) VALUE
040100       '05398506700086033359036000390504381100014702965806700085'.
040200         10  FILLER                  PIC X(56) VALUE
040300       '01740603900048049812072000880324370420004802570003200034'.
040400         10  FILLER                  PIC X(56) VALUE
040500       '03441806500077020866033000360454440640008902790602600038'.
040600         10  FILLER                  PIC X(56) VALUE
040700       '02081201500018036088089001180197280580007401055803200040'.
040800         10  FILLER                  PIC X(56) VALUE
040900       '03459609000112022781054000690168270290003803055707400088'.
041000         10  FILLER                  PIC X(56) VALUE
041100       '01909305000054015498040000440240120290003601993901900021'.
041200         10  FILLER                  PIC X(56) VALUE
041300       '03142508700107020641060000700149250440005001718403700045'.
041400         10  FILLER                  PIC X(56) VALUE
041500       '01228402400028017987030000420100670170002103049806700083'.
041600         10  FILLER                  PIC X(56) VALUE
041700       '01877104000048013518026000310289910750009901640304000052'.
041800         10  FILLER                  PIC X(56) VALUE
041900       '01090801900025020297052000710094120210002703169608000108'.
042000         10  FILLER                  PIC X(56) VALUE
042100       '01570404500058010373023000280230220650008401545705000061'.
042200         10  FILLER                  PIC X(56) VALUE
042300       '01129702500032011621025000350187300390005401207401700021'.
042400         10  FILLER                  PIC X(56) VALUE
042500       '01398602600038022506049000640150090310003801078101800022'.
042600         10  FILLER                  PIC X(56) VALUE
042700       '01327603600048008295021000260323360770009801980104700058'.
042800         10  FILLER                  PIC X(56) VALUE
042900       '01555602700034000000000000000000000000000000000000000000'.
043000         10  FILLER                  PIC X(56) VALUE
043100       '00000000000000000000000000000000000000000000000000000000'.
043200         10  FILLER                  PIC X(56) VALUE
043300       '00000000000000000000000000000000000000000000000000000000'.
043400         10  FILLER                  PIC X(56) VALUE
043500       '00000000000000000000000000000000000000000000000000000000'.
043600         10  FILLER                  PIC X(56) VALUE
043700       '01614804600063007553031000380132670430005500725603100036'.
043800         10  FILLER                  PIC X(56) VALUE
043900       '00842203400040006270026000310199030670008701337305200064'.
044000         10  FILLER                  PIC X(56) VALUE
044100       '00880603700048020419063000820117190440005500766003300039'.
044200         10  FILLER                  PIC X(56) VALUE
044300       '02473706000085011849041000520074350290003501886106500082'.
044400         10  FILLER                  PIC X(56) VALUE
044500       '01240004700059007363033000400167510520006700841003300039'.
044600         10  FILLER                  PIC X(56) VALUE
044700       '01190304400055006994029000360118240360004900668802500031'.
044800         10  FILLER                  PIC X(56) VALUE
044900       '01533905300065008979036000430188390520007001023403500045'.
045000         10  FILLER                  PIC X(56) VALUE
045100       '00610402000025014004045000580073920300003501480304800063'.
045200         10  FILLER                  PIC X(56) VALUE
045300       '00949803800047006371026000320000000000000000000000000000'.
045400         10  FILLER                  PIC X(56) VALUE
045500       '00000000000000025158076001010154270570006900987203900047'.
045600         10  FILLER                  PIC X(56) VALUE
045700       '03424908400125026984077001080122710400005203493607100107'.
045800         10  FILLER                  PIC X(56) VALUE
045900       '01811803900058010684023000310269350730009701480103600051'.
046000         10  FILLER                  PIC X(56) VALUE
046100       '00949701800024011504021000270087620150001701648803700053'.
046200         10  FILLER                  PIC X(56) VALUE
046300       '01100401700022000000000000000000000000000000000000000000'.
046400         10  FILLER                  PIC X(56) VALUE
046500       '00000000000000000000000000000000000000000001475305400070'.
046600         10  FILLER                  PIC X(56) VALUE
046700       '01027904400054006981033000410196360570007900892403600046'.
046800         10  FILLER                  PIC X(56) VALUE
046900       '01659005500075011630039000540067980240003400978803900049'.
047000         10  FILLER                  PIC X(56) VALUE
047100       '00608602800034014597052000650084440370004401302504000054'.
047200         10  FILLER                  PIC X(56) VALUE
047300       '00738802600032013600043000590069520280003600000000000000'.
047400         10  FILLER                  PIC X(56) VALUE
047500       '00000000000000000000000000000000000000000000000000000000'.
047600         10  FILLER                  PIC X(56) VALUE
047700       '00000000000000024580045000610143190240002804393311700145'.
047800         10  FILLER                  PIC X(56) VALUE
047900       '02018806300077011616036000490349530450007601838402500031'.
048000         10  FILLER                  PIC X(56) VALUE
048100       '01483501600019038339100001390185420600007600996503500043'.
048200         10  FILLER                  PIC X(56) VALUE
048300       '02258704400065011682020000290080080120001403252606800098'.
048400         10  FILLER                  PIC X(56) VALUE
048500       '02207706300078013128032000430000000000000000000000000000'.
048600         10  FILLER                  PIC X(56) VALUE
048700       '00000000000000000000000000000000000000000000000000000000'.
048800         10  FILLER                  PIC X(56) VALUE
048900       '01439804400058008167031000390055030220002701112503400048'.
049000         10  FILLER                  PIC X(56) VALUE
049100       '00698802800035011212035000480170570560007101058304000050'.
049200         10  FILLER                  PIC X(56) VALUE
049300       '00725202800035000000000000000000000000000000000000000000'.
049400         10  FILLER                  PIC X(56) VALUE
049500       '00000000000000000000000000000000000000000003050706000071'.
049600         10  FILLER                  PIC X(56) VALUE
049700       '05924913300161030568080000920199340460005503635907500099'.
049800         10  FILLER                  PIC X(56) VALUE
049900       '02012704700056014698029000330346340790010801885104400059'.
050000         10  FILLER                  PIC X(56) VALUE
050100       '01302002300028029733076001020147910360005101126901500019'.
050200         10  FILLER                  PIC X(56) VALUE
050300       '03377509500122015904044000630081280180002302551206600089'.
050400         10  FILLER                  PIC X(56) VALUE
050500       '01270203100042007806018000220148000380005400844301800023'.
050600         10  FILLER                  PIC X(56) VALUE
050700       '02987506200095021338048000670134250170002400000000000000'.
050800         10  FILLER                  PIC X(56) VALUE
050900       '00000000000000000000000000000000000000000000000000000000'.
051000         10  FILLER                  PIC X(56) VALUE
051100       '00000000000000016410050000670101830390004800640902700032'.
051200         10  FILLER                  PIC X(56) VALUE
051300       '00890502500034017795056000780104580370004800648202100027'.
051400         10  FILLER                  PIC X(56) VALUE
051500       '01199704500056007870033000400152890300004001090301700020'.
051600         10  FILLER                  PIC X(56) VALUE
051700       '01350503900051007090020000250126080420005600644902500031'.
051800         10  FILLER                  PIC X(56) VALUE
051900       '00809902400032016066052000660099980360004500678302600032'.
052000         10  FILLER                  PIC X(56) VALUE
052100       '00000000000000000000000000000000000000000000000000000000'.
052200         10  FILLER                  PIC X(56) VALUE
052300       '00000000000000000000000000000182490320004301275701600018'.
052400         10  FILLER                  PIC X(56) VALUE
052500       '01929903600059012640014000170189780500007300790102000027'.
052600         10  FILLER                  PIC X(56) VALUE
052700       '01205602900041006710016000180175560400005900870401200014'.
052800         10  FILLER                  PIC X(56) VALUE
052900       '01634804400061008146020000250000000000000000000000000000'.
053000         10  FILLER                  PIC X(56) VALUE
053100       '00000000000000015734052000710101780390005000672402100028'.
053200         10  FILLER                  PIC X(56) VALUE
053300       '01245704600060007279028000350142440510006500784803300041'.
053400         10  FILLER                  PIC X(56) VALUE
053500       '01090303600050006256022000280000000000000000000000000000'.
053600         10  FILLER                  PIC X(56) VALUE
053700       '00000000000000024618050000690122080210002504527610600131'.
053800         10  FILLER                  PIC X(56) VALUE
053900       '02022105600065012170031000350336720730009901543103500043'.
054000         10  FILLER                  PIC X(56) VALUE
054100       '01120102000023014262030000400093060180002001478503900055'.
054200         10  FILLER                  PIC X(56) VALUE
054300       '00795601900023012993028000400090380150001700944701400017'.
054400         10  FILLER                  PIC X(56) VALUE
054500       '02528306200085010799022000290000000000000000000000000000'.
054600         10  FILLER                  PIC X(56) VALUE
054700       '00000000000000020512064000880115600390005200620202200030'.
054800         10  FILLER                  PIC X(56) VALUE
054900       '01558505900074010657046000550073240320004000789202800036'.
055000         10  FILLER                  PIC X(56) VALUE
055100       '00515001800023000000000000000000000000000000000000000000'.
055200         10  FILLER                  PIC X(56) VALUE
055300       '01225504000052008497029000300085470230002601818004700058'.
055400         10  FILLER                  PIC X(56) VALUE
055500       '01525903400049006353015000190000000000000000000000000000'.
055600         10  FILLER                  PIC X(56) VALUE
055700       '00000000000000007406027000340052830210002300643602500033'.
055800         10  FILLER                  PIC X(56) VALUE
055900       '00813301700020004646019000270051340170002200194701200013'.
056000         10  FILLER                  PIC X(56) VALUE
056100       '00667402600038003175015000180000000000000000000000000000'.
056200         10  FILLER                  PIC X(56) VALUE
056300       '00000000000000000000000000000000000000000000000000000000'.
056400         10  FILLER                  PIC X(56) VALUE
056500       '01493301800018049243179001790336311330013302029308600086'.
056600         10  FILLER                  PIC X(56) VALUE
056700       '03454704700047012227034000340016560310003100000000000000'.
056800         10  FILLER                  PIC X(56) VALUE
056900       '00000000000000000000000000000502010980013002537505700072'.
057000         10  FILLER                  PIC X(56) VALUE
057100       '01513803100039034676084001150172770450005901029302200029'.
057200         10  FILLER                  PIC X(56) VALUE
057300       '00000000000000000000000000000000000000000002090706000079'.
057400         10  FILLER                  PIC X(56) VALUE
057500       '01211403900050008718028000350121820370005000792002700035'.
057600         10  FILLER                  PIC X(56) VALUE
057700       '01509803600050016769050000670098110350004500718702600032'.
057800         10  FILLER                  PIC X(56) VALUE
057900       '00000000000000000000000000000000000000000006071713100172'.
058000         10  FILLER                  PIC X(56) VALUE
058100       '02366605000071012183023000300445981190015502319306400084'.
058200         10  FILLER                  PIC X(56) VALUE
058300       '01276202900041050537111001420226580550007201308202700034'.
058400         10  FILLER                  PIC X(56) VALUE
058500       '02856006600098011616023000310000000000000000000000000000'.
058600         10  FILLER                  PIC X(56) VALUE
058700       '00000000000000053606105001700236400530008901096702900043'.
058800         10  FILLER                  PIC X(56) VALUE
058900       '06505517500229032689081001210126230470005603035007800108'.
059000         10  FILLER                  PIC X(56) VALUE
059100       '01634205000066010133031000410188990580007801175004200054'.
059200         10  FILLER                  PIC X(56) VALUE
059300       '00796602800036022853056000800101460280003400764302300029'.
059400         10  FILLER                  PIC X(56) VALUE
059500       '01312704300058000000000000000000000000000000000000000000'.
059600         10  FILLER                  PIC X(56) VALUE
059700       '05466811600150026551078000940160080380005504958810900145'.
059800         10  FILLER                  PIC X(56) VALUE
059900       '02072606000076013212041000500000000000000000000000000000'.
060000         10  FILLER                  PIC X(56) VALUE
060100       '00000000000000019223057000750099430390004800833703000037'.
060200         10  FILLER                  PIC X(56) VALUE
060300       '01580904400062007446028000350255230690009301081604000050'.
060400         10  FILLER                  PIC X(56) VALUE
060500       '00672402800034058339127001490190900530007001133904300052'.
060600         10  FILLER                  PIC X(56) VALUE
060700       '00000000000000000000000000000000000000000002831907600123'.
060800         10  FILLER                  PIC X(56) VALUE
060900       '00000000000000000000000000000000000000000000633702300030'.
061000         10  FILLER                  PIC X(56) VALUE
061100       '00615603200042006566033000460118640480007900952904000053'.
061200         10  FILLER                  PIC X(56) VALUE
061300       '00920905400073007466039000570081890290004500000000000000'.
061400         10  FILLER                  PIC X(56) VALUE
061500       '00000000000000000000000000000000000000000000000000000000'.
061600         10  FILLER                  PIC X(56) VALUE
061700       '00000000000000004304021000300109520920011901455504700064'.
061800         10  FILLER                  PIC X(56) VALUE
061900       '00668703200040000000000000000000000000000000000000000000'.
062000         10  FILLER                  PIC X(56) VALUE
062100       '04103009200144017938054000750105620310004103105707000107'.
062200         10  FILLER                  PIC X(56) VALUE
062300       '01170203400045010566023000330396610780011301929804600060'.
062400         10  FILLER                  PIC X(56) VALUE
062500       '01161202500033000000000000000000000000000000000000000000'.
062600         10  FILLER                  PIC X(56) VALUE
062700       '01245803900052007097025000320146000350005000483601700021'.
062800         10  FILLER                  PIC X(56) VALUE
062900       '01497703600051006228021000270162820440006100962903100041'.
063000         10  FILLER                  PIC X(56) VALUE
063100       '00633202200028014748039000570067410230003000000000000000'.
063200         10  FILLER                  PIC X(56) VALUE
063300       '00000000000000000000000000001210332000027304890910900153'.
063400         10  FILLER                  PIC X(56) VALUE
063500       '02177904900072000000000000000000000000000000000000000000'.
063600         10  FILLER                  PIC X(56) VALUE
063700       '02285002600054013998040000570125720320004800000000000000'.
063800         10  FILLER                  PIC X(56) VALUE
063900       '00000000000000000000000000000306560690010301767803500052'.
064000         10  FILLER                  PIC X(56) VALUE
064100       '01149202000026000000000000000000000000000000000000000000'.
064200         10  FILLER                  PIC X(56) VALUE
064300       '01331208300100012889068000760113090370004900692302700034'.
064400         10  FILLER                  PIC X(56) VALUE
064500       '00950502800045005175023000330072450210004700000000000000'.
064600         10  FILLER                  PIC X(56) VALUE
064700       '00000000000000000000000000000545290820011703632206900085'.
064800         10  FILLER                  PIC X(56) VALUE
064900       '06601710000145037491075000920247110450005700000000000000'.
065000         10  FILLER                  PIC X(56) VALUE
065100       '00000000000000000000000000000282940590008501516504400055'.
065200         10  FILLER                  PIC X(56) VALUE
065300       '01011403000037000000000000000000000000000000000000000000'.
065400         10  FILLER                  PIC X(56) VALUE
065500       '05615812800172023655058000830000000000000000000000000000'.
065600         10  FILLER                  PIC X(56) VALUE
065700       '00000000000000027063069000980134550490006400864903400043'.
065800         10  FILLER                  PIC X(56) VALUE
065900       '01078303600049000000000000000000000000000000000000000000'.
066000         10  FILLER                  PIC X(56) VALUE
066100       '05067310800139029352063000810174040300004103529410800139'.
066200         10  FILLER                  PIC X(56) VALUE
066300       '02124006400087010980026000380340390890011701856705300070'.
066400         10  FILLER                  PIC X(56) VALUE
066500       '01058302400033000000000000000000000000000000000000000000'.
066600         10  FILLER                  PIC X(56) VALUE
066700       '00000000000000000000000000000000000000000000000000000000'.
066800         10  FILLER                  PIC X(56) VALUE
066900       '00000000000000000000000000000000000000000000000000000000'.
067000     05  DRGX-TAB REDEFINES D-TAB.                                04619000
067100         10  DRGX-PERIOD               OCCURS 1                   04619100
067200                                        INDEXED BY DX5.           04619200
067300             15  DRGX-EFF-DATE         PIC X(08).                 04619300
067400             15  DRG-DATA              OCCURS 1000                04619400
067500                                        INDEXED BY DX6.           04619500
067600                 20  DRG-WT            PIC 9(02)V9(04).           04619600
067700                 20  DRG-ALOS          PIC 9(02)V9(01).           04619700
067800                 20  DRG-DAYS-TRIM     PIC 9(02).                 04619800
067900                 20  DRG-ARITH-ALOS    PIC 9(02)V9(01).           04619900
068000
