000100***************************************************************
000200**********YEARCHANGE 2015.2 ***********************************
000300***************************************************************
000400****  TABLE 5 FROM ANNUAL IPPS FINAL RULE                  ****
000500****  COPIED FROM D29L.@BFN2699.INPATCOB.COBR150(PPCAL150) ****
000600***************************************************************
000700 01  WK-DRGX-EFF-DATE      PIC X(08) VALUE '20141001'.
000800 01  PPS-DRG-TABLE.
000900     02  WK-DRG-DATA.
001000****** 08/01/2014 **********
001100         05  FILLER   PIC X(57)  VALUE
001200     '001 253920 286       368       HEART TRANSPLANT OR IMPLAN'.
001300         05  FILLER   PIC X(57)  VALUE
001400     '002 156820 157       187       HEART TRANSPLANT OR IMPLAN'.
001500         05  FILLER   PIC X(57)  VALUE
001600     '003 176399 263       322  Y    ECMO OR TRACH W MV 96+ HRS'.
001700         05  FILLER   PIC X(57)  VALUE
001800     '004 108533 202       244  Y    TRACH W MV 96+ HRS OR PDX '.
001900         05  FILLER   PIC X(57)  VALUE
002000     '005 104973 152       207       LIVER TRANSPLANT W MCC OR '.
002100         05  FILLER   PIC X(57)  VALUE
002200     '006 047461 079       088       LIVER TRANSPLANT W/O MCC  '.
002300         05  FILLER   PIC X(57)  VALUE
002400     '007 092986 159       186       LUNG TRANSPLANT           '.
002500         05  FILLER   PIC X(57)  VALUE
002600     '008 053302 098       113       SIMULTANEOUS PANCREAS/KIDN'.
002700         05  FILLER   PIC X(57)  VALUE
002800     '010 040849 078       096       PANCREAS TRANSPLANT       '.
002900         05  FILLER   PIC X(57)  VALUE
003000     '011 047380 113       141       TRACHEOSTOMY FOR FACE,MOUT'.
003100         05  FILLER   PIC X(57)  VALUE
003200     '012 033293 084       100       TRACHEOSTOMY FOR FACE,MOUT'.
003300         05  FILLER   PIC X(57)  VALUE
003400     '013 021357 058       066       TRACHEOSTOMY FOR FACE,MOUT'.
003500         05  FILLER   PIC X(57)  VALUE
003600     '014 109883 200       251       ALLOGENEIC BONE MARROW TRA'.
003700         05  FILLER   PIC X(57)  VALUE
003800     '016 058780 175       191       AUTOLOGOUS BONE MARROW TRA'.
003900         05  FILLER   PIC X(57)  VALUE
004000     '017 041603 089       124       AUTOLOGOUS BONE MARROW TRA'.
004100         05  FILLER   PIC X(57)  VALUE
004200     '020 094423 139       168       INTRACRANIAL VASCULAR PROC'.
004300         05  FILLER   PIC X(57)  VALUE
004400     '021 071555 119       134       INTRACRANIAL VASCULAR PROC'.
004500         05  FILLER   PIC X(57)  VALUE
004600     '022 044934 063       078       INTRACRANIAL VASCULAR PROC'.
004700         05  FILLER   PIC X(57)  VALUE
004800     '023 052939 079       110  Y    CRANIO W MAJOR DEV IMPL/AC'.
004900         05  FILLER   PIC X(57)  VALUE
005000     '024 037461 044       063  Y    CRANIO W MAJOR DEV IMPL/AC'.
005100         05  FILLER   PIC X(57)  VALUE
005200     '025 043374 074       097  Y    CRANIOTOMY & ENDOVASCULAR '.
005300         05  FILLER   PIC X(57)  VALUE
005400     '026 030011 047       061  Y    CRANIOTOMY & ENDOVASCULAR '.
005500         05  FILLER   PIC X(57)  VALUE
005600     '027 022824 025       033  Y    CRANIOTOMY & ENDOVASCULAR '.
005700         05  FILLER   PIC X(57)  VALUE
005800     '028 053968 096       123  Y Y  SPINAL PROCEDURES W MCC   '.
005900         05  FILLER   PIC X(57)  VALUE
006000     '029 031573 048       064  Y Y  SPINAL PROCEDURES W CC OR '.
006100         05  FILLER   PIC X(57)  VALUE
006200     '030 017835 026       034  Y Y  SPINAL PROCEDURES W/O CC/M'.
006300         05  FILLER   PIC X(57)  VALUE
006400     '031 041493 077       110  Y    VENTRICULAR SHUNT PROCEDUR'.
006500         05  FILLER   PIC X(57)  VALUE
006600     '032 020325 033       047  Y    VENTRICULAR SHUNT PROCEDUR'.
006700         05  FILLER   PIC X(57)  VALUE
006800     '033 015602 020       025  Y    VENTRICULAR SHUNT PROCEDUR'.
006900         05  FILLER   PIC X(57)  VALUE
007000     '034 037008 045       066       CAROTID ARTERY STENT PROCE'.
007100         05  FILLER   PIC X(57)  VALUE
007200     '035 022109 020       029       CAROTID ARTERY STENT PROCE'.
007300         05  FILLER   PIC X(57)  VALUE
007400     '036 017313 013       015       CAROTID ARTERY STENT PROCE'.
007500         05  FILLER   PIC X(57)  VALUE
007600     '037 031459 056       080       EXTRACRANIAL PROCEDURES W '.
007700         05  FILLER   PIC X(57)  VALUE
007800     '038 015870 023       034       EXTRACRANIAL PROCEDURES W '.
007900         05  FILLER   PIC X(57)  VALUE
008000     '039 010582 013       016       EXTRACRANIAL PROCEDURES W/'.
008100         05  FILLER   PIC X(57)  VALUE
008200     '040 037960 083       112  Y Y  PERIPH/CRANIAL NERVE & OTH'.
008300         05  FILLER   PIC X(57)  VALUE
008400     '041 021267 049       062  Y Y  PERIPH/CRANIAL NERVE & OTH'.
008500         05  FILLER   PIC X(57)  VALUE
008600     '042 018586 027       035  Y Y  PERIPH/CRANIAL NERVE & OTH'.
008700         05  FILLER   PIC X(57)  VALUE
008800     '052 015813 042       057       SPINAL DISORDERS & INJURIE'.
008900         05  FILLER   PIC X(57)  VALUE
009000     '053 009294 027       035       SPINAL DISORDERS & INJURIE'.
009100         05  FILLER   PIC X(57)  VALUE
009200     '054 013048 039       053  Y    NERVOUS SYSTEM NEOPLASMS W'.
009300         05  FILLER   PIC X(57)  VALUE
009400     '055 010191 030       041  Y    NERVOUS SYSTEM NEOPLASMS W'.
009500         05  FILLER   PIC X(57)  VALUE
009600     '056 017615 052       071  Y    DEGENERATIVE NERVOUS SYSTE'.
009700         05  FILLER   PIC X(57)  VALUE
009800     '057 010099 036       048  Y    DEGENERATIVE NERVOUS SYSTE'.
009900         05  FILLER   PIC X(57)  VALUE
010000     '058 016336 052       071       MULTIPLE SCLEROSIS & CEREB'.
010100         05  FILLER   PIC X(57)  VALUE
010200     '059 010290 039       047       MULTIPLE SCLEROSIS & CEREB'.
010300         05  FILLER   PIC X(57)  VALUE
010400     '060 007867 030       036       MULTIPLE SCLEROSIS & CEREB'.
010500         05  FILLER   PIC X(57)  VALUE
010600     '061 027571 057       074       ACUTE ISCHEMIC STROKE W US'.
010700         05  FILLER   PIC X(57)  VALUE
010800     '062 018555 041       048       ACUTE ISCHEMIC STROKE W US'.
010900         05  FILLER   PIC X(57)  VALUE
011000     '063 015098 030       034       ACUTE ISCHEMIC STROKE W US'.
011100         05  FILLER   PIC X(57)  VALUE
011200     '064 017381 046       063  Y    INTRACRANIAL HEMORRHAGE OR'.
011300         05  FILLER   PIC X(57)  VALUE
011400     '065 010643 034       042  Y    INTRACRANIAL HEMORRHAGE OR'.
011500         05  FILLER   PIC X(57)  VALUE
011600     '066 007530 024       028  Y    INTRACRANIAL HEMORRHAGE OR'.
011700         05  FILLER   PIC X(57)  VALUE
011800     '067 014527 041       054       NONSPECIFIC CVA & PRECEREB'.
011900         05  FILLER   PIC X(57)  VALUE
012000     '068 008395 024       030       NONSPECIFIC CVA & PRECEREB'.
012100         05  FILLER   PIC X(57)  VALUE
012200     '069 006985 021       026       TRANSIENT ISCHEMIA        '.
012300         05  FILLER   PIC X(57)  VALUE
012400     '070 016438 048       065  Y    NONSPECIFIC CEREBROVASCULA'.
012500         05  FILLER   PIC X(57)  VALUE
012600     '071 009748 035       045  Y    NONSPECIFIC CEREBROVASCULA'.
012700         05  FILLER   PIC X(57)  VALUE
012800     '072 006947 023       029  Y    NONSPECIFIC CEREBROVASCULA'.
012900         05  FILLER   PIC X(57)  VALUE
013000     '073 013290 040       053       CRANIAL & PERIPHERAL NERVE'.
013100         05  FILLER   PIC X(57)  VALUE
013200     '074 008847 030       038       CRANIAL & PERIPHERAL NERVE'.
013300         05  FILLER   PIC X(57)  VALUE
013400     '075 016595 052       066       VIRAL MENINGITIS W CC/MCC '.
013500         05  FILLER   PIC X(57)  VALUE
013600     '076 008629 032       038       VIRAL MENINGITIS W/O CC/MC'.
013700         05  FILLER   PIC X(57)  VALUE
013800     '077 016245 046       060       HYPERTENSIVE ENCEPHALOPATH'.
013900         05  FILLER   PIC X(57)  VALUE
014000     '078 009361 032       040       HYPERTENSIVE ENCEPHALOPATH'.
014100         05  FILLER   PIC X(57)  VALUE
014200     '079 006677 023       027       HYPERTENSIVE ENCEPHALOPATH'.
014300         05  FILLER   PIC X(57)  VALUE
014400     '080 012790 037       052       NONTRAUMATIC STUPOR & COMA'.
014500         05  FILLER   PIC X(57)  VALUE
014600     '081 007850 027       036       NONTRAUMATIC STUPOR & COMA'.
014700         05  FILLER   PIC X(57)  VALUE
014800     '082 019142 032       054       TRAUMATIC STUPOR & COMA, C'.
014900         05  FILLER   PIC X(57)  VALUE
015000     '083 012401 033       042       TRAUMATIC STUPOR & COMA, C'.
015100         05  FILLER   PIC X(57)  VALUE
015200     '084 008592 021       026       TRAUMATIC STUPOR & COMA, C'.
015300         05  FILLER   PIC X(57)  VALUE
015400     '085 019770 047       065  Y    TRAUMATIC STUPOR & COMA, C'.
015500         05  FILLER   PIC X(57)  VALUE
015600     '086 011181 032       041  Y    TRAUMATIC STUPOR & COMA, C'.
015700         05  FILLER   PIC X(57)  VALUE
015800     '087 007460 021       026  Y    TRAUMATIC STUPOR & COMA, C'.
015900         05  FILLER   PIC X(57)  VALUE
016000     '088 015708 038       054       CONCUSSION W MCC          '.
016100         05  FILLER   PIC X(57)  VALUE
016200     '089 009588 027       033       CONCUSSION W CC           '.
016300         05  FILLER   PIC X(57)  VALUE
016400     '090 007353 018       022       CONCUSSION W/O CC/MCC     '.
016500         05  FILLER   PIC X(57)  VALUE
016600     '091 015978 042       059  Y    OTHER DISORDERS OF NERVOUS'.
016700         05  FILLER   PIC X(57)  VALUE
016800     '092 008989 031       039  Y    OTHER DISORDERS OF NERVOUS'.
016900         05  FILLER   PIC X(57)  VALUE
017000     '093 006783 022       027  Y    OTHER DISORDERS OF NERVOUS'.
017100         05  FILLER   PIC X(57)  VALUE
017200     '094 033357 082       107       BACTERIAL & TUBERCULOUS IN'.
017300         05  FILLER   PIC X(57)  VALUE
017400     '095 023844 060       076       BACTERIAL & TUBERCULOUS IN'.
017500         05  FILLER   PIC X(57)  VALUE
017600     '096 020726 045       053       BACTERIAL & TUBERCULOUS IN'.
017700         05  FILLER   PIC X(57)  VALUE
017800     '097 031625 085       109       NON-BACTERIAL INFECT OF NE'.
017900         05  FILLER   PIC X(57)  VALUE
018000     '098 017189 055       069       NON-BACTERIAL INFECT OF NE'.
018100         05  FILLER   PIC X(57)  VALUE
018200     '099 011609 038       047       NON-BACTERIAL INFECT OF NE'.
018300         05  FILLER   PIC X(57)  VALUE
018400     '100 015304 042       056  Y    SEIZURES W MCC            '.
018500         05  FILLER   PIC X(57)  VALUE
018600     '101 007567 026       032  Y    SEIZURES W/O MCC          '.
018700         05  FILLER   PIC X(57)  VALUE
018800     '102 010073 030       040       HEADACHES W MCC           '.
018900         05  FILLER   PIC X(57)  VALUE
019000     '103 006915 023       029       HEADACHES W/O MCC         '.
019100         05  FILLER   PIC X(57)  VALUE
019200     '113 018611 038       052       ORBITAL PROCEDURES W CC/MC'.
019300         05  FILLER   PIC X(57)  VALUE
019400     '114 011568 024       031       ORBITAL PROCEDURES W/O CC/'.
019500         05  FILLER   PIC X(57)  VALUE
019600     '115 012780 035       046       EXTRAOCULAR PROCEDURES EXC'.
019700         05  FILLER   PIC X(57)  VALUE
019800     '116 014005 033       046       INTRAOCULAR PROCEDURES W C'.
019900         05  FILLER   PIC X(57)  VALUE
020000     '117 008239 018       022       INTRAOCULAR PROCEDURES W/O'.
020100         05  FILLER   PIC X(57)  VALUE
020200     '121 010635 040       050       ACUTE MAJOR EYE INFECTIONS'.
020300         05  FILLER   PIC X(57)  VALUE
020400     '122 006352 031       038       ACUTE MAJOR EYE INFECTIONS'.
020500         05  FILLER   PIC X(57)  VALUE
020600     '123 006732 020       025       NEUROLOGICAL EYE DISORDERS'.
020700         05  FILLER   PIC X(57)  VALUE
020800     '124 011432 034       046       OTHER DISORDERS OF THE EYE'.
020900         05  FILLER   PIC X(57)  VALUE
021000     '125 006852 024       031       OTHER DISORDERS OF THE EYE'.
021100         05  FILLER   PIC X(57)  VALUE
021200     '129 023284 038       054       MAJOR HEAD & NECK PROCEDUR'.
021300         05  FILLER   PIC X(57)  VALUE
021400     '130 012599 023       028       MAJOR HEAD & NECK PROCEDUR'.
021500         05  FILLER   PIC X(57)  VALUE
021600     '131 023703 041       057       CRANIAL/FACIAL PROCEDURES '.
021700         05  FILLER   PIC X(57)  VALUE
021800     '132 014248 022       027       CRANIAL/FACIAL PROCEDURES '.
021900         05  FILLER   PIC X(57)  VALUE
022000     '133 018644 037       054       OTHER EAR, NOSE, MOUTH & T'.
022100         05  FILLER   PIC X(57)  VALUE
022200     '134 010083 019       024       OTHER EAR, NOSE, MOUTH & T'.
022300         05  FILLER   PIC X(57)  VALUE
022400     '135 019150 042       057       SINUS & MASTOID PROCEDURES'.
022500         05  FILLER   PIC X(57)  VALUE
022600     '136 010509 018       024       SINUS & MASTOID PROCEDURES'.
022700         05  FILLER   PIC X(57)  VALUE
022800     '137 013735 037       049       MOUTH PROCEDURES W CC/MCC '.
022900         05  FILLER   PIC X(57)  VALUE
023000     '138 007888 019       024       MOUTH PROCEDURES W/O CC/MC'.
023100         05  FILLER   PIC X(57)  VALUE
023200     '139 009856 016       021       SALIVARY GLAND PROCEDURES '.
023300         05  FILLER   PIC X(57)  VALUE
023400     '146 019749 058       082       EAR, NOSE, MOUTH & THROAT '.
023500         05  FILLER   PIC X(57)  VALUE
023600     '147 012869 039       054       EAR, NOSE, MOUTH & THROAT '.
023700         05  FILLER   PIC X(57)  VALUE
023800     '148 008205 023       031       EAR, NOSE, MOUTH & THROAT '.
023900         05  FILLER   PIC X(57)  VALUE
024000     '149 006342 020       025       DYSEQUILIBRIUM            '.
024100         05  FILLER   PIC X(57)  VALUE
024200     '150 012943 037       049       EPISTAXIS W MCC           '.
024300         05  FILLER   PIC X(57)  VALUE
024400     '151 006690 022       027       EPISTAXIS W/O MCC         '.
024500         05  FILLER   PIC X(57)  VALUE
024600     '152 010162 036       045       OTITIS MEDIA & URI W MCC  '.
024700         05  FILLER   PIC X(57)  VALUE
024800     '153 006884 027       032       OTITIS MEDIA & URI W/O MCC'.
024900         05  FILLER   PIC X(57)  VALUE
025000     '154 013703 041       054       OTHER EAR, NOSE, MOUTH & T'.
025100         05  FILLER   PIC X(57)  VALUE
025200     '155 008848 031       039       OTHER EAR, NOSE, MOUTH & T'.
025300         05  FILLER   PIC X(57)  VALUE
025400     '156 006516 023       028       OTHER EAR, NOSE, MOUTH & T'.
025500         05  FILLER   PIC X(57)  VALUE
025600     '157 015814 047       063       DENTAL & ORAL DISEASES W M'.
025700         05  FILLER   PIC X(57)  VALUE
025800     '158 008519 030       039       DENTAL & ORAL DISEASES W C'.
025900         05  FILLER   PIC X(57)  VALUE
026000     '159 005935 020       025       DENTAL & ORAL DISEASES W/O'.
026100         05  FILLER   PIC X(57)  VALUE
026200     '163 050332 108       132  Y    MAJOR CHEST PROCEDURES W M'.
026300         05  FILLER   PIC X(57)  VALUE
026400     '164 026010 054       066  Y    MAJOR CHEST PROCEDURES W C'.
026500         05  FILLER   PIC X(57)  VALUE
026600     '165 018220 033       039  Y    MAJOR CHEST PROCEDURES W/O'.
026700         05  FILLER   PIC X(57)  VALUE
026800     '166 036610 087       111  Y    OTHER RESP SYSTEM O.R. PRO'.
026900         05  FILLER   PIC X(57)  VALUE
027000     '167 019818 052       066  Y    OTHER RESP SYSTEM O.R. PRO'.
027100         05  FILLER   PIC X(57)  VALUE
027200     '168 013291 031       039  Y    OTHER RESP SYSTEM O.R. PRO'.
027300         05  FILLER   PIC X(57)  VALUE
027400     '175 015271 052       063  Y    PULMONARY EMBOLISM W MCC  '.
027500         05  FILLER   PIC X(57)  VALUE
027600     '176 009670 035       042  Y    PULMONARY EMBOLISM W/O MCC'.
027700         05  FILLER   PIC X(57)  VALUE
027800     '177 019492 062       077  Y    RESPIRATORY INFECTIONS & I'.
027900         05  FILLER   PIC X(57)  VALUE
028000     '178 013909 050       061  Y    RESPIRATORY INFECTIONS & I'.
028100         05  FILLER   PIC X(57)  VALUE
028200     '179 009693 037       045  Y    RESPIRATORY INFECTIONS & I'.
028300         05  FILLER   PIC X(57)  VALUE
028400     '180 016869 053       069       RESPIRATORY NEOPLASMS W MC'.
028500         05  FILLER   PIC X(57)  VALUE
028600     '181 011582 037       049       RESPIRATORY NEOPLASMS W CC'.
028700         05  FILLER   PIC X(57)  VALUE
028800     '182 008088 026       033       RESPIRATORY NEOPLASMS W/O '.
028900         05  FILLER   PIC X(57)  VALUE
029000     '183 015101 048       060       MAJOR CHEST TRAUMA W MCC  '.
029100         05  FILLER   PIC X(57)  VALUE
029200     '184 009889 034       040       MAJOR CHEST TRAUMA W CC   '.
029300         05  FILLER   PIC X(57)  VALUE
029400     '185 006628 024       028       MAJOR CHEST TRAUMA W/O CC/'.
029500         05  FILLER   PIC X(57)  VALUE
029600     '186 015452 048       062  Y    PLEURAL EFFUSION W MCC    '.
029700         05  FILLER   PIC X(57)  VALUE
029800     '187 010691 035       045  Y    PLEURAL EFFUSION W CC     '.
029900         05  FILLER   PIC X(57)  VALUE
030000     '188 007609 026       032  Y    PLEURAL EFFUSION W/O CC/MC'.
030100         05  FILLER   PIC X(57)  VALUE
030200     '189 012136 039       050       PULMONARY EDEMA & RESPIRAT'.
030300         05  FILLER   PIC X(57)  VALUE
030400     '190 011743 042       051  Y    CHRONIC OBSTRUCTIVE PULMON'.
030500         05  FILLER   PIC X(57)  VALUE
030600     '191 009370 034       042  Y    CHRONIC OBSTRUCTIVE PULMON'.
030700         05  FILLER   PIC X(57)  VALUE
030800     '192 007190 028       033  Y    CHRONIC OBSTRUCTIVE PULMON'.
030900         05  FILLER   PIC X(57)  VALUE
031000     '193 014491 049       060  Y    SIMPLE PNEUMONIA & PLEURIS'.
031100         05  FILLER   PIC X(57)  VALUE
031200     '194 009688 038       045  Y    SIMPLE PNEUMONIA & PLEURIS'.
031300         05  FILLER   PIC X(57)  VALUE
031400     '195 007044 029       034  Y    SIMPLE PNEUMONIA & PLEURIS'.
031500         05  FILLER   PIC X(57)  VALUE
031600     '196 016635 054       069  Y    INTERSTITIAL LUNG DISEASE '.
031700         05  FILLER   PIC X(57)  VALUE
031800     '197 010615 037       046  Y    INTERSTITIAL LUNG DISEASE '.
031900         05  FILLER   PIC X(57)  VALUE
032000     '198 008054 028       034  Y    INTERSTITIAL LUNG DISEASE '.
032100         05  FILLER   PIC X(57)  VALUE
032200     '199 018345 058       075       PNEUMOTHORAX W MCC        '.
032300         05  FILLER   PIC X(57)  VALUE
032400     '200 010084 034       044       PNEUMOTHORAX W CC         '.
032500         05  FILLER   PIC X(57)  VALUE
032600     '201 007096 025       032       PNEUMOTHORAX W/O CC/MCC   '.
032700         05  FILLER   PIC X(57)  VALUE
032800     '202 008775 032       039       BRONCHITIS & ASTHMA W CC/M'.
032900         05  FILLER   PIC X(57)  VALUE
033000     '203 006535 025       030       BRONCHITIS & ASTHMA W/O CC'.
033100         05  FILLER   PIC X(57)  VALUE
033200     '204 007041 021       027       RESPIRATORY SIGNS & SYMPTO'.
033300         05  FILLER   PIC X(57)  VALUE
033400     '205 013999 040       053  Y    OTHER RESPIRATORY SYSTEM D'.
033500         05  FILLER   PIC X(57)  VALUE
033600     '206 007942 025       032  Y    OTHER RESPIRATORY SYSTEM D'.
033700         05  FILLER   PIC X(57)  VALUE
033800     '207 053425 124       144  Y    RESPIRATORY SYSTEM DIAGNOS'.
033900         05  FILLER   PIC X(57)  VALUE
034000     '208 022969 050       068       RESPIRATORY SYSTEM DIAGNOS'.
034100         05  FILLER   PIC X(57)  VALUE
034200     '215 154348 112       172       OTHER HEART ASSIST SYSTEM '.
034300         05  FILLER   PIC X(57)  VALUE
034400     '216 095238 130       158  Y Y  CARDIAC VALVE & OTH MAJ CA'.
034500         05  FILLER   PIC X(57)  VALUE
034600     '217 063291 088       099  Y Y  CARDIAC VALVE & OTH MAJ CA'.
034700         05  FILLER   PIC X(57)  VALUE
034800     '218 055693 064       073  Y Y  CARDIAC VALVE & OTH MAJ CA'.
034900         05  FILLER   PIC X(57)  VALUE
035000     '219 077067 098       119  Y Y  CARDIAC VALVE & OTH MAJ CA'.
035100         05  FILLER   PIC X(57)  VALUE
035200     '220 052056 066       073  Y Y  CARDIAC VALVE & OTH MAJ CA'.
035300         05  FILLER   PIC X(57)  VALUE
035400     '221 046347 049       054  Y Y  CARDIAC VALVE & OTH MAJ CA'.
035500         05  FILLER   PIC X(57)  VALUE
035600     '222 086570 099       120       CARDIAC DEFIB IMPLANT W CA'.
035700         05  FILLER   PIC X(57)  VALUE
035800     '223 062924 044       060       CARDIAC DEFIB IMPLANT W CA'.
035900         05  FILLER   PIC X(57)  VALUE
036000     '224 076733 079       098       CARDIAC DEFIB IMPLANT W CA'.
036100         05  FILLER   PIC X(57)  VALUE
036200     '225 058610 041       049       CARDIAC DEFIB IMPLANT W CA'.
036300         05  FILLER   PIC X(57)  VALUE
036400     '226 069573 064       087       CARDIAC DEFIBRILLATOR IMPL'.
036500         05  FILLER   PIC X(57)  VALUE
036600     '227 054493 024       035       CARDIAC DEFIBRILLATOR IMPL'.
036700         05  FILLER   PIC X(57)  VALUE
036800     '228 073113 112       135       OTHER CARDIOTHORACIC PROCE'.
036900         05  FILLER   PIC X(57)  VALUE
037000     '229 044606 065       075       OTHER CARDIOTHORACIC PROCE'.
037100         05  FILLER   PIC X(57)  VALUE
037200     '230 040755 043       050       OTHER CARDIOTHORACIC PROCE'.
037300         05  FILLER   PIC X(57)  VALUE
037400     '231 077247 106       125       CORONARY BYPASS W PTCA W M'.
037500         05  FILLER   PIC X(57)  VALUE
037600     '232 055976 079       086       CORONARY BYPASS W PTCA W/O'.
037700         05  FILLER   PIC X(57)  VALUE
037800     '233 073493 118       133  Y    CORONARY BYPASS W CARDIAC '.
037900         05  FILLER   PIC X(57)  VALUE
038000     '234 048816 080       086  Y    CORONARY BYPASS W CARDIAC '.
038100         05  FILLER   PIC X(57)  VALUE
038200     '235 057089 090       103  Y    CORONARY BYPASS W/O CARDIA'.
038300         05  FILLER   PIC X(57)  VALUE
038400     '236 037952 060       065  Y    CORONARY BYPASS W/O CARDIA'.
038500         05  FILLER   PIC X(57)  VALUE
038600     '237 050843 067       097       MAJOR CARDIOVASC PROCEDURE'.
038700         05  FILLER   PIC X(57)  VALUE
038800     '238 034241 026       037       MAJOR CARDIOVASC PROCEDURE'.
038900         05  FILLER   PIC X(57)  VALUE
039000     '239 047590 106       134  Y    AMPUTATION FOR CIRC SYS DI'.
039100         05  FILLER   PIC X(57)  VALUE
039200     '240 027594 072       088  Y    AMPUTATION FOR CIRC SYS DI'.
039300         05  FILLER   PIC X(57)  VALUE
039400     '241 014111 044       052  Y    AMPUTATION FOR CIRC SYS DI'.
039500         05  FILLER   PIC X(57)  VALUE
039600     '242 037242 058       074  Y    PERMANENT CARDIAC PACEMAKE'.
039700         05  FILLER   PIC X(57)  VALUE
039800     '243 026695 036       045  Y    PERMANENT CARDIAC PACEMAKE'.
039900         05  FILLER   PIC X(57)  VALUE
040000     '244 021555 024       029  Y    PERMANENT CARDIAC PACEMAKE'.
040100         05  FILLER   PIC X(57)  VALUE
040200     '245 046485 034       049       AICD GENERATOR PROCEDURES '.
040300         05  FILLER   PIC X(57)  VALUE
040400     '246 032368 040       054       PERC CARDIOVASC PROC W DRU'.
040500         05  FILLER   PIC X(57)  VALUE
040600     '247 020586 021       025       PERC CARDIOVASC PROC W DRU'.
040700         05  FILLER   PIC X(57)  VALUE
040800     '248 030411 048       064       PERC CARDIOVASC PROC W NON'.
040900         05  FILLER   PIC X(57)  VALUE
041000     '249 018808 024       030       PERC CARDIOVASC PROC W NON'.
041100         05  FILLER   PIC X(57)  VALUE
041200     '250 029885 051       069       PERC CARDIOVASC PROC W/O C'.
041300         05  FILLER   PIC X(57)  VALUE
041400     '251 020399 023       030       PERC CARDIOVASC PROC W/O C'.
041500         05  FILLER   PIC X(57)  VALUE
041600     '252 032646 054       079       OTHER VASCULAR PROCEDURES '.
041700         05  FILLER   PIC X(57)  VALUE
041800     '253 025532 040       055       OTHER VASCULAR PROCEDURES '.
041900         05  FILLER   PIC X(57)  VALUE
042000     '254 017304 022       028       OTHER VASCULAR PROCEDURES '.
042100         05  FILLER   PIC X(57)  VALUE
042200     '255 026051 067       085  Y    UPPER LIMB & TOE AMPUTATIO'.
042300         05  FILLER   PIC X(57)  VALUE
042400     '256 016986 055       066  Y    UPPER LIMB & TOE AMPUTATIO'.
042500         05  FILLER   PIC X(57)  VALUE
042600     '257 010558 032       041  Y    UPPER LIMB & TOE AMPUTATIO'.
042700         05  FILLER   PIC X(57)  VALUE
042800     '258 027613 049       063       CARDIAC PACEMAKER DEVICE R'.
042900         05  FILLER   PIC X(57)  VALUE
043000     '259 019924 027       035       CARDIAC PACEMAKER DEVICE R'.
043100         05  FILLER   PIC X(57)  VALUE
043200     '260 037456 079       106       CARDIAC PACEMAKER REVISION'.
043300         05  FILLER   PIC X(57)  VALUE
043400     '261 018552 035       046       CARDIAC PACEMAKER REVISION'.
043500         05  FILLER   PIC X(57)  VALUE
043600     '262 013978 024       030       CARDIAC PACEMAKER REVISION'.
043700         05  FILLER   PIC X(57)  VALUE
043800     '263 018664 037       056       VEIN LIGATION & STRIPPING '.
043900         05  FILLER   PIC X(57)  VALUE
044000     '264 028292 058       084  Y    OTHER CIRCULATORY SYSTEM O'.
044100         05  FILLER   PIC X(57)  VALUE
044200     '265 028641 028       043       AICD LEAD PROCEDURES      '.
044300         05  FILLER   PIC X(57)  VALUE
044400     '266 089920 084       106  Y Y  ENDOVASCULAR CARDIAC VALVE'.
044500         05  FILLER   PIC X(57)  VALUE
044600     '267 067517 050       058  Y Y  ENDOVASCULAR CARDIAC VALVE'.
044700         05  FILLER   PIC X(57)  VALUE
044800     '280 017289 047       060  Y    ACUTE MYOCARDIAL INFARCTIO'.
044900         05  FILLER   PIC X(57)  VALUE
045000     '281 010247 030       037  Y    ACUTE MYOCARDIAL INFARCTIO'.
045100         05  FILLER   PIC X(57)  VALUE
045200     '282 007562 020       024  Y    ACUTE MYOCARDIAL INFARCTIO'.
045300         05  FILLER   PIC X(57)  VALUE
045400     '283 016753 030       048       ACUTE MYOCARDIAL INFARCTIO'.
045500         05  FILLER   PIC X(57)  VALUE
045600     '284 007703 018       025       ACUTE MYOCARDIAL INFARCTIO'.
045700         05  FILLER   PIC X(57)  VALUE
045800     '285 005065 013       016       ACUTE MYOCARDIAL INFARCTIO'.
045900         05  FILLER   PIC X(57)  VALUE
046000     '286 021240 051       068       CIRCULATORY DISORDERS EXCE'.
046100         05  FILLER   PIC X(57)  VALUE
046200     '287 011290 025       032       CIRCULATORY DISORDERS EXCE'.
046300         05  FILLER   PIC X(57)  VALUE
046400     '288 027138 076       095  Y    ACUTE & SUBACUTE ENDOCARDI'.
046500         05  FILLER   PIC X(57)  VALUE
046600     '289 016991 058       070  Y    ACUTE & SUBACUTE ENDOCARDI'.
046700         05  FILLER   PIC X(57)  VALUE
046800     '290 012476 039       049  Y    ACUTE & SUBACUTE ENDOCARDI'.
046900         05  FILLER   PIC X(57)  VALUE
047000     '291 015097 047       059  Y    HEART FAILURE & SHOCK W MC'.
047100         05  FILLER   PIC X(57)  VALUE
047200     '292 009824 037       045  Y    HEART FAILURE & SHOCK W CC'.
047300         05  FILLER   PIC X(57)  VALUE
047400     '293 006762 026       031  Y    HEART FAILURE & SHOCK W/O '.
047500         05  FILLER   PIC X(57)  VALUE
047600     '294 010480 041       050       DEEP VEIN THROMBOPHLEBITIS'.
047700         05  FILLER   PIC X(57)  VALUE
047800     '295 006926 031       037       DEEP VEIN THROMBOPHLEBITIS'.
047900         05  FILLER   PIC X(57)  VALUE
048000     '296 012347 018       027       CARDIAC ARREST, UNEXPLAINE'.
048100         05  FILLER   PIC X(57)  VALUE
048200     '297 006475 013       016       CARDIAC ARREST, UNEXPLAINE'.
048300         05  FILLER   PIC X(57)  VALUE
048400     '298 004227 011       012       CARDIAC ARREST, UNEXPLAINE'.
048500         05  FILLER   PIC X(57)  VALUE
048600     '299 014094 044       057  Y    PERIPHERAL VASCULAR DISORD'.
048700         05  FILLER   PIC X(57)  VALUE
048800     '300 009770 036       044  Y    PERIPHERAL VASCULAR DISORD'.
048900         05  FILLER   PIC X(57)  VALUE
049000     '301 006776 027       033  Y    PERIPHERAL VASCULAR DISORD'.
049100         05  FILLER   PIC X(57)  VALUE
049200     '302 010311 029       039       ATHEROSCLEROSIS W MCC     '.
049300         05  FILLER   PIC X(57)  VALUE
049400     '303 006101 019       023       ATHEROSCLEROSIS W/O MCC   '.
049500         05  FILLER   PIC X(57)  VALUE
049600     '304 010016 033       042       HYPERTENSION W MCC        '.
049700         05  FILLER   PIC X(57)  VALUE
049800     '305 006272 021       026       HYPERTENSION W/O MCC      '.
049900         05  FILLER   PIC X(57)  VALUE
050000     '306 013687 039       052       CARDIAC CONGENITAL & VALVU'.
050100         05  FILLER   PIC X(57)  VALUE
050200     '307 007698 025       031       CARDIAC CONGENITAL & VALVU'.
050300         05  FILLER   PIC X(57)  VALUE
050400     '308 012107 038       049       CARDIAC ARRHYTHMIA & CONDU'.
050500         05  FILLER   PIC X(57)  VALUE
050600     '309 007865 027       033       CARDIAC ARRHYTHMIA & CONDU'.
050700         05  FILLER   PIC X(57)  VALUE
050800     '310 005493 019       023       CARDIAC ARRHYTHMIA & CONDU'.
050900         05  FILLER   PIC X(57)  VALUE
051000     '311 005662 018       022       ANGINA PECTORIS           '.
051100         05  FILLER   PIC X(57)  VALUE
051200     '312 007423 024       030       SYNCOPE & COLLAPSE        '.
051300         05  FILLER   PIC X(57)  VALUE
051400     '313 006138 018       021       CHEST PAIN                '.
051500         05  FILLER   PIC X(57)  VALUE
051600     '314 019195 050       067  Y    OTHER CIRCULATORY SYSTEM D'.
051700         05  FILLER   PIC X(57)  VALUE
051800     '315 009613 030       039  Y    OTHER CIRCULATORY SYSTEM D'.
051900         05  FILLER   PIC X(57)  VALUE
052000     '316 006210 020       024  Y    OTHER CIRCULATORY SYSTEM D'.
052100         05  FILLER   PIC X(57)  VALUE
052200     '326 053847 112       145  Y    STOMACH, ESOPHAGEAL & DUOD'.
052300         05  FILLER   PIC X(57)  VALUE
052400     '327 026532 060       078  Y    STOMACH, ESOPHAGEAL & DUOD'.
052500         05  FILLER   PIC X(57)  VALUE
052600     '328 014949 026       034  Y    STOMACH, ESOPHAGEAL & DUOD'.
052700         05  FILLER   PIC X(57)  VALUE
052800     '329 050776 117       144  Y    MAJOR SMALL & LARGE BOWEL '.
052900         05  FILLER   PIC X(57)  VALUE
053000     '330 025491 071       084  Y    MAJOR SMALL & LARGE BOWEL '.
053100         05  FILLER   PIC X(57)  VALUE
053200     '331 016580 043       048  Y    MAJOR SMALL & LARGE BOWEL '.
053300         05  FILLER   PIC X(57)  VALUE
053400     '332 047048 105       128  Y    RECTAL RESECTION W MCC    '.
053500         05  FILLER   PIC X(57)  VALUE
053600     '333 024728 063       073  Y    RECTAL RESECTION W CC     '.
053700         05  FILLER   PIC X(57)  VALUE
053800     '334 016032 036       042  Y    RECTAL RESECTION W/O CC/MC'.
053900         05  FILLER   PIC X(57)  VALUE
054000     '335 042881 109       132  Y    PERITONEAL ADHESIOLYSIS W '.
054100         05  FILLER   PIC X(57)  VALUE
054200     '336 023539 069       083  Y    PERITONEAL ADHESIOLYSIS W '.
054300         05  FILLER   PIC X(57)  VALUE
054400     '337 015596 041       050  Y    PERITONEAL ADHESIOLYSIS W/'.
054500         05  FILLER   PIC X(57)  VALUE
054600     '338 030701 076       092       APPENDECTOMY W COMPLICATED'.
054700         05  FILLER   PIC X(57)  VALUE
054800     '339 017340 050       059       APPENDECTOMY W COMPLICATED'.
054900         05  FILLER   PIC X(57)  VALUE
055000     '340 012137 029       035       APPENDECTOMY W COMPLICATED'.
055100         05  FILLER   PIC X(57)  VALUE
055200     '341 022862 047       064       APPENDECTOMY W/O COMPLICAT'.
055300         05  FILLER   PIC X(57)  VALUE
055400     '342 013112 027       035       APPENDECTOMY W/O COMPLICAT'.
055500         05  FILLER   PIC X(57)  VALUE
055600     '343 009404 016       019       APPENDECTOMY W/O COMPLICAT'.
055700         05  FILLER   PIC X(57)  VALUE
055800     '344 033079 087       112       MINOR SMALL & LARGE BOWEL '.
055900         05  FILLER   PIC X(57)  VALUE
056000     '345 017107 054       064       MINOR SMALL & LARGE BOWEL '.
056100         05  FILLER   PIC X(57)  VALUE
056200     '346 011991 038       043       MINOR SMALL & LARGE BOWEL '.
056300         05  FILLER   PIC X(57)  VALUE
056400     '347 026226 064       087       ANAL & STOMAL PROCEDURES W'.
056500         05  FILLER   PIC X(57)  VALUE
056600     '348 013825 040       051       ANAL & STOMAL PROCEDURES W'.
056700         05  FILLER   PIC X(57)  VALUE
056800     '349 009078 025       030       ANAL & STOMAL PROCEDURES W'.
056900         05  FILLER   PIC X(57)  VALUE
057000     '350 024665 057       076       INGUINAL & FEMORAL HERNIA '.
057100         05  FILLER   PIC X(57)  VALUE
057200     '351 014024 035       044       INGUINAL & FEMORAL HERNIA '.
057300         05  FILLER   PIC X(57)  VALUE
057400     '352 009288 021       025       INGUINAL & FEMORAL HERNIA '.
057500         05  FILLER   PIC X(57)  VALUE
057600     '353 029077 064       083       HERNIA PROCEDURES EXCEPT I'.
057700         05  FILLER   PIC X(57)  VALUE
057800     '354 016915 041       050       HERNIA PROCEDURES EXCEPT I'.
057900         05  FILLER   PIC X(57)  VALUE
058000     '355 012521 026       032       HERNIA PROCEDURES EXCEPT I'.
058100         05  FILLER   PIC X(57)  VALUE
058200     '356 038573 084       113  Y    OTHER DIGESTIVE SYSTEM O.R'.
058300         05  FILLER   PIC X(57)  VALUE
058400     '357 021072 052       067  Y    OTHER DIGESTIVE SYSTEM O.R'.
058500         05  FILLER   PIC X(57)  VALUE
058600     '358 013737 031       039  Y    OTHER DIGESTIVE SYSTEM O.R'.
058700         05  FILLER   PIC X(57)  VALUE
058800     '368 018641 049       064       MAJOR ESOPHAGEAL DISORDERS'.
058900         05  FILLER   PIC X(57)  VALUE
059000     '369 010703 034       041       MAJOR ESOPHAGEAL DISORDERS'.
059100         05  FILLER   PIC X(57)  VALUE
059200     '370 007390 024       029       MAJOR ESOPHAGEAL DISORDERS'.
059300         05  FILLER   PIC X(57)  VALUE
059400     '371 018633 061       078  Y    MAJOR GASTROINTESTINAL DIS'.
059500         05  FILLER   PIC X(57)  VALUE
059600     '372 011343 046       056  Y    MAJOR GASTROINTESTINAL DIS'.
059700         05  FILLER   PIC X(57)  VALUE
059800     '373 008013 035       041  Y    MAJOR GASTROINTESTINAL DIS'.
059900         05  FILLER   PIC X(57)  VALUE
060000     '374 020182 060       079  Y    DIGESTIVE MALIGNANCY W MCC'.
060100         05  FILLER   PIC X(57)  VALUE
060200     '375 012429 042       053  Y    DIGESTIVE MALIGNANCY W CC '.
060300         05  FILLER   PIC X(57)  VALUE
060400     '376 009021 029       036  Y    DIGESTIVE MALIGNANCY W/O C'.
060500         05  FILLER   PIC X(57)  VALUE
060600     '377 017775 048       061  Y    G.I. HEMORRHAGE W MCC     '.
060700         05  FILLER   PIC X(57)  VALUE
060800     '378 010021 033       039  Y    G.I. HEMORRHAGE W CC      '.
060900         05  FILLER   PIC X(57)  VALUE
061000     '379 006776 023       027  Y    G.I. HEMORRHAGE W/O CC/MCC'.
061100         05  FILLER   PIC X(57)  VALUE
061200     '380 019265 054       070  Y    COMPLICATED PEPTIC ULCER W'.
061300         05  FILLER   PIC X(57)  VALUE
061400     '381 010875 036       044  Y    COMPLICATED PEPTIC ULCER W'.
061500         05  FILLER   PIC X(57)  VALUE
061600     '382 007591 027       032  Y    COMPLICATED PEPTIC ULCER W'.
061700         05  FILLER   PIC X(57)  VALUE
061800     '383 013215 042       053       UNCOMPLICATED PEPTIC ULCER'.
061900         05  FILLER   PIC X(57)  VALUE
062000     '384 008510 029       034       UNCOMPLICATED PEPTIC ULCER'.
062100         05  FILLER   PIC X(57)  VALUE
062200     '385 017649 059       078       INFLAMMATORY BOWEL DISEASE'.
062300         05  FILLER   PIC X(57)  VALUE
062400     '386 010040 039       049       INFLAMMATORY BOWEL DISEASE'.
062500         05  FILLER   PIC X(57)  VALUE
062600     '387 007449 030       036       INFLAMMATORY BOWEL DISEASE'.
062700         05  FILLER   PIC X(57)  VALUE
062800     '388 016100 053       069  Y    G.I. OBSTRUCTION W MCC    '.
062900         05  FILLER   PIC X(57)  VALUE
063000     '389 008717 036       044  Y    G.I. OBSTRUCTION W CC     '.
063100         05  FILLER   PIC X(57)  VALUE
063200     '390 006034 027       031  Y    G.I. OBSTRUCTION W/O CC/MC'.
063300         05  FILLER   PIC X(57)  VALUE
063400     '391 011976 038       051       ESOPHAGITIS, GASTROENT & M'.
063500         05  FILLER   PIC X(57)  VALUE
063600     '392 007388 028       035       ESOPHAGITIS, GASTROENT & M'.
063700         05  FILLER   PIC X(57)  VALUE
063800     '393 016893 047       066       OTHER DIGESTIVE SYSTEM DIA'.
063900         05  FILLER   PIC X(57)  VALUE
064000     '394 009448 034       043       OTHER DIGESTIVE SYSTEM DIA'.
064100         05  FILLER   PIC X(57)  VALUE
064200     '395 006574 024       030       OTHER DIGESTIVE SYSTEM DIA'.
064300         05  FILLER   PIC X(57)  VALUE
064400     '405 055387 108       144  Y    PANCREAS, LIVER & SHUNT PR'.
064500         05  FILLER   PIC X(57)  VALUE
064600     '406 028067 060       075  Y    PANCREAS, LIVER & SHUNT PR'.
064700         05  FILLER   PIC X(57)  VALUE
064800     '407 019472 040       048  Y    PANCREAS, LIVER & SHUNT PR'.
064900         05  FILLER   PIC X(57)  VALUE
065000     '408 038967 100       123       BILIARY TRACT PROC EXCEPT '.
065100         05  FILLER   PIC X(57)  VALUE
065200     '409 022218 063       075       BILIARY TRACT PROC EXCEPT '.
065300         05  FILLER   PIC X(57)  VALUE
065400     '410 016205 045       052       BILIARY TRACT PROC EXCEPT '.
065500         05  FILLER   PIC X(57)  VALUE
065600     '411 036261 095       117       CHOLECYSTECTOMY W C.D.E. W'.
065700         05  FILLER   PIC X(57)  VALUE
065800     '412 024166 063       074       CHOLECYSTECTOMY W C.D.E. W'.
065900         05  FILLER   PIC X(57)  VALUE
066000     '413 017708 042       051       CHOLECYSTECTOMY W C.D.E. W'.
066100         05  FILLER   PIC X(57)  VALUE
066200     '414 035545 087       106  Y    CHOLECYSTECTOMY EXCEPT BY '.
066300         05  FILLER   PIC X(57)  VALUE
066400     '415 020267 056       065  Y    CHOLECYSTECTOMY EXCEPT BY '.
066500         05  FILLER   PIC X(57)  VALUE
066600     '416 013465 036       042  Y    CHOLECYSTECTOMY EXCEPT BY '.
066700         05  FILLER   PIC X(57)  VALUE
066800     '417 024353 059       074       LAPAROSCOPIC CHOLECYSTECTO'.
066900         05  FILLER   PIC X(57)  VALUE
067000     '418 016600 040       048       LAPAROSCOPIC CHOLECYSTECTO'.
067100         05  FILLER   PIC X(57)  VALUE
067200     '419 012316 026       030       LAPAROSCOPIC CHOLECYSTECTO'.
067300         05  FILLER   PIC X(57)  VALUE
067400     '420 034621 081       114       HEPATOBILIARY DIAGNOSTIC P'.
067500         05  FILLER   PIC X(57)  VALUE
067600     '421 017699 042       056       HEPATOBILIARY DIAGNOSTIC P'.
067700         05  FILLER   PIC X(57)  VALUE
067800     '422 012352 027       033       HEPATOBILIARY DIAGNOSTIC P'.
067900         05  FILLER   PIC X(57)  VALUE
068000     '423 041961 098       132       OTHER HEPATOBILIARY OR PAN'.
068100         05  FILLER   PIC X(57)  VALUE
068200     '424 022993 062       079       OTHER HEPATOBILIARY OR PAN'.
068300         05  FILLER   PIC X(57)  VALUE
068400     '425 013793 037       044       OTHER HEPATOBILIARY OR PAN'.
068500         05  FILLER   PIC X(57)  VALUE
068600     '432 016710 047       062       CIRRHOSIS & ALCOHOLIC HEPA'.
068700         05  FILLER   PIC X(57)  VALUE
068800     '433 009173 033       041       CIRRHOSIS & ALCOHOLIC HEPA'.
068900         05  FILLER   PIC X(57)  VALUE
069000     '434 006229 024       029       CIRRHOSIS & ALCOHOLIC HEPA'.
069100         05  FILLER   PIC X(57)  VALUE
069200     '435 017524 052       068       MALIGNANCY OF HEPATOBILIAR'.
069300         05  FILLER   PIC X(57)  VALUE
069400     '436 011640 039       049       MALIGNANCY OF HEPATOBILIAR'.
069500         05  FILLER   PIC X(57)  VALUE
069600     '437 008971 027       035       MALIGNANCY OF HEPATOBILIAR'.
069700         05  FILLER   PIC X(57)  VALUE
069800     '438 017023 051       068       DISORDERS OF PANCREAS EXCE'.
069900         05  FILLER   PIC X(57)  VALUE
070000     '439 009071 036       044       DISORDERS OF PANCREAS EXCE'.
070100         05  FILLER   PIC X(57)  VALUE
070200     '440 006423 027       032       DISORDERS OF PANCREAS EXCE'.
070300         05  FILLER   PIC X(57)  VALUE
070400     '441 018835 050       068  Y    DISORDERS OF LIVER EXCEPT '.
070500         05  FILLER   PIC X(57)  VALUE
070600     '442 009266 033       042  Y    DISORDERS OF LIVER EXCEPT '.
070700         05  FILLER   PIC X(57)  VALUE
070800     '443 006512 025       031  Y    DISORDERS OF LIVER EXCEPT '.
070900         05  FILLER   PIC X(57)  VALUE
071000     '444 016212 047       061       DISORDERS OF THE BILIARY T'.
071100         05  FILLER   PIC X(57)  VALUE
071200     '445 010654 034       042       DISORDERS OF THE BILIARY T'.
071300         05  FILLER   PIC X(57)  VALUE
071400     '446 007569 024       029       DISORDERS OF THE BILIARY T'.
071500         05  FILLER   PIC X(57)  VALUE
071600     '453 111637 095       117       COMBINED ANTERIOR/POSTERIO'.
071700         05  FILLER   PIC X(57)  VALUE
071800     '454 080184 049       058       COMBINED ANTERIOR/POSTERIO'.
071900         05  FILLER   PIC X(57)  VALUE
072000     '455 062503 031       035       COMBINED ANTERIOR/POSTERIO'.
072100         05  FILLER   PIC X(57)  VALUE
072200     '456 094039 099       120       SPINAL FUS EXC CERV W SPIN'.
072300         05  FILLER   PIC X(57)  VALUE
072400     '457 069074 055       065       SPINAL FUS EXC CERV W SPIN'.
072500         05  FILLER   PIC X(57)  VALUE
072600     '458 052637 034       038       SPINAL FUS EXC CERV W SPIN'.
072700         05  FILLER   PIC X(57)  VALUE
072800     '459 066686 068       085  Y    SPINAL FUSION EXCEPT CERVI'.
072900         05  FILLER   PIC X(57)  VALUE
073000     '460 039998 030       035  Y    SPINAL FUSION EXCEPT CERVI'.
073100         05  FILLER   PIC X(57)  VALUE
073200     '461 050202 063       076       BILATERAL OR MULTIPLE MAJO'.
073300         05  FILLER   PIC X(57)  VALUE
073400     '462 034905 034       037       BILATERAL OR MULTIPLE MAJO'.
073500         05  FILLER   PIC X(57)  VALUE
073600     '463 053345 107       142  Y    WND DEBRID & SKN GRFT EXC '.
073700         05  FILLER   PIC X(57)  VALUE
073800     '464 030085 063       078  Y    WND DEBRID & SKN GRFT EXC '.
073900         05  FILLER   PIC X(57)  VALUE
074000     '465 019463 039       048  Y    WND DEBRID & SKN GRFT EXC '.
074100         05  FILLER   PIC X(57)  VALUE
074200     '466 051513 067       082  Y    REVISION OF HIP OR KNEE RE'.
074300         05  FILLER   PIC X(57)  VALUE
074400     '467 034231 038       043  Y    REVISION OF HIP OR KNEE RE'.
074500         05  FILLER   PIC X(57)  VALUE
074600     '468 027652 029       031  Y    REVISION OF HIP OR KNEE RE'.
074700         05  FILLER   PIC X(57)  VALUE
074800     '469 033905 061       072  Y    MAJOR JOINT REPLACEMENT OR'.
074900         05  FILLER   PIC X(57)  VALUE
075000     '470 021137 030       032  Y    MAJOR JOINT REPLACEMENT OR'.
075100         05  FILLER   PIC X(57)  VALUE
075200     '471 048737 063       087       CERVICAL SPINAL FUSION W M'.
075300         05  FILLER   PIC X(57)  VALUE
075400     '472 029166 024       034       CERVICAL SPINAL FUSION W C'.
075500         05  FILLER   PIC X(57)  VALUE
075600     '473 022655 015       018       CERVICAL SPINAL FUSION W/O'.
075700         05  FILLER   PIC X(57)  VALUE
075800     '474 035943 086       109  Y    AMPUTATION FOR MUSCULOSKEL'.
075900         05  FILLER   PIC X(57)  VALUE
076000     '475 020504 058       072  Y    AMPUTATION FOR MUSCULOSKEL'.
076100         05  FILLER   PIC X(57)  VALUE
076200     '476 011187 031       039  Y    AMPUTATION FOR MUSCULOSKEL'.
076300         05  FILLER   PIC X(57)  VALUE
076400     '477 031638 085       104  Y Y  BIOPSIES OF MUSCULOSKELETA'.
076500         05  FILLER   PIC X(57)  VALUE
076600     '478 022441 055       067  Y Y  BIOPSIES OF MUSCULOSKELETA'.
076700         05  FILLER   PIC X(57)  VALUE
076800     '479 017312 034       042  Y Y  BIOPSIES OF MUSCULOSKELETA'.
076900         05  FILLER   PIC X(57)  VALUE
077000     '480 030052 069       080  Y Y  HIP & FEMUR PROCEDURES EXC'.
077100         05  FILLER   PIC X(57)  VALUE
077200     '481 019776 047       051  Y Y  HIP & FEMUR PROCEDURES EXC'.
077300         05  FILLER   PIC X(57)  VALUE
077400     '482 016243 038       041  Y Y  HIP & FEMUR PROCEDURES EXC'.
077500         05  FILLER   PIC X(57)  VALUE
077600     '483 024205 020       024       MAJOR JOINT/LIMB REATTACHM'.
077700         05  FILLER   PIC X(57)  VALUE
077800     '485 030949 080       095       KNEE PROCEDURES W PDX OF I'.
077900         05  FILLER   PIC X(57)  VALUE
078000     '486 020656 055       063       KNEE PROCEDURES W PDX OF I'.
078100         05  FILLER   PIC X(57)  VALUE
078200     '487 015630 040       047       KNEE PROCEDURES W PDX OF I'.
078300         05  FILLER   PIC X(57)  VALUE
078400     '488 017225 035       042  Y    KNEE PROCEDURES W/O PDX OF'.
078500         05  FILLER   PIC X(57)  VALUE
078600     '489 013186 024       027  Y    KNEE PROCEDURES W/O PDX OF'.
078700         05  FILLER   PIC X(57)  VALUE
078800     '492 031873 065       080  Y Y  LOWER EXTREM & HUMER PROC '.
078900         05  FILLER   PIC X(57)  VALUE
079000     '493 020354 040       047  Y Y  LOWER EXTREM & HUMER PROC '.
079100         05  FILLER   PIC X(57)  VALUE
079200     '494 015397 027       032  Y Y  LOWER EXTREM & HUMER PROC '.
079300         05  FILLER   PIC X(57)  VALUE
079400     '495 030476 073       096  Y Y  LOCAL EXCISION & REMOVAL I'.
079500         05  FILLER   PIC X(57)  VALUE
079600     '496 017289 041       051  Y Y  LOCAL EXCISION & REMOVAL I'.
079700         05  FILLER   PIC X(57)  VALUE
079800     '497 012230 021       027  Y Y  LOCAL EXCISION & REMOVAL I'.
079900         05  FILLER   PIC X(57)  VALUE
080000     '498 021416 055       072       LOCAL EXCISION & REMOVAL I'.
080100         05  FILLER   PIC X(57)  VALUE
080200     '499 010753 023       029       LOCAL EXCISION & REMOVAL I'.
080300         05  FILLER   PIC X(57)  VALUE
080400     '500 032420 077       102  Y Y  SOFT TISSUE PROCEDURES W M'.
080500         05  FILLER   PIC X(57)  VALUE
080600     '501 016474 044       056  Y Y  SOFT TISSUE PROCEDURES W C'.
080700         05  FILLER   PIC X(57)  VALUE
080800     '502 011597 025       030  Y Y  SOFT TISSUE PROCEDURES W/O'.
080900         05  FILLER   PIC X(57)  VALUE
081000     '503 023338 069       085       FOOT PROCEDURES W MCC     '.
081100         05  FILLER   PIC X(57)  VALUE
081200     '504 015691 050       060       FOOT PROCEDURES W CC      '.
081300         05  FILLER   PIC X(57)  VALUE
081400     '505 012474 029       035       FOOT PROCEDURES W/O CC/MCC'.
081500         05  FILLER   PIC X(57)  VALUE
081600     '506 012881 034       043       MAJOR THUMB OR JOINT PROCE'.
081700         05  FILLER   PIC X(57)  VALUE
081800     '507 019154 043       052       MAJOR SHOULDER OR ELBOW JO'.
081900         05  FILLER   PIC X(57)  VALUE
082000     '508 015198 021       026       MAJOR SHOULDER OR ELBOW JO'.
082100         05  FILLER   PIC X(57)  VALUE
082200     '509 015494 036       045       ARTHROSCOPY               '.
082300         05  FILLER   PIC X(57)  VALUE
082400     '510 022857 048       058  Y    SHOULDER,ELBOW OR FOREARM '.
082500         05  FILLER   PIC X(57)  VALUE
082600     '511 016509 033       039  Y    SHOULDER,ELBOW OR FOREARM '.
082700         05  FILLER   PIC X(57)  VALUE
082800     '512 012963 020       024  Y    SHOULDER,ELBOW OR FOREARM '.
082900         05  FILLER   PIC X(57)  VALUE
083000     '513 014462 036       048       HAND OR WRIST PROC, EXCEPT'.
083100         05  FILLER   PIC X(57)  VALUE
083200     '514 008996 022       027       HAND OR WRIST PROC, EXCEPT'.
083300         05  FILLER   PIC X(57)  VALUE
083400     '515 032235 072       092  Y Y  OTHER MUSCULOSKELET SYS & '.
083500         05  FILLER   PIC X(57)  VALUE
083600     '516 020434 044       054  Y Y  OTHER MUSCULOSKELET SYS & '.
083700         05  FILLER   PIC X(57)  VALUE
083800     '517 017251 027       033  Y Y  OTHER MUSCULOSKELET SYS & '.
083900         05  FILLER   PIC X(57)  VALUE
084000     '518 030628 044       066  Y Y  BACK & NECK PROC EXC SPINA'.
084100         05  FILLER   PIC X(57)  VALUE
084200     '519 016468 031       040  Y Y  BACK & NECK PROC EXC SPINA'.
084300         05  FILLER   PIC X(57)  VALUE
084400     '520 011396 019       022  Y Y  BACK & NECK PROC EXC SPINA'.
084500         05  FILLER   PIC X(57)  VALUE
084600     '533 014495 044       057  Y    FRACTURES OF FEMUR W MCC  '.
084700         05  FILLER   PIC X(57)  VALUE
084800     '534 007594 029       035  Y    FRACTURES OF FEMUR W/O MCC'.
084900         05  FILLER   PIC X(57)  VALUE
085000     '535 012410 041       052  Y    FRACTURES OF HIP & PELVIS '.
085100         05  FILLER   PIC X(57)  VALUE
085200     '536 007201 030       035  Y    FRACTURES OF HIP & PELVIS '.
085300         05  FILLER   PIC X(57)  VALUE
085400     '537 008975 033       041       SPRAINS, STRAINS, & DISLOC'.
085500         05  FILLER   PIC X(57)  VALUE
085600     '538 006917 026       031       SPRAINS, STRAINS, & DISLOC'.
085700         05  FILLER   PIC X(57)  VALUE
085800     '539 018276 061       081  Y    OSTEOMYELITIS W MCC       '.
085900         05  FILLER   PIC X(57)  VALUE
086000     '540 012967 047       059  Y    OSTEOMYELITIS W CC        '.
086100         05  FILLER   PIC X(57)  VALUE
086200     '541 009218 035       045  Y    OSTEOMYELITIS W/O CC/MCC  '.
086300         05  FILLER   PIC X(57)  VALUE
086400     '542 019472 060       078  Y    PATHOLOGICAL FRACTURES & M'.
086500         05  FILLER   PIC X(57)  VALUE
086600     '543 011227 041       051  Y    PATHOLOGICAL FRACTURES & M'.
086700         05  FILLER   PIC X(57)  VALUE
086800     '544 007936 031       037  Y    PATHOLOGICAL FRACTURES & M'.
086900         05  FILLER   PIC X(57)  VALUE
087000     '545 025341 061       085  Y    CONNECTIVE TISSUE DISORDER'.
087100         05  FILLER   PIC X(57)  VALUE
087200     '546 011711 039       050  Y    CONNECTIVE TISSUE DISORDER'.
087300         05  FILLER   PIC X(57)  VALUE
087400     '547 007985 028       035  Y    CONNECTIVE TISSUE DISORDER'.
087500         05  FILLER   PIC X(57)  VALUE
087600     '548 019123 061       078       SEPTIC ARTHRITIS W MCC    '.
087700         05  FILLER   PIC X(57)  VALUE
087800     '549 011514 044       055       SEPTIC ARTHRITIS W CC     '.
087900         05  FILLER   PIC X(57)  VALUE
088000     '550 008390 032       039       SEPTIC ARTHRITIS W/O CC/MC'.
088100         05  FILLER   PIC X(57)  VALUE
088200     '551 015556 048       062  Y    MEDICAL BACK PROBLEMS W MC'.
088300         05  FILLER   PIC X(57)  VALUE
088400     '552 008698 032       038  Y    MEDICAL BACK PROBLEMS W/O '.
088500         05  FILLER   PIC X(57)  VALUE
088600     '553 012187 042       054       BONE DISEASES & ARTHROPATH'.
088700         05  FILLER   PIC X(57)  VALUE
088800     '554 007274 029       035       BONE DISEASES & ARTHROPATH'.
088900         05  FILLER   PIC X(57)  VALUE
089000     '555 012636 039       051       SIGNS & SYMPTOMS OF MUSCUL'.
089100         05  FILLER   PIC X(57)  VALUE
089200     '556 007183 026       032       SIGNS & SYMPTOMS OF MUSCUL'.
089300         05  FILLER   PIC X(57)  VALUE
089400     '557 014269 050       062  Y    TENDONITIS, MYOSITIS & BUR'.
089500         05  FILLER   PIC X(57)  VALUE
089600     '558 008522 034       040  Y    TENDONITIS, MYOSITIS & BUR'.
089700         05  FILLER   PIC X(57)  VALUE
089800     '559 018555 050       068  Y    AFTERCARE, MUSCULOSKELETAL'.
089900         05  FILLER   PIC X(57)  VALUE
090000     '560 010756 035       044  Y    AFTERCARE, MUSCULOSKELETAL'.
090100         05  FILLER   PIC X(57)  VALUE
090200     '561 006688 021       025  Y    AFTERCARE, MUSCULOSKELETAL'.
090300         05  FILLER   PIC X(57)  VALUE
090400     '562 013706 043       055  Y    FX, SPRN, STRN & DISL EXCE'.
090500         05  FILLER   PIC X(57)  VALUE
090600     '563 007756 030       035  Y    FX, SPRN, STRN & DISL EXCE'.
090700         05  FILLER   PIC X(57)  VALUE
090800     '564 015036 048       062       OTHER MUSCULOSKELETAL SYS '.
090900         05  FILLER   PIC X(57)  VALUE
091000     '565 009398 035       044       OTHER MUSCULOSKELETAL SYS '.
091100         05  FILLER   PIC X(57)  VALUE
091200     '566 006871 025       031       OTHER MUSCULOSKELETAL SYS '.
091300         05  FILLER   PIC X(57)  VALUE
091400     '570 023952 072       093  Y    SKIN DEBRIDEMENT W MCC    '.
091500         05  FILLER   PIC X(57)  VALUE
091600     '571 014664 052       063  Y    SKIN DEBRIDEMENT W CC     '.
091700         05  FILLER   PIC X(57)  VALUE
091800     '572 009919 037       044  Y    SKIN DEBRIDEMENT W/O CC/MC'.
091900         05  FILLER   PIC X(57)  VALUE
092000     '573 037073 087       129  Y    SKIN GRAFT FOR SKIN ULCER '.
092100         05  FILLER   PIC X(57)  VALUE
092200     '574 026298 071       093  Y    SKIN GRAFT FOR SKIN ULCER '.
092300         05  FILLER   PIC X(57)  VALUE
092400     '575 014926 045       056  Y    SKIN GRAFT FOR SKIN ULCER '.
092500         05  FILLER   PIC X(57)  VALUE
092600     '576 041423 081       116       SKIN GRAFT EXC FOR SKIN UL'.
092700         05  FILLER   PIC X(57)  VALUE
092800     '577 019812 040       056       SKIN GRAFT EXC FOR SKIN UL'.
092900         05  FILLER   PIC X(57)  VALUE
093000     '578 013162 026       035       SKIN GRAFT EXC FOR SKIN UL'.
093100         05  FILLER   PIC X(57)  VALUE
093200     '579 027263 071       092  Y    OTHER SKIN, SUBCUT TISS & '.
093300         05  FILLER   PIC X(57)  VALUE
093400     '580 015727 041       054  Y    OTHER SKIN, SUBCUT TISS & '.
093500         05  FILLER   PIC X(57)  VALUE
093600     '581 011338 022       028  Y    OTHER SKIN, SUBCUT TISS & '.
093700         05  FILLER   PIC X(57)  VALUE
093800     '582 013003 022       029       MASTECTOMY FOR MALIGNANCY '.
093900         05  FILLER   PIC X(57)  VALUE
094000     '583 010932 017       019       MASTECTOMY FOR MALIGNANCY '.
094100         05  FILLER   PIC X(57)  VALUE
094200     '584 017682 039       052       BREAST BIOPSY, LOCAL EXCIS'.
094300         05  FILLER   PIC X(57)  VALUE
094400     '585 013752 021       025       BREAST BIOPSY, LOCAL EXCIS'.
094500         05  FILLER   PIC X(57)  VALUE
094600     '592 014249 051       066  Y    SKIN ULCERS W MCC         '.
094700         05  FILLER   PIC X(57)  VALUE
094800     '593 010196 043       052  Y    SKIN ULCERS W CC          '.
094900         05  FILLER   PIC X(57)  VALUE
095000     '594 007124 031       039  Y    SKIN ULCERS W/O CC/MCC    '.
095100         05  FILLER   PIC X(57)  VALUE
095200     '595 019629 055       075       MAJOR SKIN DISORDERS W MCC'.
095300         05  FILLER   PIC X(57)  VALUE
095400     '596 009527 036       046       MAJOR SKIN DISORDERS W/O M'.
095500         05  FILLER   PIC X(57)  VALUE
095600     '597 016758 054       071       MALIGNANT BREAST DISORDERS'.
095700         05  FILLER   PIC X(57)  VALUE
095800     '598 011235 038       052       MALIGNANT BREAST DISORDERS'.
095900         05  FILLER   PIC X(57)  VALUE
096000     '599 007259 024       031       MALIGNANT BREAST DISORDERS'.
096100         05  FILLER   PIC X(57)  VALUE
096200     '600 009803 038       047       NON-MALIGNANT BREAST DISOR'.
096300         05  FILLER   PIC X(57)  VALUE
096400     '601 006314 027       033       NON-MALIGNANT BREAST DISOR'.
096500         05  FILLER   PIC X(57)  VALUE
096600     '602 014557 050       062  Y    CELLULITIS W MCC          '.
096700         05  FILLER   PIC X(57)  VALUE
096800     '603 008447 035       042  Y    CELLULITIS W/O MCC        '.
096900         05  FILLER   PIC X(57)  VALUE
097000     '604 012624 039       051       TRAUMA TO THE SKIN, SUBCUT'.
097100         05  FILLER   PIC X(57)  VALUE
097200     '605 007664 026       032       TRAUMA TO THE SKIN, SUBCUT'.
097300         05  FILLER   PIC X(57)  VALUE
097400     '606 013664 042       058       MINOR SKIN DISORDERS W MCC'.
097500         05  FILLER   PIC X(57)  VALUE
097600     '607 007296 028       036       MINOR SKIN DISORDERS W/O M'.
097700         05  FILLER   PIC X(57)  VALUE
097800     '614 024642 041       056       ADRENAL & PITUITARY PROCED'.
097900         05  FILLER   PIC X(57)  VALUE
098000     '615 014243 022       026       ADRENAL & PITUITARY PROCED'.
098100         05  FILLER   PIC X(57)  VALUE
098200     '616 041611 107       131  Y    AMPUTAT OF LOWER LIMB FOR '.
098300         05  FILLER   PIC X(57)  VALUE
098400     '617 019956 061       072  Y    AMPUTAT OF LOWER LIMB FOR '.
098500         05  FILLER   PIC X(57)  VALUE
098600     '618 013512 042       050  Y    AMPUTAT OF LOWER LIMB FOR '.
098700         05  FILLER   PIC X(57)  VALUE
098800     '619 032890 042       065       O.R. PROCEDURES FOR OBESIT'.
098900         05  FILLER   PIC X(57)  VALUE
099000     '620 018470 026       031       O.R. PROCEDURES FOR OBESIT'.
099100         05  FILLER   PIC X(57)  VALUE
099200     '621 015434 018       020       O.R. PROCEDURES FOR OBESIT'.
099300         05  FILLER   PIC X(57)  VALUE
099400     '622 038047 092       126  Y    SKIN GRAFTS & WOUND DEBRID'.
099500         05  FILLER   PIC X(57)  VALUE
099600     '623 018308 057       069  Y    SKIN GRAFTS & WOUND DEBRID'.
099700         05  FILLER   PIC X(57)  VALUE
099800     '624 011314 036       044  Y    SKIN GRAFTS & WOUND DEBRID'.
099900         05  FILLER   PIC X(57)  VALUE
100000     '625 024896 046       071       THYROID, PARATHYROID & THY'.
100100         05  FILLER   PIC X(57)  VALUE
100200     '626 013080 021       031       THYROID, PARATHYROID & THY'.
100300         05  FILLER   PIC X(57)  VALUE
100400     '627 008663 013       015       THYROID, PARATHYROID & THY'.
100500         05  FILLER   PIC X(57)  VALUE
100600     '628 032935 067       094  Y    OTHER ENDOCRINE, NUTRIT & '.
100700         05  FILLER   PIC X(57)  VALUE
100800     '629 022471 062       075  Y    OTHER ENDOCRINE, NUTRIT & '.
100900         05  FILLER   PIC X(57)  VALUE
101000     '630 014305 032       042  Y    OTHER ENDOCRINE, NUTRIT & '.
101100         05  FILLER   PIC X(57)  VALUE
101200     '637 013944 042       055  Y    DIABETES W MCC            '.
101300         05  FILLER   PIC X(57)  VALUE
101400     '638 008261 030       037  Y    DIABETES W CC             '.
101500         05  FILLER   PIC X(57)  VALUE
101600     '639 006068 022       027  Y    DIABETES W/O CC/MCC       '.
101700         05  FILLER   PIC X(57)  VALUE
101800     '640 011044 033       045  Y    MISC DISORDERS OF NUTRITIO'.
101900         05  FILLER   PIC X(57)  VALUE
102000     '641 007051 027       034  Y    MISC DISORDERS OF NUTRITIO'.
102100         05  FILLER   PIC X(57)  VALUE
102200     '642 011429 033       046       INBORN AND OTHER DISORDERS'.
102300         05  FILLER   PIC X(57)  VALUE
102400     '643 016460 054       068  Y    ENDOCRINE DISORDERS W MCC '.
102500         05  FILLER   PIC X(57)  VALUE
102600     '644 010199 038       047  Y    ENDOCRINE DISORDERS W CC  '.
102700         05  FILLER   PIC X(57)  VALUE
102800     '645 007180 028       034  Y    ENDOCRINE DISORDERS W/O CC'.
102900         05  FILLER   PIC X(57)  VALUE
103000     '652 031502 057       066       KIDNEY TRANSPLANT         '.
103100         05  FILLER   PIC X(57)  VALUE
103200     '653 057958 122       151  Y    MAJOR BLADDER PROCEDURES W'.
103300         05  FILLER   PIC X(57)  VALUE
103400     '654 030973 077       087  Y    MAJOR BLADDER PROCEDURES W'.
103500         05  FILLER   PIC X(57)  VALUE
103600     '655 022590 049       055  Y    MAJOR BLADDER PROCEDURES W'.
103700         05  FILLER   PIC X(57)  VALUE
103800     '656 034517 069       090       KIDNEY & URETER PROCEDURES'.
103900         05  FILLER   PIC X(57)  VALUE
104000     '657 020111 044       052       KIDNEY & URETER PROCEDURES'.
104100         05  FILLER   PIC X(57)  VALUE
104200     '658 015299 027       030       KIDNEY & URETER PROCEDURES'.
104300         05  FILLER   PIC X(57)  VALUE
104400     '659 033813 075       100  Y    KIDNEY & URETER PROCEDURES'.
104500         05  FILLER   PIC X(57)  VALUE
104600     '660 018888 042       055  Y    KIDNEY & URETER PROCEDURES'.
104700         05  FILLER   PIC X(57)  VALUE
104800     '661 013494 023       027  Y    KIDNEY & URETER PROCEDURES'.
104900         05  FILLER   PIC X(57)  VALUE
105000     '662 030042 078       103       MINOR BLADDER PROCEDURES W'.
105100         05  FILLER   PIC X(57)  VALUE
105200     '663 015285 039       052       MINOR BLADDER PROCEDURES W'.
105300         05  FILLER   PIC X(57)  VALUE
105400     '664 012406 019       024       MINOR BLADDER PROCEDURES W'.
105500         05  FILLER   PIC X(57)  VALUE
105600     '665 031585 091       117       PROSTATECTOMY W MCC       '.
105700         05  FILLER   PIC X(57)  VALUE
105800     '666 017512 047       063       PROSTATECTOMY W CC        '.
105900         05  FILLER   PIC X(57)  VALUE
106000     '667 009690 022       028       PROSTATECTOMY W/O CC/MCC  '.
106100         05  FILLER   PIC X(57)  VALUE
106200     '668 024989 065       086       TRANSURETHRAL PROCEDURES W'.
106300         05  FILLER   PIC X(57)  VALUE
106400     '669 012662 030       040       TRANSURETHRAL PROCEDURES W'.
106500         05  FILLER   PIC X(57)  VALUE
106600     '670 008957 020       025       TRANSURETHRAL PROCEDURES W'.
106700         05  FILLER   PIC X(57)  VALUE
106800     '671 016170 041       057       URETHRAL PROCEDURES W CC/M'.
106900         05  FILLER   PIC X(57)  VALUE
107000     '672 008496 018       022       URETHRAL PROCEDURES W/O CC'.
107100         05  FILLER   PIC X(57)  VALUE
107200     '673 035023 074       106       OTHER KIDNEY & URINARY TRA'.
107300         05  FILLER   PIC X(57)  VALUE
107400     '674 022600 053       070       OTHER KIDNEY & URINARY TRA'.
107500         05  FILLER   PIC X(57)  VALUE
107600     '675 014443 022       029       OTHER KIDNEY & URINARY TRA'.
107700         05  FILLER   PIC X(57)  VALUE
107800     '682 015194 046       061  Y    RENAL FAILURE W MCC       '.
107900         05  FILLER   PIC X(57)  VALUE
108000     '683 009512 036       044  Y    RENAL FAILURE W CC        '.
108100         05  FILLER   PIC X(57)  VALUE
108200     '684 006085 024       029  Y    RENAL FAILURE W/O CC/MCC  '.
108300         05  FILLER   PIC X(57)  VALUE
108400     '685 010025 027       037       ADMIT FOR RENAL DIALYSIS  '.
108500         05  FILLER   PIC X(57)  VALUE
108600     '686 017637 053       071       KIDNEY & URINARY TRACT NEO'.
108700         05  FILLER   PIC X(57)  VALUE
108800     '687 010054 036       046       KIDNEY & URINARY TRACT NEO'.
108900         05  FILLER   PIC X(57)  VALUE
109000     '688 006911 021       027       KIDNEY & URINARY TRACT NEO'.
109100         05  FILLER   PIC X(57)  VALUE
109200     '689 011172 042       052  Y    KIDNEY & URINARY TRACT INF'.
109300         05  FILLER   PIC X(57)  VALUE
109400     '690 007794 032       038  Y    KIDNEY & URINARY TRACT INF'.
109500         05  FILLER   PIC X(57)  VALUE
109600     '691 016238 029       038       URINARY STONES W ESW LITHO'.
109700         05  FILLER   PIC X(57)  VALUE
109800     '692 011286 018       022       URINARY STONES W ESW LITHO'.
109900         05  FILLER   PIC X(57)  VALUE
110000     '693 013433 039       051       URINARY STONES W/O ESW LIT'.
110100         05  FILLER   PIC X(57)  VALUE
110200     '694 006859 019       024       URINARY STONES W/O ESW LIT'.
110300         05  FILLER   PIC X(57)  VALUE
110400     '695 012450 041       053       KIDNEY & URINARY TRACT SIG'.
110500         05  FILLER   PIC X(57)  VALUE
110600     '696 006619 025       031       KIDNEY & URINARY TRACT SIG'.
110700         05  FILLER   PIC X(57)  VALUE
110800     '697 009229 026       034       URETHRAL STRICTURE        '.
110900         05  FILLER   PIC X(57)  VALUE
111000     '698 015625 051       064  Y    OTHER KIDNEY & URINARY TRA'.
111100         05  FILLER   PIC X(57)  VALUE
111200     '699 010170 035       044  Y    OTHER KIDNEY & URINARY TRA'.
111300         05  FILLER   PIC X(57)  VALUE
111400     '700 007110 026       032  Y    OTHER KIDNEY & URINARY TRA'.
111500         05  FILLER   PIC X(57)  VALUE
111600     '707 018155 029       039       MAJOR MALE PELVIC PROCEDUR'.
111700         05  FILLER   PIC X(57)  VALUE
111800     '708 013262 014       016       MAJOR MALE PELVIC PROCEDUR'.
111900         05  FILLER   PIC X(57)  VALUE
112000     '709 021341 043       070       PENIS PROCEDURES W CC/MCC '.
112100         05  FILLER   PIC X(57)  VALUE
112200     '710 012949 017       021       PENIS PROCEDURES W/O CC/MC'.
112300         05  FILLER   PIC X(57)  VALUE
112400     '711 022547 058       081       TESTES PROCEDURES W CC/MCC'.
112500         05  FILLER   PIC X(57)  VALUE
112600     '712 010632 026       037       TESTES PROCEDURES W/O CC/M'.
112700         05  FILLER   PIC X(57)  VALUE
112800     '713 014828 035       049       TRANSURETHRAL PROSTATECTOM'.
112900         05  FILLER   PIC X(57)  VALUE
113000     '714 007933 018       021       TRANSURETHRAL PROSTATECTOM'.
113100         05  FILLER   PIC X(57)  VALUE
113200     '715 020051 048       066       OTHER MALE REPRODUCTIVE SY'.
113300         05  FILLER   PIC X(57)  VALUE
113400     '716 011857 015       018       OTHER MALE REPRODUCTIVE SY'.
113500         05  FILLER   PIC X(57)  VALUE
113600     '717 017717 046       065       OTHER MALE REPRODUCTIVE SY'.
113700         05  FILLER   PIC X(57)  VALUE
113800     '718 010099 024       030       OTHER MALE REPRODUCTIVE SY'.
113900         05  FILLER   PIC X(57)  VALUE
114000     '722 017569 056       073       MALIGNANCY, MALE REPRODUCT'.
114100         05  FILLER   PIC X(57)  VALUE
114200     '723 010635 038       049       MALIGNANCY, MALE REPRODUCT'.
114300         05  FILLER   PIC X(57)  VALUE
114400     '724 006412 023       030       MALIGNANCY, MALE REPRODUCT'.
114500         05  FILLER   PIC X(57)  VALUE
114600     '725 011790 043       056       BENIGN PROSTATIC HYPERTROP'.
114700         05  FILLER   PIC X(57)  VALUE
114800     '726 007029 027       033       BENIGN PROSTATIC HYPERTROP'.
114900         05  FILLER   PIC X(57)  VALUE
115000     '727 014195 049       062       INFLAMMATION OF THE MALE R'.
115100         05  FILLER   PIC X(57)  VALUE
115200     '728 008006 032       039       INFLAMMATION OF THE MALE R'.
115300         05  FILLER   PIC X(57)  VALUE
115400     '729 010390 034       045       OTHER MALE REPRODUCTIVE SY'.
115500         05  FILLER   PIC X(57)  VALUE
115600     '730 006660 023       030       OTHER MALE REPRODUCTIVE SY'.
115700         05  FILLER   PIC X(57)  VALUE
115800     '734 025704 046       066       PELVIC EVISCERATION, RAD H'.
115900         05  FILLER   PIC X(57)  VALUE
116000     '735 012265 019       023       PELVIC EVISCERATION, RAD H'.
116100         05  FILLER   PIC X(57)  VALUE
116200     '736 044341 102       127       UTERINE & ADNEXA PROC FOR '.
116300         05  FILLER   PIC X(57)  VALUE
116400     '737 020198 052       061       UTERINE & ADNEXA PROC FOR '.
116500         05  FILLER   PIC X(57)  VALUE
116600     '738 012746 029       034       UTERINE & ADNEXA PROC FOR '.
116700         05  FILLER   PIC X(57)  VALUE
116800     '739 033133 067       093       UTERINE,ADNEXA PROC FOR NO'.
116900         05  FILLER   PIC X(57)  VALUE
117000     '740 016069 032       041       UTERINE,ADNEXA PROC FOR NO'.
117100         05  FILLER   PIC X(57)  VALUE
117200     '741 011846 018       021       UTERINE,ADNEXA PROC FOR NO'.
117300         05  FILLER   PIC X(57)  VALUE
117400     '742 015436 031       041       UTERINE & ADNEXA PROC FOR '.
117500         05  FILLER   PIC X(57)  VALUE
117600     '743 009954 018       020       UTERINE & ADNEXA PROC FOR '.
117700         05  FILLER   PIC X(57)  VALUE
117800     '744 017484 043       060       D&C, CONIZATION, LAPAROSCO'.
117900         05  FILLER   PIC X(57)  VALUE
118000     '745 009553 020       024       D&C, CONIZATION, LAPAROSCO'.
118100         05  FILLER   PIC X(57)  VALUE
118200     '746 014219 033       047       VAGINA, CERVIX & VULVA PRO'.
118300         05  FILLER   PIC X(57)  VALUE
118400     '747 008892 016       019       VAGINA, CERVIX & VULVA PRO'.
118500         05  FILLER   PIC X(57)  VALUE
118600     '748 010845 016       020       FEMALE REPRODUCTIVE SYSTEM'.
118700         05  FILLER   PIC X(57)  VALUE
118800     '749 025541 061       083       OTHER FEMALE REPRODUCTIVE '.
118900         05  FILLER   PIC X(57)  VALUE
119000     '750 011904 023       028       OTHER FEMALE REPRODUCTIVE '.
119100         05  FILLER   PIC X(57)  VALUE
119200     '754 019626 059       083       MALIGNANCY, FEMALE REPRODU'.
119300         05  FILLER   PIC X(57)  VALUE
119400     '755 011066 037       049       MALIGNANCY, FEMALE REPRODU'.
119500         05  FILLER   PIC X(57)  VALUE
119600     '756 006652 022       030       MALIGNANCY, FEMALE REPRODU'.
119700         05  FILLER   PIC X(57)  VALUE
119800     '757 015397 057       072       INFECTIONS, FEMALE REPRODU'.
119900         05  FILLER   PIC X(57)  VALUE
120000     '758 010518 043       053       INFECTIONS, FEMALE REPRODU'.
120100         05  FILLER   PIC X(57)  VALUE
120200     '759 006931 031       038       INFECTIONS, FEMALE REPRODU'.
120300         05  FILLER   PIC X(57)  VALUE
120400     '760 008399 027       036       MENSTRUAL & OTHER FEMALE R'.
120500         05  FILLER   PIC X(57)  VALUE
120600     '761 004988 018       022       MENSTRUAL & OTHER FEMALE R'.
120700         05  FILLER   PIC X(57)  VALUE
120800     '765 010924 038       047       CESAREAN SECTION W CC/MCC '.
120900         05  FILLER   PIC X(57)  VALUE
121000     '766 007562 029       031       CESAREAN SECTION W/O CC/MC'.
121100         05  FILLER   PIC X(57)  VALUE
121200     '767 008513 024       029       VAGINAL DELIVERY W STERILI'.
121300         05  FILLER   PIC X(57)  VALUE
121400     '768 011184 047       058       VAGINAL DELIVERY W O.R. PR'.
121500         05  FILLER   PIC X(57)  VALUE
121600     '769 018930 036       058       POSTPARTUM & POST ABORTION'.
121700         05  FILLER   PIC X(57)  VALUE
121800     '770 008029 016       022       ABORTION W D&C, ASPIRATION'.
121900         05  FILLER   PIC X(57)  VALUE
122000     '774 007168 026       031       VAGINAL DELIVERY W COMPLIC'.
122100         05  FILLER   PIC X(57)  VALUE
122200     '775 005643 021       023       VAGINAL DELIVERY W/O COMPL'.
122300         05  FILLER   PIC X(57)  VALUE
122400     '776 008117 027       036       POSTPARTUM & POST ABORTION'.
122500         05  FILLER   PIC X(57)  VALUE
122600     '777 010145 018       022       ECTOPIC PREGNANCY         '.
122700         05  FILLER   PIC X(57)  VALUE
122800     '778 005638 021       033       THREATENED ABORTION       '.
122900         05  FILLER   PIC X(57)  VALUE
123000     '779 006389 015       020       ABORTION W/O D&C          '.
123100         05  FILLER   PIC X(57)  VALUE
123200     '780 002880 012       014       FALSE LABOR               '.
123300         05  FILLER   PIC X(57)  VALUE
123400     '781 007546 027       040       OTHER ANTEPARTUM DIAGNOSES'.
123500         05  FILLER   PIC X(57)  VALUE
123600     '782 004057 017       023       OTHER ANTEPARTUM DIAGNOSES'.
123700         05  FILLER   PIC X(57)  VALUE
123800     '789 015547 018       018       NEONATES, DIED OR TRANSFER'.
123900         05  FILLER   PIC X(57)  VALUE
124000     '790 051268 179       179       EXTREME IMMATURITY OR RESP'.
124100         05  FILLER   PIC X(57)  VALUE
124200     '791 035015 133       133       PREMATURITY W MAJOR PROBLE'.
124300         05  FILLER   PIC X(57)  VALUE
124400     '792 021127 086       086       PREMATURITY W/O MAJOR PROB'.
124500         05  FILLER   PIC X(57)  VALUE
124600     '793 035968 047       047       FULL TERM NEONATE W MAJOR '.
124700         05  FILLER   PIC X(57)  VALUE
124800     '794 012731 034       034       NEONATE W OTHER SIGNIFICAN'.
124900         05  FILLER   PIC X(57)  VALUE
125000     '795 001724 031       031       NORMAL NEWBORN            '.
125100         05  FILLER   PIC X(57)  VALUE
125200     '799 050131 095       122       SPLENECTOMY W MCC         '.
125300         05  FILLER   PIC X(57)  VALUE
125400     '800 026403 056       071       SPLENECTOMY W CC          '.
125500         05  FILLER   PIC X(57)  VALUE
125600     '801 015477 029       035       SPLENECTOMY W/O CC/MCC    '.
125700         05  FILLER   PIC X(57)  VALUE
125800     '802 033601 078       106       OTHER O.R. PROC OF THE BLO'.
125900         05  FILLER   PIC X(57)  VALUE
126000     '803 018440 045       060       OTHER O.R. PROC OF THE BLO'.
126100         05  FILLER   PIC X(57)  VALUE
126200     '804 012265 025       032       OTHER O.R. PROC OF THE BLO'.
126300         05  FILLER   PIC X(57)  VALUE
126400     '808 022260 061       080       MAJOR HEMATOL/IMMUN DIAG E'.
126500         05  FILLER   PIC X(57)  VALUE
126600     '809 012037 038       048       MAJOR HEMATOL/IMMUN DIAG E'.
126700         05  FILLER   PIC X(57)  VALUE
126800     '810 008409 026       033       MAJOR HEMATOL/IMMUN DIAG E'.
126900         05  FILLER   PIC X(57)  VALUE
127000     '811 012829 036       049       RED BLOOD CELL DISORDERS W'.
127100         05  FILLER   PIC X(57)  VALUE
127200     '812 008162 026       034       RED BLOOD CELL DISORDERS W'.
127300         05  FILLER   PIC X(57)  VALUE
127400     '813 016534 036       050       COAGULATION DISORDERS     '.
127500         05  FILLER   PIC X(57)  VALUE
127600     '814 017048 050       069       RETICULOENDOTHELIAL & IMMU'.
127700         05  FILLER   PIC X(57)  VALUE
127800     '815 009948 034       043       RETICULOENDOTHELIAL & IMMU'.
127900         05  FILLER   PIC X(57)  VALUE
128000     '816 006882 024       029       RETICULOENDOTHELIAL & IMMU'.
128100         05  FILLER   PIC X(57)  VALUE
128200     '820 055226 118       156       LYMPHOMA & LEUKEMIA W MAJO'.
128300         05  FILLER   PIC X(57)  VALUE
128400     '821 023064 046       064       LYMPHOMA & LEUKEMIA W MAJO'.
128500         05  FILLER   PIC X(57)  VALUE
128600     '822 012805 022       028       LYMPHOMA & LEUKEMIA W MAJO'.
128700         05  FILLER   PIC X(57)  VALUE
128800     '823 044622 115       147       LYMPHOMA & NON-ACUTE LEUKE'.
128900         05  FILLER   PIC X(57)  VALUE
129000     '824 022951 060       078       LYMPHOMA & NON-ACUTE LEUKE'.
129100         05  FILLER   PIC X(57)  VALUE
129200     '825 013803 030       040       LYMPHOMA & NON-ACUTE LEUKE'.
129300         05  FILLER   PIC X(57)  VALUE
129400     '826 050900 105       139       MYELOPROLIF DISORD OR POOR'.
129500         05  FILLER   PIC X(57)  VALUE
129600     '827 023214 052       067       MYELOPROLIF DISORD OR POOR'.
129700         05  FILLER   PIC X(57)  VALUE
129800     '828 015321 028       035       MYELOPROLIF DISORD OR POOR'.
129900         05  FILLER   PIC X(57)  VALUE
130000     '829 034231 070       106       MYELOPROLIF DISORD OR POOR'.
130100         05  FILLER   PIC X(57)  VALUE
130200     '830 012523 024       031       MYELOPROLIF DISORD OR POOR'.
130300         05  FILLER   PIC X(57)  VALUE
130400     '834 052735 102       166       ACUTE LEUKEMIA W/O MAJOR O'.
130500         05  FILLER   PIC X(57)  VALUE
130600     '835 021042 047       076       ACUTE LEUKEMIA W/O MAJOR O'.
130700         05  FILLER   PIC X(57)  VALUE
130800     '836 011693 028       040       ACUTE LEUKEMIA W/O MAJOR O'.
130900         05  FILLER   PIC X(57)  VALUE
131000     '837 064631 165       224       CHEMO W ACUTE LEUKEMIA AS '.
131100         05  FILLER   PIC X(57)  VALUE
131200     '838 027923 069       099       CHEMO W ACUTE LEUKEMIA AS '.
131300         05  FILLER   PIC X(57)  VALUE
131400     '839 012525 049       057       CHEMO W ACUTE LEUKEMIA AS '.
131500         05  FILLER   PIC X(57)  VALUE
131600     '840 031058 077       106  Y    LYMPHOMA & NON-ACUTE LEUKE'.
131700         05  FILLER   PIC X(57)  VALUE
131800     '841 016226 047       062  Y    LYMPHOMA & NON-ACUTE LEUKE'.
131900         05  FILLER   PIC X(57)  VALUE
132000     '842 010777 030       039  Y    LYMPHOMA & NON-ACUTE LEUKE'.
132100         05  FILLER   PIC X(57)  VALUE
132200     '843 017902 055       074       OTHER MYELOPROLIF DIS OR P'.
132300         05  FILLER   PIC X(57)  VALUE
132400     '844 012058 041       054       OTHER MYELOPROLIF DIS OR P'.
132500         05  FILLER   PIC X(57)  VALUE
132600     '845 008551 030       039       OTHER MYELOPROLIF DIS OR P'.
132700         05  FILLER   PIC X(57)  VALUE
132800     '846 023264 058       080       CHEMOTHERAPY W/O ACUTE LEU'.
132900         05  FILLER   PIC X(57)  VALUE
133000     '847 011569 031       037       CHEMOTHERAPY W/O ACUTE LEU'.
133100         05  FILLER   PIC X(57)  VALUE
133200     '848 008454 025       030       CHEMOTHERAPY W/O ACUTE LEU'.
133300         05  FILLER   PIC X(57)  VALUE
133400     '849 014657 046       059       RADIOTHERAPY              '.
133500         05  FILLER   PIC X(57)  VALUE
133600     '853 052068 108       139  Y    INFECTIOUS & PARASITIC DIS'.
133700         05  FILLER   PIC X(57)  VALUE
133800     '854 023877 067       081  Y    INFECTIOUS & PARASITIC DIS'.
133900         05  FILLER   PIC X(57)  VALUE
134000     '855 017057 034       048  Y    INFECTIOUS & PARASITIC DIS'.
134100         05  FILLER   PIC X(57)  VALUE
134200     '856 048177 100       134  Y    POSTOPERATIVE OR POST-TRAU'.
134300         05  FILLER   PIC X(57)  VALUE
134400     '857 020500 057       070  Y    POSTOPERATIVE OR POST-TRAU'.
134500         05  FILLER   PIC X(57)  VALUE
134600     '858 013390 038       047  Y    POSTOPERATIVE OR POST-TRAU'.
134700         05  FILLER   PIC X(57)  VALUE
134800     '862 018506 055       072  Y    POSTOPERATIVE & POST-TRAUM'.
134900         05  FILLER   PIC X(57)  VALUE
135000     '863 009836 037       045  Y    POSTOPERATIVE & POST-TRAUM'.
135100         05  FILLER   PIC X(57)  VALUE
135200     '864 008419 029       036       FEVER                     '.
135300         05  FILLER   PIC X(57)  VALUE
135400     '865 015131 043       059       VIRAL ILLNESS W MCC       '.
135500         05  FILLER   PIC X(57)  VALUE
135600     '866 007425 028       034       VIRAL ILLNESS W/O MCC     '.
135700         05  FILLER   PIC X(57)  VALUE
135800     '867 027245 070       095  Y    OTHER INFECTIOUS & PARASIT'.
135900         05  FILLER   PIC X(57)  VALUE
136000     '868 010897 039       049  Y    OTHER INFECTIOUS & PARASIT'.
136100         05  FILLER   PIC X(57)  VALUE
136200     '869 006877 027       033  Y    OTHER INFECTIOUS & PARASIT'.
136300         05  FILLER   PIC X(57)  VALUE
136400     '870 058698 126       147  Y    SEPTICEMIA OR SEVERE SEPSI'.
136500         05  FILLER   PIC X(57)  VALUE
136600     '871 018072 051       066  Y    SEPTICEMIA OR SEVERE SEPSI'.
136700         05  FILLER   PIC X(57)  VALUE
136800     '872 010528 040       047  Y    SEPTICEMIA OR SEVERE SEPSI'.
136900         05  FILLER   PIC X(57)  VALUE
137000     '876 033533 074       147       O.R. PROCEDURE W PRINCIPAL'.
137100         05  FILLER   PIC X(57)  VALUE
137200     '880 006704 023       031       ACUTE ADJUSTMENT REACTION '.
137300         05  FILLER   PIC X(57)  VALUE
137400     '881 006464 033       044       DEPRESSIVE NEUROSES       '.
137500         05  FILLER   PIC X(57)  VALUE
137600     '882 006935 033       045       NEUROSES EXCEPT DEPRESSIVE'.
137700         05  FILLER   PIC X(57)  VALUE
137800     '883 013062 043       078       DISORDERS OF PERSONALITY &'.
137900         05  FILLER   PIC X(57)  VALUE
138000     '884 010783 041       059  Y    ORGANIC DISTURBANCES & MEN'.
138100         05  FILLER   PIC X(57)  VALUE
138200     '885 010217 054       074       PSYCHOSES                 '.
138300         05  FILLER   PIC X(57)  VALUE
138400     '886 008288 039       062       BEHAVIORAL & DEVELOPMENTAL'.
138500         05  FILLER   PIC X(57)  VALUE
138600     '887 009329 030       045       OTHER MENTAL DISORDER DIAG'.
138700         05  FILLER   PIC X(57)  VALUE
138800     '894 004450 021       030       ALCOHOL/DRUG ABUSE OR DEPE'.
138900         05  FILLER   PIC X(57)  VALUE
139000     '895 012152 096       123       ALCOHOL/DRUG ABUSE OR DEPE'.
139100         05  FILLER   PIC X(57)  VALUE
139200     '896 015244 048       065  Y    ALCOHOL/DRUG ABUSE OR DEPE'.
139300         05  FILLER   PIC X(57)  VALUE
139400     '897 006905 032       040  Y    ALCOHOL/DRUG ABUSE OR DEPE'.
139500         05  FILLER   PIC X(57)  VALUE
139600     '901 039929 090       132       WOUND DEBRIDEMENTS FOR INJ'.
139700         05  FILLER   PIC X(57)  VALUE
139800     '902 017433 051       070       WOUND DEBRIDEMENTS FOR INJ'.
139900         05  FILLER   PIC X(57)  VALUE
140000     '903 011280 033       044       WOUND DEBRIDEMENTS FOR INJ'.
140100         05  FILLER   PIC X(57)  VALUE
140200     '904 033637 073       107       SKIN GRAFTS FOR INJURIES W'.
140300         05  FILLER   PIC X(57)  VALUE
140400     '905 013889 036       046       SKIN GRAFTS FOR INJURIES W'.
140500         05  FILLER   PIC X(57)  VALUE
140600     '906 011789 023       033       HAND PROCEDURES FOR INJURI'.
140700         05  FILLER   PIC X(57)  VALUE
140800     '907 037872 074       102  Y    OTHER O.R. PROCEDURES FOR '.
140900         05  FILLER   PIC X(57)  VALUE
141000     '908 019575 043       057  Y    OTHER O.R. PROCEDURES FOR '.
141100         05  FILLER   PIC X(57)  VALUE
141200     '909 012556 026       033  Y    OTHER O.R. PROCEDURES FOR '.
141300         05  FILLER   PIC X(57)  VALUE
141400     '913 011410 034       047       TRAUMATIC INJURY W MCC    '.
141500         05  FILLER   PIC X(57)  VALUE
141600     '914 007009 024       030       TRAUMATIC INJURY W/O MCC  '.
141700         05  FILLER   PIC X(57)  VALUE
141800     '915 015381 037       050       ALLERGIC REACTIONS W MCC  '.
141900         05  FILLER   PIC X(57)  VALUE
142000     '916 005137 017       021       ALLERGIC REACTIONS W/O MCC'.
142100         05  FILLER   PIC X(57)  VALUE
142200     '917 014051 035       048  Y    POISONING & TOXIC EFFECTS '.
142300         05  FILLER   PIC X(57)  VALUE
142400     '918 006412 021       028  Y    POISONING & TOXIC EFFECTS '.
142500         05  FILLER   PIC X(57)  VALUE
142600     '919 016750 044       060       COMPLICATIONS OF TREATMENT'.
142700         05  FILLER   PIC X(57)  VALUE
142800     '920 009850 030       040       COMPLICATIONS OF TREATMENT'.
142900         05  FILLER   PIC X(57)  VALUE
143000     '921 006602 022       028       COMPLICATIONS OF TREATMENT'.
143100         05  FILLER   PIC X(57)  VALUE
143200     '922 014953 039       057       OTHER INJURY, POISONING & '.
143300         05  FILLER   PIC X(57)  VALUE
143400     '923 007348 023       033       OTHER INJURY, POISONING & '.
143500         05  FILLER   PIC X(57)  VALUE
143600     '927 155499 229       289       EXTENSIVE BURNS OR FULL TH'.
143700         05  FILLER   PIC X(57)  VALUE
143800     '928 053820 111       150       FULL THICKNESS BURN W SKIN'.
143900         05  FILLER   PIC X(57)  VALUE
144000     '929 023344 057       073       FULL THICKNESS BURN W SKIN'.
144100         05  FILLER   PIC X(57)  VALUE
144200     '933 027557 024       056       EXTENSIVE BURNS OR FULL TH'.
144300         05  FILLER   PIC X(57)  VALUE
144400     '934 015748 041       058       FULL THICKNESS BURN W/O SK'.
144500         05  FILLER   PIC X(57)  VALUE
144600     '935 014717 033       050       NON-EXTENSIVE BURNS       '.
144700         05  FILLER   PIC X(57)  VALUE
144800     '939 027647 062       089       O.R. PROC W DIAGNOSES OF O'.
144900         05  FILLER   PIC X(57)  VALUE
145000     '940 018274 037       053       O.R. PROC W DIAGNOSES OF O'.
145100         05  FILLER   PIC X(57)  VALUE
145200     '941 013531 022       029       O.R. PROC W DIAGNOSES OF O'.
145300         05  FILLER   PIC X(57)  VALUE
145400     '945 012709 086       104  Y    REHABILITATION W CC/MCC   '.
145500         05  FILLER   PIC X(57)  VALUE
145600     '946 010662 066       076  Y    REHABILITATION W/O CC/MCC '.
145700         05  FILLER   PIC X(57)  VALUE
145800     '947 011368 036       048  Y    SIGNS & SYMPTOMS W MCC    '.
145900         05  FILLER   PIC X(57)  VALUE
146000     '948 007131 026       033  Y    SIGNS & SYMPTOMS W/O MCC  '.
146100         05  FILLER   PIC X(57)  VALUE
146200     '949 010525 031       045       AFTERCARE W CC/MCC        '.
146300         05  FILLER   PIC X(57)  VALUE
146400     '950 005508 024       033       AFTERCARE W/O CC/MCC      '.
146500         05  FILLER   PIC X(57)  VALUE
146600     '951 009188 025       054       OTHER FACTORS INFLUENCING '.
146700         05  FILLER   PIC X(57)  VALUE
146800     '955 055727 080       116       CRANIOTOMY FOR MULTIPLE SI'.
146900         05  FILLER   PIC X(57)  VALUE
147000     '956 036692 066       080  Y    LIMB REATTACHMENT, HIP & F'.
147100         05  FILLER   PIC X(57)  VALUE
147200     '957 068453 099       140       OTHER O.R. PROCEDURES FOR '.
147300         05  FILLER   PIC X(57)  VALUE
147400     '958 038602 072       088       OTHER O.R. PROCEDURES FOR '.
147500         05  FILLER   PIC X(57)  VALUE
147600     '959 025447 046       057       OTHER O.R. PROCEDURES FOR '.
147700         05  FILLER   PIC X(57)  VALUE
147800     '963 027071 055       082       OTHER MULTIPLE SIGNIFICANT'.
147900         05  FILLER   PIC X(57)  VALUE
148000     '964 014769 042       052       OTHER MULTIPLE SIGNIFICANT'.
148100         05  FILLER   PIC X(57)  VALUE
148200     '965 009418 029       036       OTHER MULTIPLE SIGNIFICANT'.
148300         05  FILLER   PIC X(57)  VALUE
148400     '969 060815 123       170       HIV W EXTENSIVE O.R. PROCE'.
148500         05  FILLER   PIC X(57)  VALUE
148600     '970 022085 055       072       HIV W EXTENSIVE O.R. PROCE'.
148700         05  FILLER   PIC X(57)  VALUE
148800     '974 026849 067       093       HIV W MAJOR RELATED CONDIT'.
148900         05  FILLER   PIC X(57)  VALUE
149000     '975 013047 045       058       HIV W MAJOR RELATED CONDIT'.
149100         05  FILLER   PIC X(57)  VALUE
149200     '976 008774 032       039       HIV W MAJOR RELATED CONDIT'.
149300         05  FILLER   PIC X(57)  VALUE
149400     '977 011305 035       047       HIV W OR W/O OTHER RELATED'.
149500         05  FILLER   PIC X(57)  VALUE
149600     '981 049968 100       131  Y    EXTENSIVE O.R. PROCEDURE U'.
149700         05  FILLER   PIC X(57)  VALUE
149800     '982 028150 058       074  Y    EXTENSIVE O.R. PROCEDURE U'.
149900         05  FILLER   PIC X(57)  VALUE
150000     '983 018039 028       037  Y    EXTENSIVE O.R. PROCEDURE U'.
150100         05  FILLER   PIC X(57)  VALUE
150200     '984 034344 096       130       PROSTATIC O.R. PROCEDURE U'.
150300         05  FILLER   PIC X(57)  VALUE
150400     '985 018509 051       069       PROSTATIC O.R. PROCEDURE U'.
150500         05  FILLER   PIC X(57)  VALUE
150600     '986 010453 025       034       PROSTATIC O.R. PROCEDURE U'.
150700         05  FILLER   PIC X(57)  VALUE
150800     '987 033008 084       111  Y    NON-EXTENSIVE O.R. PROC UN'.
150900         05  FILLER   PIC X(57)  VALUE
151000     '988 017643 048       064  Y    NON-EXTENSIVE O.R. PROC UN'.
151100         05  FILLER   PIC X(57)  VALUE
151200     '989 010454 023       031  Y    NON-EXTENSIVE O.R. PROC UN'.
151300         05  FILLER   PIC X(57)  VALUE
151400     '998 000000 000       000       PRINCIPAL DIAGNOSIS INVALI'.
151500         05  FILLER   PIC X(57)  VALUE
151600     '999 000000 000       000       UNGROUPABLE               '.
151700     02  WK-DRG-DATA2 REDEFINES WK-DRG-DATA.
151800         05  DRG-TAB OCCURS 753
151900                     ASCENDING KEY IS WK-DRG-DRGX
152000                     INDEXED BY DRG-IDX.
152100             10  DRG-DATA-TAB.
152200               15  WK-DRG-DRGX               PIC X(03).
152300               15  FILLER1                   PIC X(01).
152400               15  DRG-WEIGHT                PIC 9(02)V9(04).
152500               15  FILLER2                   PIC X(01).
152600               15  DRG-GMALOS                PIC 9(02)V9(01).
152700               15  FILLER3                   PIC X(05).
152800               15  DRG-LOW                   PIC X(01).
152900               15  FILLER5                   PIC X(01).
153000               15  DRG-ARITH-ALOS            PIC 9(02)V9(01).
153100               15  FILLER6                   PIC X(02).
153200               15  DRG-PAC                   PIC X(01).
153300               15  FILLER7                   PIC X(01).
153400               15  DRG-SPPAC                 PIC X(01).
153500               15  FILLER8                   PIC X(02).
153600               15  DRG-DESC                  PIC X(26).
