000100***************************************************************
000200*  TABLE 5 FROM ANNUAL IPPS FINAL RULE
000300*  COPIED FROM D29L.@BFN2699.INPATCOB.COBR140(PPCAL140)
000400***************************************************************
000500 01  WK-DRGX-EFF-DATE      PIC X(08) VALUE '20131001'.
000600 01  PPS-DRG-TABLE.
000700     02  WK-DRG-DATA.
000800****** 08/01/2013 **********
000900         05  FILLER   PIC X(57)  VALUE
001000     '001 253518 283       359       HEART TRANSPLANT OR IMPLAN'.
001100         05  FILLER   PIC X(57)  VALUE
001200     '002 152738 159       186       HEART TRANSPLANT OR IMPLAN'.
001300         05  FILLER   PIC X(57)  VALUE
001400     '003 176369 272       332  Y    ECMO OR TRACH W MV 96+ HRS'.
001500         05  FILLER   PIC X(57)  VALUE
001600     '004 109288 203       247  Y    TRACH W MV 96+ HRS OR PDX '.
001700         05  FILLER   PIC X(57)  VALUE
001800     '005 104214 151       201       LIVER TRANSPLANT W MCC OR '.
001900         05  FILLER   PIC X(57)  VALUE
002000     '006 047639 079       090       LIVER TRANSPLANT W/O MCC  '.
002100         05  FILLER   PIC X(57)  VALUE
002200     '007 091929 154       179       LUNG TRANSPLANT           '.
002300         05  FILLER   PIC X(57)  VALUE
002400     '008 051527 095       110       SIMULTANEOUS PANCREAS/KIDN'.
002500         05  FILLER   PIC X(57)  VALUE
002600     '010 041554 088       103       PANCREAS TRANSPLANT       '.
002700         05  FILLER   PIC X(57)  VALUE
002800     '011 047246 114       140       TRACHEOSTOMY FOR FACE,MOUT'.
002900         05  FILLER   PIC X(57)  VALUE
003000     '012 032291 083       098       TRACHEOSTOMY FOR FACE,MOUT'.
003100         05  FILLER   PIC X(57)  VALUE
003200     '013 021647 057       065       TRACHEOSTOMY FOR FACE,MOUT'.
003300         05  FILLER   PIC X(57)  VALUE
003400     '014 106157 207       262       ALLOGENEIC BONE MARROW TRA'.
003500         05  FILLER   PIC X(57)  VALUE
003600     '016 060304 181       195       AUTOLOGOUS BONE MARROW TRA'.
003700         05  FILLER   PIC X(57)  VALUE
003800     '017 042906 099       132       AUTOLOGOUS BONE MARROW TRA'.
003900         05  FILLER   PIC X(57)  VALUE
004000     '020 093897 143       174       INTRACRANIAL VASCULAR PROC'.
004100         05  FILLER   PIC X(57)  VALUE
004200     '021 064458 119       134       INTRACRANIAL VASCULAR PROC'.
004300         05  FILLER   PIC X(57)  VALUE
004400     '022 047113 055       073       INTRACRANIAL VASCULAR PROC'.
004500         05  FILLER   PIC X(57)  VALUE
004600     '023 051587 080       112  Y    CRANIO W MAJOR DEV IMPL/AC'.
004700         05  FILLER   PIC X(57)  VALUE
004800     '024 037121 045       066  Y    CRANIO W MAJOR DEV IMPL/AC'.
004900         05  FILLER   PIC X(57)  VALUE
005000     '025 044422 078       101  Y    CRANIOTOMY & ENDOVASCULAR '.
005100         05  FILLER   PIC X(57)  VALUE
005200     '026 029842 050       065  Y    CRANIOTOMY & ENDOVASCULAR '.
005300         05  FILLER   PIC X(57)  VALUE
005400     '027 022505 026       034  Y    CRANIOTOMY & ENDOVASCULAR '.
005500         05  FILLER   PIC X(57)  VALUE
005600     '028 054339 096       123  Y Y  SPINAL PROCEDURES W MCC   '.
005700         05  FILLER   PIC X(57)  VALUE
005800     '029 030782 046       062  Y Y  SPINAL PROCEDURES W CC OR '.
005900         05  FILLER   PIC X(57)  VALUE
006000     '030 018091 025       033  Y Y  SPINAL PROCEDURES W/O CC/M'.
006100         05  FILLER   PIC X(57)  VALUE
006200     '031 039460 077       110  Y    VENTRICULAR SHUNT PROCEDUR'.
006300         05  FILLER   PIC X(57)  VALUE
006400     '032 019780 034       049  Y    VENTRICULAR SHUNT PROCEDUR'.
006500         05  FILLER   PIC X(57)  VALUE
006600     '033 015226 020       025  Y    VENTRICULAR SHUNT PROCEDUR'.
006700         05  FILLER   PIC X(57)  VALUE
006800     '034 034145 047       069       CAROTID ARTERY STENT PROCE'.
006900         05  FILLER   PIC X(57)  VALUE
007000     '035 021781 021       031       CAROTID ARTERY STENT PROCE'.
007100         05  FILLER   PIC X(57)  VALUE
007200     '036 017224 013       015       CAROTID ARTERY STENT PROCE'.
007300         05  FILLER   PIC X(57)  VALUE
007400     '037 030641 055       079       EXTRACRANIAL PROCEDURES W '.
007500         05  FILLER   PIC X(57)  VALUE
007600     '038 015958 024       035       EXTRACRANIAL PROCEDURES W '.
007700         05  FILLER   PIC X(57)  VALUE
007800     '039 010452 014       016       EXTRACRANIAL PROCEDURES W/'.
007900         05  FILLER   PIC X(57)  VALUE
008000     '040 037851 083       110  Y Y  PERIPH/CRANIAL NERVE & OTH'.
008100         05  FILLER   PIC X(57)  VALUE
008200     '041 021731 050       064  Y Y  PERIPH/CRANIAL NERVE & OTH'.
008300         05  FILLER   PIC X(57)  VALUE
008400     '042 018616 026       034  Y Y  PERIPH/CRANIAL NERVE & OTH'.
008500         05  FILLER   PIC X(57)  VALUE
008600     '052 014102 040       053       SPINAL DISORDERS & INJURIE'.
008700         05  FILLER   PIC X(57)  VALUE
008800     '053 008746 027       033       SPINAL DISORDERS & INJURIE'.
008900         05  FILLER   PIC X(57)  VALUE
009000     '054 013195 041       055  Y    NERVOUS SYSTEM NEOPLASMS W'.
009100         05  FILLER   PIC X(57)  VALUE
009200     '055 010100 031       042  Y    NERVOUS SYSTEM NEOPLASMS W'.
009300         05  FILLER   PIC X(57)  VALUE
009400     '056 017368 053       071  Y    DEGENERATIVE NERVOUS SYSTE'.
009500         05  FILLER   PIC X(57)  VALUE
009600     '057 009841 036       047  Y    DEGENERATIVE NERVOUS SYSTE'.
009700         05  FILLER   PIC X(57)  VALUE
009800     '058 016027 054       071       MULTIPLE SCLEROSIS & CEREB'.
009900         05  FILLER   PIC X(57)  VALUE
010000     '059 010399 040       049       MULTIPLE SCLEROSIS & CEREB'.
010100         05  FILLER   PIC X(57)  VALUE
010200     '060 007899 031       037       MULTIPLE SCLEROSIS & CEREB'.
010300         05  FILLER   PIC X(57)  VALUE
010400     '061 027316 058       075       ACUTE ISCHEMIC STROKE W US'.
010500         05  FILLER   PIC X(57)  VALUE
010600     '062 018561 042       049       ACUTE ISCHEMIC STROKE W US'.
010700         05  FILLER   PIC X(57)  VALUE
010800     '063 014685 030       034       ACUTE ISCHEMIC STROKE W US'.
010900         05  FILLER   PIC X(57)  VALUE
011000     '064 017417 047       063  Y    INTRACRANIAL HEMORRHAGE OR'.
011100         05  FILLER   PIC X(57)  VALUE
011200     '065 010776 035       043  Y    INTRACRANIAL HEMORRHAGE OR'.
011300         05  FILLER   PIC X(57)  VALUE
011400     '066 007566 025       029  Y    INTRACRANIAL HEMORRHAGE OR'.
011500         05  FILLER   PIC X(57)  VALUE
011600     '067 014172 041       053       NONSPECIFIC CVA & PRECEREB'.
011700         05  FILLER   PIC X(57)  VALUE
011800     '068 008582 025       031       NONSPECIFIC CVA & PRECEREB'.
011900         05  FILLER   PIC X(57)  VALUE
012000     '069 006948 022       026       TRANSIENT ISCHEMIA        '.
012100         05  FILLER   PIC X(57)  VALUE
012200     '070 016593 049       066  Y    NONSPECIFIC CEREBROVASCULA'.
012300         05  FILLER   PIC X(57)  VALUE
012400     '071 009796 036       046  Y    NONSPECIFIC CEREBROVASCULA'.
012500         05  FILLER   PIC X(57)  VALUE
012600     '072 006919 023       029  Y    NONSPECIFIC CEREBROVASCULA'.
012700         05  FILLER   PIC X(57)  VALUE
012800     '073 013014 039       053       CRANIAL & PERIPHERAL NERVE'.
012900         05  FILLER   PIC X(57)  VALUE
013000     '074 008786 031       039       CRANIAL & PERIPHERAL NERVE'.
013100         05  FILLER   PIC X(57)  VALUE
013200     '075 015918 052       065       VIRAL MENINGITIS W CC/MCC '.
013300         05  FILLER   PIC X(57)  VALUE
013400     '076 008425 032       037       VIRAL MENINGITIS W/O CC/MC'.
013500         05  FILLER   PIC X(57)  VALUE
013600     '077 016290 046       060       HYPERTENSIVE ENCEPHALOPATH'.
013700         05  FILLER   PIC X(57)  VALUE
013800     '078 009467 031       039       HYPERTENSIVE ENCEPHALOPATH'.
013900         05  FILLER   PIC X(57)  VALUE
014000     '079 007118 023       028       HYPERTENSIVE ENCEPHALOPATH'.
014100         05  FILLER   PIC X(57)  VALUE
014200     '080 012252 037       051       NONTRAUMATIC STUPOR & COMA'.
014300         05  FILLER   PIC X(57)  VALUE
014400     '081 007455 026       034       NONTRAUMATIC STUPOR & COMA'.
014500         05  FILLER   PIC X(57)  VALUE
014600     '082 019463 034       057       TRAUMATIC STUPOR & COMA, C'.
014700         05  FILLER   PIC X(57)  VALUE
014800     '083 012643 034       044       TRAUMATIC STUPOR & COMA, C'.
014900         05  FILLER   PIC X(57)  VALUE
015000     '084 008491 021       027       TRAUMATIC STUPOR & COMA, C'.
015100         05  FILLER   PIC X(57)  VALUE
015200     '085 019733 049       067  Y    TRAUMATIC STUPOR & COMA, C'.
015300         05  FILLER   PIC X(57)  VALUE
015400     '086 011105 033       042  Y    TRAUMATIC STUPOR & COMA, C'.
015500         05  FILLER   PIC X(57)  VALUE
015600     '087 007345 022       027  Y    TRAUMATIC STUPOR & COMA, C'.
015700         05  FILLER   PIC X(57)  VALUE
015800     '088 015029 039       051       CONCUSSION W MCC          '.
015900         05  FILLER   PIC X(57)  VALUE
016000     '089 009406 027       033       CONCUSSION W CC           '.
016100         05  FILLER   PIC X(57)  VALUE
016200     '090 007140 019       023       CONCUSSION W/O CC/MCC     '.
016300         05  FILLER   PIC X(57)  VALUE
016400     '091 015851 043       059  Y    OTHER DISORDERS OF NERVOUS'.
016500         05  FILLER   PIC X(57)  VALUE
016600     '092 008918 031       039  Y    OTHER DISORDERS OF NERVOUS'.
016700         05  FILLER   PIC X(57)  VALUE
016800     '093 006614 022       027  Y    OTHER DISORDERS OF NERVOUS'.
016900         05  FILLER   PIC X(57)  VALUE
017000     '094 034974 083       108       BACTERIAL & TUBERCULOUS IN'.
017100         05  FILLER   PIC X(57)  VALUE
017200     '095 022787 062       077       BACTERIAL & TUBERCULOUS IN'.
017300         05  FILLER   PIC X(57)  VALUE
017400     '096 019694 045       054       BACTERIAL & TUBERCULOUS IN'.
017500         05  FILLER   PIC X(57)  VALUE
017600     '097 031963 085       110       NON-BACTERIAL INFECT OF NE'.
017700         05  FILLER   PIC X(57)  VALUE
017800     '098 017657 058       074       NON-BACTERIAL INFECT OF NE'.
017900         05  FILLER   PIC X(57)  VALUE
018000     '099 011835 041       050       NON-BACTERIAL INFECT OF NE'.
018100         05  FILLER   PIC X(57)  VALUE
018200     '100 015185 042       057  Y    SEIZURES W MCC            '.
018300         05  FILLER   PIC X(57)  VALUE
018400     '101 007569 026       033  Y    SEIZURES W/O MCC          '.
018500         05  FILLER   PIC X(57)  VALUE
018600     '102 010430 031       042       HEADACHES W MCC           '.
018700         05  FILLER   PIC X(57)  VALUE
018800     '103 006663 023       029       HEADACHES W/O MCC         '.
018900         05  FILLER   PIC X(57)  VALUE
019000     '113 018998 040       056       ORBITAL PROCEDURES W CC/MC'.
019100         05  FILLER   PIC X(57)  VALUE
019200     '114 010216 023       029       ORBITAL PROCEDURES W/O CC/'.
019300         05  FILLER   PIC X(57)  VALUE
019400     '115 012543 032       043       EXTRAOCULAR PROCEDURES EXC'.
019500         05  FILLER   PIC X(57)  VALUE
019600     '116 014806 032       048       INTRAOCULAR PROCEDURES W C'.
019700         05  FILLER   PIC X(57)  VALUE
019800     '117 008211 018       024       INTRAOCULAR PROCEDURES W/O'.
019900         05  FILLER   PIC X(57)  VALUE
020000     '121 010215 039       048       ACUTE MAJOR EYE INFECTIONS'.
020100         05  FILLER   PIC X(57)  VALUE
020200     '122 006147 029       035       ACUTE MAJOR EYE INFECTIONS'.
020300         05  FILLER   PIC X(57)  VALUE
020400     '123 006963 022       027       NEUROLOGICAL EYE DISORDERS'.
020500         05  FILLER   PIC X(57)  VALUE
020600     '124 011990 037       051       OTHER DISORDERS OF THE EYE'.
020700         05  FILLER   PIC X(57)  VALUE
020800     '125 006812 025       031       OTHER DISORDERS OF THE EYE'.
020900         05  FILLER   PIC X(57)  VALUE
021000     '129 021925 036       051       MAJOR HEAD & NECK PROCEDUR'.
021100         05  FILLER   PIC X(57)  VALUE
021200     '130 012687 021       026       MAJOR HEAD & NECK PROCEDUR'.
021300         05  FILLER   PIC X(57)  VALUE
021400     '131 022038 039       054       CRANIAL/FACIAL PROCEDURES '.
021500         05  FILLER   PIC X(57)  VALUE
021600     '132 012855 020       026       CRANIAL/FACIAL PROCEDURES '.
021700         05  FILLER   PIC X(57)  VALUE
021800     '133 017824 036       053       OTHER EAR, NOSE, MOUTH & T'.
021900         05  FILLER   PIC X(57)  VALUE
022000     '134 009584 018       024       OTHER EAR, NOSE, MOUTH & T'.
022100         05  FILLER   PIC X(57)  VALUE
022200     '135 020110 041       059       SINUS & MASTOID PROCEDURES'.
022300         05  FILLER   PIC X(57)  VALUE
022400     '136 009709 018       024       SINUS & MASTOID PROCEDURES'.
022500         05  FILLER   PIC X(57)  VALUE
022600     '137 013477 037       050       MOUTH PROCEDURES W CC/MCC '.
022700         05  FILLER   PIC X(57)  VALUE
022800     '138 008304 020       025       MOUTH PROCEDURES W/O CC/MC'.
022900         05  FILLER   PIC X(57)  VALUE
023000     '139 009169 015       020       SALIVARY GLAND PROCEDURES '.
023100         05  FILLER   PIC X(57)  VALUE
023200     '146 020402 056       082       EAR, NOSE, MOUTH & THROAT '.
023300         05  FILLER   PIC X(57)  VALUE
023400     '147 012317 039       054       EAR, NOSE, MOUTH & THROAT '.
023500         05  FILLER   PIC X(57)  VALUE
023600     '148 007688 023       030       EAR, NOSE, MOUTH & THROAT '.
023700         05  FILLER   PIC X(57)  VALUE
023800     '149 006184 021       025       DYSEQUILIBRIUM            '.
023900         05  FILLER   PIC X(57)  VALUE
024000     '150 013298 037       049       EPISTAXIS W MCC           '.
024100         05  FILLER   PIC X(57)  VALUE
024200     '151 006557 022       028       EPISTAXIS W/O MCC         '.
024300         05  FILLER   PIC X(57)  VALUE
024400     '152 010042 033       043       OTITIS MEDIA & URI W MCC  '.
024500         05  FILLER   PIC X(57)  VALUE
024600     '153 006439 024       029       OTITIS MEDIA & URI W/O MCC'.
024700         05  FILLER   PIC X(57)  VALUE
024800     '154 013785 041       055       OTHER EAR, NOSE, MOUTH & T'.
024900         05  FILLER   PIC X(57)  VALUE
025000     '155 008610 031       039       OTHER EAR, NOSE, MOUTH & T'.
025100         05  FILLER   PIC X(57)  VALUE
025200     '156 006160 023       028       OTHER EAR, NOSE, MOUTH & T'.
025300         05  FILLER   PIC X(57)  VALUE
025400     '157 015380 045       061       DENTAL & ORAL DISEASES W M'.
025500         05  FILLER   PIC X(57)  VALUE
025600     '158 008525 031       039       DENTAL & ORAL DISEASES W C'.
025700         05  FILLER   PIC X(57)  VALUE
025800     '159 006100 021       026       DENTAL & ORAL DISEASES W/O'.
025900         05  FILLER   PIC X(57)  VALUE
026000     '163 050952 110       134  Y    MAJOR CHEST PROCEDURES W M'.
026100         05  FILLER   PIC X(57)  VALUE
026200     '164 026086 056       067  Y    MAJOR CHEST PROCEDURES W C'.
026300         05  FILLER   PIC X(57)  VALUE
026400     '165 017943 033       040  Y    MAJOR CHEST PROCEDURES W/O'.
026500         05  FILLER   PIC X(57)  VALUE
026600     '166 036741 088       112  Y    OTHER RESP SYSTEM O.R. PRO'.
026700         05  FILLER   PIC X(57)  VALUE
026800     '167 019860 052       066  Y    OTHER RESP SYSTEM O.R. PRO'.
026900         05  FILLER   PIC X(57)  VALUE
027000     '168 013101 030       039  Y    OTHER RESP SYSTEM O.R. PRO'.
027100         05  FILLER   PIC X(57)  VALUE
027200     '175 015346 053       064  Y    PULMONARY EMBOLISM W MCC  '.
027300         05  FILLER   PIC X(57)  VALUE
027400     '176 009891 037       044  Y    PULMONARY EMBOLISM W/O MCC'.
027500         05  FILLER   PIC X(57)  VALUE
027600     '177 019934 064       079  Y    RESPIRATORY INFECTIONS & I'.
027700         05  FILLER   PIC X(57)  VALUE
027800     '178 013955 051       061  Y    RESPIRATORY INFECTIONS & I'.
027900         05  FILLER   PIC X(57)  VALUE
028000     '179 009741 037       045  Y    RESPIRATORY INFECTIONS & I'.
028100         05  FILLER   PIC X(57)  VALUE
028200     '180 017026 054       071       RESPIRATORY NEOPLASMS W MC'.
028300         05  FILLER   PIC X(57)  VALUE
028400     '181 011725 038       050       RESPIRATORY NEOPLASMS W CC'.
028500         05  FILLER   PIC X(57)  VALUE
028600     '182 007905 026       033       RESPIRATORY NEOPLASMS W/O '.
028700         05  FILLER   PIC X(57)  VALUE
028800     '183 014649 048       059       MAJOR CHEST TRAUMA W MCC  '.
028900         05  FILLER   PIC X(57)  VALUE
029000     '184 009832 034       041       MAJOR CHEST TRAUMA W CC   '.
029100         05  FILLER   PIC X(57)  VALUE
029200     '185 006907 025       029       MAJOR CHEST TRAUMA W/O CC/'.
029300         05  FILLER   PIC X(57)  VALUE
029400     '186 015727 049       063  Y    PLEURAL EFFUSION W MCC    '.
029500         05  FILLER   PIC X(57)  VALUE
029600     '187 010808 036       045  Y    PLEURAL EFFUSION W CC     '.
029700         05  FILLER   PIC X(57)  VALUE
029800     '188 007468 026       033  Y    PLEURAL EFFUSION W/O CC/MC'.
029900         05  FILLER   PIC X(57)  VALUE
030000     '189 012184 039       050       PULMONARY EDEMA & RESPIRAT'.
030100         05  FILLER   PIC X(57)  VALUE
030200     '190 011708 042       051  Y    CHRONIC OBSTRUCTIVE PULMON'.
030300         05  FILLER   PIC X(57)  VALUE
030400     '191 009343 035       042  Y    CHRONIC OBSTRUCTIVE PULMON'.
030500         05  FILLER   PIC X(57)  VALUE
030600     '192 007120 028       033  Y    CHRONIC OBSTRUCTIVE PULMON'.
030700         05  FILLER   PIC X(57)  VALUE
030800     '193 014550 050       061  Y    SIMPLE PNEUMONIA & PLEURIS'.
030900         05  FILLER   PIC X(57)  VALUE
031000     '194 009771 038       046  Y    SIMPLE PNEUMONIA & PLEURIS'.
031100         05  FILLER   PIC X(57)  VALUE
031200     '195 006997 029       034  Y    SIMPLE PNEUMONIA & PLEURIS'.
031300         05  FILLER   PIC X(57)  VALUE
031400     '196 016686 054       068  Y    INTERSTITIAL LUNG DISEASE '.
031500         05  FILLER   PIC X(57)  VALUE
031600     '197 010627 038       047  Y    INTERSTITIAL LUNG DISEASE '.
031700         05  FILLER   PIC X(57)  VALUE
031800     '198 007958 029       036  Y    INTERSTITIAL LUNG DISEASE '.
031900         05  FILLER   PIC X(57)  VALUE
032000     '199 018127 059       076       PNEUMOTHORAX W MCC        '.
032100         05  FILLER   PIC X(57)  VALUE
032200     '200 009692 033       043       PNEUMOTHORAX W CC         '.
032300         05  FILLER   PIC X(57)  VALUE
032400     '201 007053 026       033       PNEUMOTHORAX W/O CC/MCC   '.
032500         05  FILLER   PIC X(57)  VALUE
032600     '202 008678 032       039       BRONCHITIS & ASTHMA W CC/M'.
032700         05  FILLER   PIC X(57)  VALUE
032800     '203 006391 025       030       BRONCHITIS & ASTHMA W/O CC'.
032900         05  FILLER   PIC X(57)  VALUE
033000     '204 006780 021       027       RESPIRATORY SIGNS & SYMPTO'.
033100         05  FILLER   PIC X(57)  VALUE
033200     '205 013935 040       054  Y    OTHER RESPIRATORY SYSTEM D'.
033300         05  FILLER   PIC X(57)  VALUE
033400     '206 007911 025       032  Y    OTHER RESPIRATORY SYSTEM D'.
033500         05  FILLER   PIC X(57)  VALUE
033600     '207 052556 121       141  Y    RESPIRATORY SYSTEM DIAGNOS'.
033700         05  FILLER   PIC X(57)  VALUE
033800     '208 022871 050       068       RESPIRATORY SYSTEM DIAGNOS'.
033900         05  FILLER   PIC X(57)  VALUE
034000     '215 147790 100       167       OTHER HEART ASSIST SYSTEM '.
034100         05  FILLER   PIC X(57)  VALUE
034200     '216 094801 131       158  Y Y  CARDIAC VALVE & OTH MAJ CA'.
034300         05  FILLER   PIC X(57)  VALUE
034400     '217 062835 084       097  Y Y  CARDIAC VALVE & OTH MAJ CA'.
034500         05  FILLER   PIC X(57)  VALUE
034600     '218 054262 061       072  Y Y  CARDIAC VALVE & OTH MAJ CA'.
034700         05  FILLER   PIC X(57)  VALUE
034800     '219 079191 100       121  Y Y  CARDIAC VALVE & OTH MAJ CA'.
034900         05  FILLER   PIC X(57)  VALUE
035000     '220 052917 066       073  Y Y  CARDIAC VALVE & OTH MAJ CA'.
035100         05  FILLER   PIC X(57)  VALUE
035200     '221 046424 049       055  Y Y  CARDIAC VALVE & OTH MAJ CA'.
035300         05  FILLER   PIC X(57)  VALUE
035400     '222 088167 096       119       CARDIAC DEFIB IMPLANT W CA'.
035500         05  FILLER   PIC X(57)  VALUE
035600     '223 064257 046       062       CARDIAC DEFIB IMPLANT W CA'.
035700         05  FILLER   PIC X(57)  VALUE
035800     '224 077224 081       100       CARDIAC DEFIB IMPLANT W CA'.
035900         05  FILLER   PIC X(57)  VALUE
036000     '225 059206 041       049       CARDIAC DEFIB IMPLANT W CA'.
036100         05  FILLER   PIC X(57)  VALUE
036200     '226 070099 060       084       CARDIAC DEFIBRILLATOR IMPL'.
036300         05  FILLER   PIC X(57)  VALUE
036400     '227 055397 022       032       CARDIAC DEFIBRILLATOR IMPL'.
036500         05  FILLER   PIC X(57)  VALUE
036600     '228 068682 111       132       OTHER CARDIOTHORACIC PROCE'.
036700         05  FILLER   PIC X(57)  VALUE
036800     '229 044413 069       078       OTHER CARDIOTHORACIC PROCE'.
036900         05  FILLER   PIC X(57)  VALUE
037000     '230 036669 044       051       OTHER CARDIOTHORACIC PROCE'.
037100         05  FILLER   PIC X(57)  VALUE
037200     '231 078158 107       124       CORONARY BYPASS W PTCA W M'.
037300         05  FILLER   PIC X(57)  VALUE
037400     '232 056145 081       089       CORONARY BYPASS W PTCA W/O'.
037500         05  FILLER   PIC X(57)  VALUE
037600     '233 073887 119       134  Y    CORONARY BYPASS W CARDIAC '.
037700         05  FILLER   PIC X(57)  VALUE
037800     '234 048270 080       086  Y    CORONARY BYPASS W CARDIAC '.
037900         05  FILLER   PIC X(57)  VALUE
038000     '235 058478 092       106  Y    CORONARY BYPASS W/O CARDIA'.
038100         05  FILLER   PIC X(57)  VALUE
038200     '236 038011 060       065  Y    CORONARY BYPASS W/O CARDIA'.
038300         05  FILLER   PIC X(57)  VALUE
038400     '237 050962 069       098       MAJOR CARDIOVASC PROCEDURE'.
038500         05  FILLER   PIC X(57)  VALUE
038600     '238 033576 026       038       MAJOR CARDIOVASC PROCEDURE'.
038700         05  FILLER   PIC X(57)  VALUE
038800     '239 048601 109       139  Y    AMPUTATION FOR CIRC SYS DI'.
038900         05  FILLER   PIC X(57)  VALUE
039000     '240 026789 072       088  Y    AMPUTATION FOR CIRC SYS DI'.
039100         05  FILLER   PIC X(57)  VALUE
039200     '241 014226 046       055  Y    AMPUTATION FOR CIRC SYS DI'.
039300         05  FILLER   PIC X(57)  VALUE
039400     '242 037491 059       076  Y    PERMANENT CARDIAC PACEMAKE'.
039500         05  FILLER   PIC X(57)  VALUE
039600     '243 026716 037       046  Y    PERMANENT CARDIAC PACEMAKE'.
039700         05  FILLER   PIC X(57)  VALUE
039800     '244 021608 024       029  Y    PERMANENT CARDIAC PACEMAKE'.
039900         05  FILLER   PIC X(57)  VALUE
040000     '245 047022 033       047       AICD GENERATOR PROCEDURES '.
040100         05  FILLER   PIC X(57)  VALUE
040200     '246 031830 039       052       PERC CARDIOVASC PROC W DRU'.
040300         05  FILLER   PIC X(57)  VALUE
040400     '247 020408 021       025       PERC CARDIOVASC PROC W DRU'.
040500         05  FILLER   PIC X(57)  VALUE
040600     '248 029479 046       062       PERC CARDIOVASC PROC W NON'.
040700         05  FILLER   PIC X(57)  VALUE
040800     '249 018245 024       030       PERC CARDIOVASC PROC W NON'.
040900         05  FILLER   PIC X(57)  VALUE
041000     '250 029881 051       070       PERC CARDIOVASC PROC W/O C'.
041100         05  FILLER   PIC X(57)  VALUE
041200     '251 019737 024       031       PERC CARDIOVASC PROC W/O C'.
041300         05  FILLER   PIC X(57)  VALUE
041400     '252 031477 053       077       OTHER VASCULAR PROCEDURES '.
041500         05  FILLER   PIC X(57)  VALUE
041600     '253 025172 041       055       OTHER VASCULAR PROCEDURES '.
041700         05  FILLER   PIC X(57)  VALUE
041800     '254 017012 022       029       OTHER VASCULAR PROCEDURES '.
041900         05  FILLER   PIC X(57)  VALUE
042000     '255 026404 068       088  Y    UPPER LIMB & TOE AMPUTATIO'.
042100         05  FILLER   PIC X(57)  VALUE
042200     '256 015973 053       065  Y    UPPER LIMB & TOE AMPUTATIO'.
042300         05  FILLER   PIC X(57)  VALUE
042400     '257 009017 030       037  Y    UPPER LIMB & TOE AMPUTATIO'.
042500         05  FILLER   PIC X(57)  VALUE
042600     '258 027229 049       062       CARDIAC PACEMAKER DEVICE R'.
042700         05  FILLER   PIC X(57)  VALUE
042800     '259 019462 027       034       CARDIAC PACEMAKER DEVICE R'.
042900         05  FILLER   PIC X(57)  VALUE
043000     '260 037238 077       105       CARDIAC PACEMAKER REVISION'.
043100         05  FILLER   PIC X(57)  VALUE
043200     '261 017284 032       043       CARDIAC PACEMAKER REVISION'.
043300         05  FILLER   PIC X(57)  VALUE
043400     '262 013866 023       029       CARDIAC PACEMAKER REVISION'.
043500         05  FILLER   PIC X(57)  VALUE
043600     '263 018888 036       052       VEIN LIGATION & STRIPPING '.
043700         05  FILLER   PIC X(57)  VALUE
043800     '264 027138 056       082  Y    OTHER CIRCULATORY SYSTEM O'.
043900         05  FILLER   PIC X(57)  VALUE
044000     '265 026890 025       036       AICD LEAD PROCEDURES      '.
044100         05  FILLER   PIC X(57)  VALUE
044200     '280 017431 047       060  Y    ACUTE MYOCARDIAL INFARCTIO'.
044300         05  FILLER   PIC X(57)  VALUE
044400     '281 010568 031       038  Y    ACUTE MYOCARDIAL INFARCTIO'.
044500         05  FILLER   PIC X(57)  VALUE
044600     '282 007551 021       025  Y    ACUTE MYOCARDIAL INFARCTIO'.
044700         05  FILLER   PIC X(57)  VALUE
044800     '283 016885 030       047       ACUTE MYOCARDIAL INFARCTIO'.
044900         05  FILLER   PIC X(57)  VALUE
045000     '284 007614 018       025       ACUTE MYOCARDIAL INFARCTIO'.
045100         05  FILLER   PIC X(57)  VALUE
045200     '285 005227 014       017       ACUTE MYOCARDIAL INFARCTIO'.
045300         05  FILLER   PIC X(57)  VALUE
045400     '286 021058 049       067       CIRCULATORY DISORDERS EXCE'.
045500         05  FILLER   PIC X(57)  VALUE
045600     '287 010866 024       031       CIRCULATORY DISORDERS EXCE'.
045700         05  FILLER   PIC X(57)  VALUE
045800     '288 027956 078       099  Y    ACUTE & SUBACUTE ENDOCARDI'.
045900         05  FILLER   PIC X(57)  VALUE
046000     '289 017891 057       070  Y    ACUTE & SUBACUTE ENDOCARDI'.
046100         05  FILLER   PIC X(57)  VALUE
046200     '290 012359 039       048  Y    ACUTE & SUBACUTE ENDOCARDI'.
046300         05  FILLER   PIC X(57)  VALUE
046400     '291 015031 046       059  Y    HEART FAILURE & SHOCK W MC'.
046500         05  FILLER   PIC X(57)  VALUE
046600     '292 009938 037       045  Y    HEART FAILURE & SHOCK W CC'.
046700         05  FILLER   PIC X(57)  VALUE
046800     '293 006723 026       031  Y    HEART FAILURE & SHOCK W/O '.
046900         05  FILLER   PIC X(57)  VALUE
047000     '294 009439 040       049       DEEP VEIN THROMBOPHLEBITIS'.
047100         05  FILLER   PIC X(57)  VALUE
047200     '295 006287 031       036       DEEP VEIN THROMBOPHLEBITIS'.
047300         05  FILLER   PIC X(57)  VALUE
047400     '296 013013 019       029       CARDIAC ARREST, UNEXPLAINE'.
047500         05  FILLER   PIC X(57)  VALUE
047600     '297 006063 012       015       CARDIAC ARREST, UNEXPLAINE'.
047700         05  FILLER   PIC X(57)  VALUE
047800     '298 004260 010       011       CARDIAC ARREST, UNEXPLAINE'.
047900         05  FILLER   PIC X(57)  VALUE
048000     '299 013647 044       056  Y    PERIPHERAL VASCULAR DISORD'.
048100         05  FILLER   PIC X(57)  VALUE
048200     '300 009666 036       045  Y    PERIPHERAL VASCULAR DISORD'.
048300         05  FILLER   PIC X(57)  VALUE
048400     '301 006681 027       033  Y    PERIPHERAL VASCULAR DISORD'.
048500         05  FILLER   PIC X(57)  VALUE
048600     '302 010287 029       039       ATHEROSCLEROSIS W MCC     '.
048700         05  FILLER   PIC X(57)  VALUE
048800     '303 006034 019       023       ATHEROSCLEROSIS W/O MCC   '.
048900         05  FILLER   PIC X(57)  VALUE
049000     '304 010268 033       044       HYPERTENSION W MCC        '.
049100         05  FILLER   PIC X(57)  VALUE
049200     '305 006176 021       026       HYPERTENSION W/O MCC      '.
049300         05  FILLER   PIC X(57)  VALUE
049400     '306 013659 039       053       CARDIAC CONGENITAL & VALVU'.
049500         05  FILLER   PIC X(57)  VALUE
049600     '307 007917 026       033       CARDIAC CONGENITAL & VALVU'.
049700         05  FILLER   PIC X(57)  VALUE
049800     '308 012088 038       049       CARDIAC ARRHYTHMIA & CONDU'.
049900         05  FILLER   PIC X(57)  VALUE
050000     '309 007867 027       033       CARDIAC ARRHYTHMIA & CONDU'.
050100         05  FILLER   PIC X(57)  VALUE
050200     '310 005512 019       023       CARDIAC ARRHYTHMIA & CONDU'.
050300         05  FILLER   PIC X(57)  VALUE
050400     '311 005649 018       022       ANGINA PECTORIS           '.
050500         05  FILLER   PIC X(57)  VALUE
050600     '312 007228 024       030       SYNCOPE & COLLAPSE        '.
050700         05  FILLER   PIC X(57)  VALUE
050800     '313 005992 018       021       CHEST PAIN                '.
050900         05  FILLER   PIC X(57)  VALUE
051000     '314 018941 049       067  Y    OTHER CIRCULATORY SYSTEM D'.
051100         05  FILLER   PIC X(57)  VALUE
051200     '315 009534 031       040  Y    OTHER CIRCULATORY SYSTEM D'.
051300         05  FILLER   PIC X(57)  VALUE
051400     '316 006358 020       025  Y    OTHER CIRCULATORY SYSTEM D'.
051500         05  FILLER   PIC X(57)  VALUE
051600     '326 056013 116       149  Y    STOMACH, ESOPHAGEAL & DUOD'.
051700         05  FILLER   PIC X(57)  VALUE
051800     '327 026598 061       080  Y    STOMACH, ESOPHAGEAL & DUOD'.
051900         05  FILLER   PIC X(57)  VALUE
052000     '328 014765 026       034  Y    STOMACH, ESOPHAGEAL & DUOD'.
052100         05  FILLER   PIC X(57)  VALUE
052200     '329 051272 119       146  Y    MAJOR SMALL & LARGE BOWEL '.
052300         05  FILLER   PIC X(57)  VALUE
052400     '330 025609 073       085  Y    MAJOR SMALL & LARGE BOWEL '.
052500         05  FILLER   PIC X(57)  VALUE
052600     '331 016380 044       049  Y    MAJOR SMALL & LARGE BOWEL '.
052700         05  FILLER   PIC X(57)  VALUE
052800     '332 047072 109       132  Y    RECTAL RESECTION W MCC    '.
052900         05  FILLER   PIC X(57)  VALUE
053000     '333 024466 064       074  Y    RECTAL RESECTION W CC     '.
053100         05  FILLER   PIC X(57)  VALUE
053200     '334 015849 037       043  Y    RECTAL RESECTION W/O CC/MC'.
053300         05  FILLER   PIC X(57)  VALUE
053400     '335 041615 107       130  Y    PERITONEAL ADHESIOLYSIS W '.
053500         05  FILLER   PIC X(57)  VALUE
053600     '336 023513 070       084  Y    PERITONEAL ADHESIOLYSIS W '.
053700         05  FILLER   PIC X(57)  VALUE
053800     '337 015742 041       050  Y    PERITONEAL ADHESIOLYSIS W/'.
053900         05  FILLER   PIC X(57)  VALUE
054000     '338 031217 078       095       APPENDECTOMY W COMPLICATED'.
054100         05  FILLER   PIC X(57)  VALUE
054200     '339 017117 051       060       APPENDECTOMY W COMPLICATED'.
054300         05  FILLER   PIC X(57)  VALUE
054400     '340 011741 030       035       APPENDECTOMY W COMPLICATED'.
054500         05  FILLER   PIC X(57)  VALUE
054600     '341 021821 046       063       APPENDECTOMY W/O COMPLICAT'.
054700         05  FILLER   PIC X(57)  VALUE
054800     '342 012968 028       035       APPENDECTOMY W/O COMPLICAT'.
054900         05  FILLER   PIC X(57)  VALUE
055000     '343 009358 016       019       APPENDECTOMY W/O COMPLICAT'.
055100         05  FILLER   PIC X(57)  VALUE
055200     '344 035966 089       113       MINOR SMALL & LARGE BOWEL '.
055300         05  FILLER   PIC X(57)  VALUE
055400     '345 016865 055       065       MINOR SMALL & LARGE BOWEL '.
055500         05  FILLER   PIC X(57)  VALUE
055600     '346 012174 040       044       MINOR SMALL & LARGE BOWEL '.
055700         05  FILLER   PIC X(57)  VALUE
055800     '347 025182 063       085       ANAL & STOMAL PROCEDURES W'.
055900         05  FILLER   PIC X(57)  VALUE
056000     '348 013585 040       051       ANAL & STOMAL PROCEDURES W'.
056100         05  FILLER   PIC X(57)  VALUE
056200     '349 008834 024       030       ANAL & STOMAL PROCEDURES W'.
056300         05  FILLER   PIC X(57)  VALUE
056400     '350 024598 058       078       INGUINAL & FEMORAL HERNIA '.
056500         05  FILLER   PIC X(57)  VALUE
056600     '351 013761 035       045       INGUINAL & FEMORAL HERNIA '.
056700         05  FILLER   PIC X(57)  VALUE
056800     '352 009239 020       025       INGUINAL & FEMORAL HERNIA '.
056900         05  FILLER   PIC X(57)  VALUE
057000     '353 027885 062       080       HERNIA PROCEDURES EXCEPT I'.
057100         05  FILLER   PIC X(57)  VALUE
057200     '354 016401 040       050       HERNIA PROCEDURES EXCEPT I'.
057300         05  FILLER   PIC X(57)  VALUE
057400     '355 011783 025       030       HERNIA PROCEDURES EXCEPT I'.
057500         05  FILLER   PIC X(57)  VALUE
057600     '356 038388 086       115  Y    OTHER DIGESTIVE SYSTEM O.R'.
057700         05  FILLER   PIC X(57)  VALUE
057800     '357 021448 054       069  Y    OTHER DIGESTIVE SYSTEM O.R'.
057900         05  FILLER   PIC X(57)  VALUE
058000     '358 013942 032       041  Y    OTHER DIGESTIVE SYSTEM O.R'.
058100         05  FILLER   PIC X(57)  VALUE
058200     '368 018779 050       066       MAJOR ESOPHAGEAL DISORDERS'.
058300         05  FILLER   PIC X(57)  VALUE
058400     '369 010660 035       042       MAJOR ESOPHAGEAL DISORDERS'.
058500         05  FILLER   PIC X(57)  VALUE
058600     '370 007486 025       030       MAJOR ESOPHAGEAL DISORDERS'.
058700         05  FILLER   PIC X(57)  VALUE
058800     '371 019027 062       079  Y    MAJOR GASTROINTESTINAL DIS'.
058900         05  FILLER   PIC X(57)  VALUE
059000     '372 011733 048       058  Y    MAJOR GASTROINTESTINAL DIS'.
059100         05  FILLER   PIC X(57)  VALUE
059200     '373 008103 036       042  Y    MAJOR GASTROINTESTINAL DIS'.
059300         05  FILLER   PIC X(57)  VALUE
059400     '374 021051 062       084  Y    DIGESTIVE MALIGNANCY W MCC'.
059500         05  FILLER   PIC X(57)  VALUE
059600     '375 012561 042       054  Y    DIGESTIVE MALIGNANCY W CC '.
059700         05  FILLER   PIC X(57)  VALUE
059800     '376 008738 027       035  Y    DIGESTIVE MALIGNANCY W/O C'.
059900         05  FILLER   PIC X(57)  VALUE
060000     '377 017629 048       061  Y    G.I. HEMORRHAGE W MCC     '.
060100         05  FILLER   PIC X(57)  VALUE
060200     '378 010029 033       039  Y    G.I. HEMORRHAGE W CC      '.
060300         05  FILLER   PIC X(57)  VALUE
060400     '379 006937 024       028  Y    G.I. HEMORRHAGE W/O CC/MCC'.
060500         05  FILLER   PIC X(57)  VALUE
060600     '380 019223 055       072  Y    COMPLICATED PEPTIC ULCER W'.
060700         05  FILLER   PIC X(57)  VALUE
060800     '381 011199 038       046  Y    COMPLICATED PEPTIC ULCER W'.
060900         05  FILLER   PIC X(57)  VALUE
061000     '382 007784 027       033  Y    COMPLICATED PEPTIC ULCER W'.
061100         05  FILLER   PIC X(57)  VALUE
061200     '383 013850 044       055       UNCOMPLICATED PEPTIC ULCER'.
061300         05  FILLER   PIC X(57)  VALUE
061400     '384 008501 030       036       UNCOMPLICATED PEPTIC ULCER'.
061500         05  FILLER   PIC X(57)  VALUE
061600     '385 017973 060       078       INFLAMMATORY BOWEL DISEASE'.
061700         05  FILLER   PIC X(57)  VALUE
061800     '386 010097 040       050       INFLAMMATORY BOWEL DISEASE'.
061900         05  FILLER   PIC X(57)  VALUE
062000     '387 007533 031       038       INFLAMMATORY BOWEL DISEASE'.
062100         05  FILLER   PIC X(57)  VALUE
062200     '388 016170 053       070  Y    G.I. OBSTRUCTION W MCC    '.
062300         05  FILLER   PIC X(57)  VALUE
062400     '389 008853 036       045  Y    G.I. OBSTRUCTION W CC     '.
062500         05  FILLER   PIC X(57)  VALUE
062600     '390 006046 027       032  Y    G.I. OBSTRUCTION W/O CC/MC'.
062700         05  FILLER   PIC X(57)  VALUE
062800     '391 011903 039       051       ESOPHAGITIS, GASTROENT & M'.
062900         05  FILLER   PIC X(57)  VALUE
063000     '392 007395 029       035       ESOPHAGITIS, GASTROENT & M'.
063100         05  FILLER   PIC X(57)  VALUE
063200     '393 016563 047       065       OTHER DIGESTIVE SYSTEM DIA'.
063300         05  FILLER   PIC X(57)  VALUE
063400     '394 009653 035       044       OTHER DIGESTIVE SYSTEM DIA'.
063500         05  FILLER   PIC X(57)  VALUE
063600     '395 006669 024       030       OTHER DIGESTIVE SYSTEM DIA'.
063700         05  FILLER   PIC X(57)  VALUE
063800     '405 054333 110       145  Y    PANCREAS, LIVER & SHUNT PR'.
063900         05  FILLER   PIC X(57)  VALUE
064000     '406 027667 060       076  Y    PANCREAS, LIVER & SHUNT PR'.
064100         05  FILLER   PIC X(57)  VALUE
064200     '407 019139 042       051  Y    PANCREAS, LIVER & SHUNT PR'.
064300         05  FILLER   PIC X(57)  VALUE
064400     '408 041182 106       132       BILIARY TRACT PROC EXCEPT '.
064500         05  FILLER   PIC X(57)  VALUE
064600     '409 024337 067       079       BILIARY TRACT PROC EXCEPT '.
064700         05  FILLER   PIC X(57)  VALUE
064800     '410 015123 043       050       BILIARY TRACT PROC EXCEPT '.
064900         05  FILLER   PIC X(57)  VALUE
065000     '411 035968 093       113       CHOLECYSTECTOMY W C.D.E. W'.
065100         05  FILLER   PIC X(57)  VALUE
065200     '412 023659 065       076       CHOLECYSTECTOMY W C.D.E. W'.
065300         05  FILLER   PIC X(57)  VALUE
065400     '413 017220 042       050       CHOLECYSTECTOMY W C.D.E. W'.
065500         05  FILLER   PIC X(57)  VALUE
065600     '414 036208 088       106  Y    CHOLECYSTECTOMY EXCEPT BY '.
065700         05  FILLER   PIC X(57)  VALUE
065800     '415 020173 058       067  Y    CHOLECYSTECTOMY EXCEPT BY '.
065900         05  FILLER   PIC X(57)  VALUE
066000     '416 013268 035       041  Y    CHOLECYSTECTOMY EXCEPT BY '.
066100         05  FILLER   PIC X(57)  VALUE
066200     '417 024784 060       075       LAPAROSCOPIC CHOLECYSTECTO'.
066300         05  FILLER   PIC X(57)  VALUE
066400     '418 016536 041       050       LAPAROSCOPIC CHOLECYSTECTO'.
066500         05  FILLER   PIC X(57)  VALUE
066600     '419 012239 026       031       LAPAROSCOPIC CHOLECYSTECTO'.
066700         05  FILLER   PIC X(57)  VALUE
066800     '420 036786 087       123       HEPATOBILIARY DIAGNOSTIC P'.
066900         05  FILLER   PIC X(57)  VALUE
067000     '421 017714 046       063       HEPATOBILIARY DIAGNOSTIC P'.
067100         05  FILLER   PIC X(57)  VALUE
067200     '422 012175 031       039       HEPATOBILIARY DIAGNOSTIC P'.
067300         05  FILLER   PIC X(57)  VALUE
067400     '423 042183 096       130       OTHER HEPATOBILIARY OR PAN'.
067500         05  FILLER   PIC X(57)  VALUE
067600     '424 023149 063       082       OTHER HEPATOBILIARY OR PAN'.
067700         05  FILLER   PIC X(57)  VALUE
067800     '425 016396 038       049       OTHER HEPATOBILIARY OR PAN'.
067900         05  FILLER   PIC X(57)  VALUE
068000     '432 017150 047       063       CIRRHOSIS & ALCOHOLIC HEPA'.
068100         05  FILLER   PIC X(57)  VALUE
068200     '433 009249 033       041       CIRRHOSIS & ALCOHOLIC HEPA'.
068300         05  FILLER   PIC X(57)  VALUE
068400     '434 006156 024       030       CIRRHOSIS & ALCOHOLIC HEPA'.
068500         05  FILLER   PIC X(57)  VALUE
068600     '435 017356 052       069       MALIGNANCY OF HEPATOBILIAR'.
068700         05  FILLER   PIC X(57)  VALUE
068800     '436 011548 039       050       MALIGNANCY OF HEPATOBILIAR'.
068900         05  FILLER   PIC X(57)  VALUE
069000     '437 009282 028       036       MALIGNANCY OF HEPATOBILIAR'.
069100         05  FILLER   PIC X(57)  VALUE
069200     '438 017210 051       070       DISORDERS OF PANCREAS EXCE'.
069300         05  FILLER   PIC X(57)  VALUE
069400     '439 009162 036       045       DISORDERS OF PANCREAS EXCE'.
069500         05  FILLER   PIC X(57)  VALUE
069600     '440 006452 027       032       DISORDERS OF PANCREAS EXCE'.
069700         05  FILLER   PIC X(57)  VALUE
069800     '441 018534 050       068  Y    DISORDERS OF LIVER EXCEPT '.
069900         05  FILLER   PIC X(57)  VALUE
070000     '442 009280 034       043  Y    DISORDERS OF LIVER EXCEPT '.
070100         05  FILLER   PIC X(57)  VALUE
070200     '443 006418 026       032  Y    DISORDERS OF LIVER EXCEPT '.
070300         05  FILLER   PIC X(57)  VALUE
070400     '444 016060 047       061       DISORDERS OF THE BILIARY T'.
070500         05  FILLER   PIC X(57)  VALUE
070600     '445 010476 034       042       DISORDERS OF THE BILIARY T'.
070700         05  FILLER   PIC X(57)  VALUE
070800     '446 007499 024       029       DISORDERS OF THE BILIARY T'.
070900         05  FILLER   PIC X(57)  VALUE
071000     '453 117453 097       122       COMBINED ANTERIOR/POSTERIO'.
071100         05  FILLER   PIC X(57)  VALUE
071200     '454 080200 051       061       COMBINED ANTERIOR/POSTERIO'.
071300         05  FILLER   PIC X(57)  VALUE
071400     '455 062882 031       036       COMBINED ANTERIOR/POSTERIO'.
071500         05  FILLER   PIC X(57)  VALUE
071600     '456 095871 102       125       SPINAL FUS EXC CERV W SPIN'.
071700         05  FILLER   PIC X(57)  VALUE
071800     '457 068188 056       065       SPINAL FUS EXC CERV W SPIN'.
071900         05  FILLER   PIC X(57)  VALUE
072000     '458 051378 033       038       SPINAL FUS EXC CERV W SPIN'.
072100         05  FILLER   PIC X(57)  VALUE
072200     '459 068163 071       087  Y    SPINAL FUSION EXCEPT CERVI'.
072300         05  FILLER   PIC X(57)  VALUE
072400     '460 040221 031       036  Y    SPINAL FUSION EXCEPT CERVI'.
072500         05  FILLER   PIC X(57)  VALUE
072600     '461 050254 061       075       BILATERAL OR MULTIPLE MAJO'.
072700         05  FILLER   PIC X(57)  VALUE
072800     '462 035190 035       038       BILATERAL OR MULTIPLE MAJO'.
072900         05  FILLER   PIC X(57)  VALUE
073000     '463 051152 104       140  Y    WND DEBRID & SKN GRFT EXC '.
073100         05  FILLER   PIC X(57)  VALUE
073200     '464 030243 062       080  Y    WND DEBRID & SKN GRFT EXC '.
073300         05  FILLER   PIC X(57)  VALUE
073400     '465 019199 038       048  Y    WND DEBRID & SKN GRFT EXC '.
073500         05  FILLER   PIC X(57)  VALUE
073600     '466 052748 070       086  Y    REVISION OF HIP OR KNEE RE'.
073700         05  FILLER   PIC X(57)  VALUE
073800     '467 034140 039       045  Y    REVISION OF HIP OR KNEE RE'.
073900         05  FILLER   PIC X(57)  VALUE
074000     '468 027624 030       032  Y    REVISION OF HIP OR KNEE RE'.
074100         05  FILLER   PIC X(57)  VALUE
074200     '469 034377 062       074  Y    MAJOR JOINT REPLACEMENT OR'.
074300         05  FILLER   PIC X(57)  VALUE
074400     '470 021463 031       034  Y    MAJOR JOINT REPLACEMENT OR'.
074500         05  FILLER   PIC X(57)  VALUE
074600     '471 049444 064       089       CERVICAL SPINAL FUSION W M'.
074700         05  FILLER   PIC X(57)  VALUE
074800     '472 029288 025       035       CERVICAL SPINAL FUSION W C'.
074900         05  FILLER   PIC X(57)  VALUE
075000     '473 022458 015       018       CERVICAL SPINAL FUSION W/O'.
075100         05  FILLER   PIC X(57)  VALUE
075200     '474 036884 088       112  Y    AMPUTATION FOR MUSCULOSKEL'.
075300         05  FILLER   PIC X(57)  VALUE
075400     '475 020488 057       071  Y    AMPUTATION FOR MUSCULOSKEL'.
075500         05  FILLER   PIC X(57)  VALUE
075600     '476 010717 031       039  Y    AMPUTATION FOR MUSCULOSKEL'.
075700         05  FILLER   PIC X(57)  VALUE
075800     '477 032827 086       108  Y Y  BIOPSIES OF MUSCULOSKELETA'.
075900         05  FILLER   PIC X(57)  VALUE
076000     '478 022115 054       067  Y Y  BIOPSIES OF MUSCULOSKELETA'.
076100         05  FILLER   PIC X(57)  VALUE
076200     '479 017340 033       042  Y Y  BIOPSIES OF MUSCULOSKELETA'.
076300         05  FILLER   PIC X(57)  VALUE
076400     '480 030694 071       083  Y Y  HIP & FEMUR PROCEDURES EXC'.
076500         05  FILLER   PIC X(57)  VALUE
076600     '481 019721 048       052  Y Y  HIP & FEMUR PROCEDURES EXC'.
076700         05  FILLER   PIC X(57)  VALUE
076800     '482 016305 039       042  Y Y  HIP & FEMUR PROCEDURES EXC'.
076900         05  FILLER   PIC X(57)  VALUE
077000     '483 026488 028       034  Y    MAJOR JOINT & LIMB REATTAC'.
077100         05  FILLER   PIC X(57)  VALUE
077200     '484 022298 018       020  Y    MAJOR JOINT & LIMB REATTAC'.
077300         05  FILLER   PIC X(57)  VALUE
077400     '485 032719 084       103       KNEE PROCEDURES W PDX OF I'.
077500         05  FILLER   PIC X(57)  VALUE
077600     '486 020199 056       065       KNEE PROCEDURES W PDX OF I'.
077700         05  FILLER   PIC X(57)  VALUE
077800     '487 015215 041       046       KNEE PROCEDURES W PDX OF I'.
077900         05  FILLER   PIC X(57)  VALUE
078000     '488 017379 035       043  Y    KNEE PROCEDURES W/O PDX OF'.
078100         05  FILLER   PIC X(57)  VALUE
078200     '489 012799 025       028  Y    KNEE PROCEDURES W/O PDX OF'.
078300         05  FILLER   PIC X(57)  VALUE
078400     '490 018845 034       046       BACK & NECK PROC EXC SPINA'.
078500         05  FILLER   PIC X(57)  VALUE
078600     '491 010893 019       023       BACK & NECK PROC EXC SPINA'.
078700         05  FILLER   PIC X(57)  VALUE
078800     '492 031831 064       080  Y Y  LOWER EXTREM & HUMER PROC '.
078900         05  FILLER   PIC X(57)  VALUE
079000     '493 019971 040       048  Y Y  LOWER EXTREM & HUMER PROC '.
079100         05  FILLER   PIC X(57)  VALUE
079200     '494 015073 027       032  Y Y  LOWER EXTREM & HUMER PROC '.
079300         05  FILLER   PIC X(57)  VALUE
079400     '495 029110 072       096  Y Y  LOCAL EXCISION & REMOVAL I'.
079500         05  FILLER   PIC X(57)  VALUE
079600     '496 017290 040       052  Y Y  LOCAL EXCISION & REMOVAL I'.
079700         05  FILLER   PIC X(57)  VALUE
079800     '497 011731 021       026  Y Y  LOCAL EXCISION & REMOVAL I'.
079900         05  FILLER   PIC X(57)  VALUE
080000     '498 021924 053       072       LOCAL EXCISION & REMOVAL I'.
080100         05  FILLER   PIC X(57)  VALUE
080200     '499 009577 021       026       LOCAL EXCISION & REMOVAL I'.
080300         05  FILLER   PIC X(57)  VALUE
080400     '500 030116 073       098  Y Y  SOFT TISSUE PROCEDURES W M'.
080500         05  FILLER   PIC X(57)  VALUE
080600     '501 015804 044       055  Y Y  SOFT TISSUE PROCEDURES W C'.
080700         05  FILLER   PIC X(57)  VALUE
080800     '502 011277 024       029  Y Y  SOFT TISSUE PROCEDURES W/O'.
080900         05  FILLER   PIC X(57)  VALUE
081000     '503 022584 063       078       FOOT PROCEDURES W MCC     '.
081100         05  FILLER   PIC X(57)  VALUE
081200     '504 016133 049       059       FOOT PROCEDURES W CC      '.
081300         05  FILLER   PIC X(57)  VALUE
081400     '505 012072 027       033       FOOT PROCEDURES W/O CC/MCC'.
081500         05  FILLER   PIC X(57)  VALUE
081600     '506 012041 029       038       MAJOR THUMB OR JOINT PROCE'.
081700         05  FILLER   PIC X(57)  VALUE
081800     '507 019667 041       056       MAJOR SHOULDER OR ELBOW JO'.
081900         05  FILLER   PIC X(57)  VALUE
082000     '508 013190 020       024       MAJOR SHOULDER OR ELBOW JO'.
082100         05  FILLER   PIC X(57)  VALUE
082200     '509 013245 027       035       ARTHROSCOPY               '.
082300         05  FILLER   PIC X(57)  VALUE
082400     '510 022717 048       060  Y    SHOULDER,ELBOW OR FOREARM '.
082500         05  FILLER   PIC X(57)  VALUE
082600     '511 015894 032       038  Y    SHOULDER,ELBOW OR FOREARM '.
082700         05  FILLER   PIC X(57)  VALUE
082800     '512 012266 020       023  Y    SHOULDER,ELBOW OR FOREARM '.
082900         05  FILLER   PIC X(57)  VALUE
083000     '513 014122 037       049       HAND OR WRIST PROC, EXCEPT'.
083100         05  FILLER   PIC X(57)  VALUE
083200     '514 008781 022       027       HAND OR WRIST PROC, EXCEPT'.
083300         05  FILLER   PIC X(57)  VALUE
083400     '515 033340 075       096  Y Y  OTHER MUSCULOSKELET SYS & '.
083500         05  FILLER   PIC X(57)  VALUE
083600     '516 020160 045       055  Y Y  OTHER MUSCULOSKELET SYS & '.
083700         05  FILLER   PIC X(57)  VALUE
083800     '517 016777 028       034  Y Y  OTHER MUSCULOSKELET SYS & '.
083900         05  FILLER   PIC X(57)  VALUE
084000     '533 013759 043       056  Y    FRACTURES OF FEMUR W MCC  '.
084100         05  FILLER   PIC X(57)  VALUE
084200     '534 007364 029       036  Y    FRACTURES OF FEMUR W/O MCC'.
084300         05  FILLER   PIC X(57)  VALUE
084400     '535 013085 042       054  Y    FRACTURES OF HIP & PELVIS '.
084500         05  FILLER   PIC X(57)  VALUE
084600     '536 007091 030       035  Y    FRACTURES OF HIP & PELVIS '.
084700         05  FILLER   PIC X(57)  VALUE
084800     '537 008604 034       040       SPRAINS, STRAINS, & DISLOC'.
084900         05  FILLER   PIC X(57)  VALUE
085000     '538 006870 024       028       SPRAINS, STRAINS, & DISLOC'.
085100         05  FILLER   PIC X(57)  VALUE
085200     '539 018631 062       081  Y    OSTEOMYELITIS W MCC       '.
085300         05  FILLER   PIC X(57)  VALUE
085400     '540 013063 049       061  Y    OSTEOMYELITIS W CC        '.
085500         05  FILLER   PIC X(57)  VALUE
085600     '541 009743 036       047  Y    OSTEOMYELITIS W/O CC/MCC  '.
085700         05  FILLER   PIC X(57)  VALUE
085800     '542 019451 060       079  Y    PATHOLOGICAL FRACTURES & M'.
085900         05  FILLER   PIC X(57)  VALUE
086000     '543 011267 042       052  Y    PATHOLOGICAL FRACTURES & M'.
086100         05  FILLER   PIC X(57)  VALUE
086200     '544 007736 032       037  Y    PATHOLOGICAL FRACTURES & M'.
086300         05  FILLER   PIC X(57)  VALUE
086400     '545 024445 060       085  Y    CONNECTIVE TISSUE DISORDER'.
086500         05  FILLER   PIC X(57)  VALUE
086600     '546 011711 040       050  Y    CONNECTIVE TISSUE DISORDER'.
086700         05  FILLER   PIC X(57)  VALUE
086800     '547 008061 029       036  Y    CONNECTIVE TISSUE DISORDER'.
086900         05  FILLER   PIC X(57)  VALUE
087000     '548 017811 059       076       SEPTIC ARTHRITIS W MCC    '.
087100         05  FILLER   PIC X(57)  VALUE
087200     '549 011101 043       052       SEPTIC ARTHRITIS W CC     '.
087300         05  FILLER   PIC X(57)  VALUE
087400     '550 008149 031       038       SEPTIC ARTHRITIS W/O CC/MC'.
087500         05  FILLER   PIC X(57)  VALUE
087600     '551 016317 050       064  Y    MEDICAL BACK PROBLEMS W MC'.
087700         05  FILLER   PIC X(57)  VALUE
087800     '552 008467 032       039  Y    MEDICAL BACK PROBLEMS W/O '.
087900         05  FILLER   PIC X(57)  VALUE
088000     '553 012370 044       056       BONE DISEASES & ARTHROPATH'.
088100         05  FILLER   PIC X(57)  VALUE
088200     '554 007181 029       036       BONE DISEASES & ARTHROPATH'.
088300         05  FILLER   PIC X(57)  VALUE
088400     '555 011974 037       050       SIGNS & SYMPTOMS OF MUSCUL'.
088500         05  FILLER   PIC X(57)  VALUE
088600     '556 007066 026       032       SIGNS & SYMPTOMS OF MUSCUL'.
088700         05  FILLER   PIC X(57)  VALUE
088800     '557 014756 051       064  Y    TENDONITIS, MYOSITIS & BUR'.
088900         05  FILLER   PIC X(57)  VALUE
089000     '558 008337 034       040  Y    TENDONITIS, MYOSITIS & BUR'.
089100         05  FILLER   PIC X(57)  VALUE
089200     '559 018639 050       069  Y    AFTERCARE, MUSCULOSKELETAL'.
089300         05  FILLER   PIC X(57)  VALUE
089400     '560 010260 034       044  Y    AFTERCARE, MUSCULOSKELETAL'.
089500         05  FILLER   PIC X(57)  VALUE
089600     '561 006408 020       025  Y    AFTERCARE, MUSCULOSKELETAL'.
089700         05  FILLER   PIC X(57)  VALUE
089800     '562 013528 044       055  Y    FX, SPRN, STRN & DISL EXCE'.
089900         05  FILLER   PIC X(57)  VALUE
090000     '563 007535 030       035  Y    FX, SPRN, STRN & DISL EXCE'.
090100         05  FILLER   PIC X(57)  VALUE
090200     '564 014855 045       061       OTHER MUSCULOSKELETAL SYS '.
090300         05  FILLER   PIC X(57)  VALUE
090400     '565 009281 036       044       OTHER MUSCULOSKELETAL SYS '.
090500         05  FILLER   PIC X(57)  VALUE
090600     '566 006642 026       033       OTHER MUSCULOSKELETAL SYS '.
090700         05  FILLER   PIC X(57)  VALUE
090800     '570 024154 072       094  Y    SKIN DEBRIDEMENT W MCC    '.
090900         05  FILLER   PIC X(57)  VALUE
091000     '571 014906 054       065  Y    SKIN DEBRIDEMENT W CC     '.
091100         05  FILLER   PIC X(57)  VALUE
091200     '572 010077 038       046  Y    SKIN DEBRIDEMENT W/O CC/MC'.
091300         05  FILLER   PIC X(57)  VALUE
091400     '573 034623 082       123  Y    SKIN GRAFT FOR SKIN ULCER '.
091500         05  FILLER   PIC X(57)  VALUE
091600     '574 026883 071       096  Y    SKIN GRAFT FOR SKIN ULCER '.
091700         05  FILLER   PIC X(57)  VALUE
091800     '575 014376 042       054  Y    SKIN GRAFT FOR SKIN ULCER '.
091900         05  FILLER   PIC X(57)  VALUE
092000     '576 042927 079       123       SKIN GRAFT EXC FOR SKIN UL'.
092100         05  FILLER   PIC X(57)  VALUE
092200     '577 020212 040       059       SKIN GRAFT EXC FOR SKIN UL'.
092300         05  FILLER   PIC X(57)  VALUE
092400     '578 012617 024       033       SKIN GRAFT EXC FOR SKIN UL'.
092500         05  FILLER   PIC X(57)  VALUE
092600     '579 026106 070       092  Y    OTHER SKIN, SUBCUT TISS & '.
092700         05  FILLER   PIC X(57)  VALUE
092800     '580 015398 038       051  Y    OTHER SKIN, SUBCUT TISS & '.
092900         05  FILLER   PIC X(57)  VALUE
093000     '581 010605 020       026  Y    OTHER SKIN, SUBCUT TISS & '.
093100         05  FILLER   PIC X(57)  VALUE
093200     '582 011913 020       027       MASTECTOMY FOR MALIGNANCY '.
093300         05  FILLER   PIC X(57)  VALUE
093400     '583 009711 015       017       MASTECTOMY FOR MALIGNANCY '.
093500         05  FILLER   PIC X(57)  VALUE
093600     '584 016998 035       048       BREAST BIOPSY, LOCAL EXCIS'.
093700         05  FILLER   PIC X(57)  VALUE
093800     '585 013162 020       026       BREAST BIOPSY, LOCAL EXCIS'.
093900         05  FILLER   PIC X(57)  VALUE
094000     '592 014131 051       066  Y    SKIN ULCERS W MCC         '.
094100         05  FILLER   PIC X(57)  VALUE
094200     '593 010094 042       051  Y    SKIN ULCERS W CC          '.
094300         05  FILLER   PIC X(57)  VALUE
094400     '594 006814 031       039  Y    SKIN ULCERS W/O CC/MCC    '.
094500         05  FILLER   PIC X(57)  VALUE
094600     '595 019464 057       078       MAJOR SKIN DISORDERS W MCC'.
094700         05  FILLER   PIC X(57)  VALUE
094800     '596 009284 036       046       MAJOR SKIN DISORDERS W/O M'.
094900         05  FILLER   PIC X(57)  VALUE
095000     '597 017064 052       071       MALIGNANT BREAST DISORDERS'.
095100         05  FILLER   PIC X(57)  VALUE
095200     '598 010817 039       051       MALIGNANT BREAST DISORDERS'.
095300         05  FILLER   PIC X(57)  VALUE
095400     '599 006547 025       031       MALIGNANT BREAST DISORDERS'.
095500         05  FILLER   PIC X(57)  VALUE
095600     '600 009963 038       047       NON-MALIGNANT BREAST DISOR'.
095700         05  FILLER   PIC X(57)  VALUE
095800     '601 006445 028       034       NON-MALIGNANT BREAST DISOR'.
095900         05  FILLER   PIC X(57)  VALUE
096000     '602 014607 050       063  Y    CELLULITIS W MCC          '.
096100         05  FILLER   PIC X(57)  VALUE
096200     '603 008402 036       042  Y    CELLULITIS W/O MCC        '.
096300         05  FILLER   PIC X(57)  VALUE
096400     '604 013223 039       051       TRAUMA TO THE SKIN, SUBCUT'.
096500         05  FILLER   PIC X(57)  VALUE
096600     '605 007372 026       032       TRAUMA TO THE SKIN, SUBCUT'.
096700         05  FILLER   PIC X(57)  VALUE
096800     '606 013594 043       060       MINOR SKIN DISORDERS W MCC'.
096900         05  FILLER   PIC X(57)  VALUE
097000     '607 007043 028       036       MINOR SKIN DISORDERS W/O M'.
097100         05  FILLER   PIC X(57)  VALUE
097200     '614 025455 043       059       ADRENAL & PITUITARY PROCED'.
097300         05  FILLER   PIC X(57)  VALUE
097400     '615 014579 023       027       ADRENAL & PITUITARY PROCED'.
097500         05  FILLER   PIC X(57)  VALUE
097600     '616 040773 109       131  Y    AMPUTAT OF LOWER LIMB FOR '.
097700         05  FILLER   PIC X(57)  VALUE
097800     '617 020071 061       074  Y    AMPUTAT OF LOWER LIMB FOR '.
097900         05  FILLER   PIC X(57)  VALUE
098000     '618 012489 043       052  Y    AMPUTAT OF LOWER LIMB FOR '.
098100         05  FILLER   PIC X(57)  VALUE
098200     '619 036200 048       077       O.R. PROCEDURES FOR OBESIT'.
098300         05  FILLER   PIC X(57)  VALUE
098400     '620 019399 027       032       O.R. PROCEDURES FOR OBESIT'.
098500         05  FILLER   PIC X(57)  VALUE
098600     '621 015772 018       020       O.R. PROCEDURES FOR OBESIT'.
098700         05  FILLER   PIC X(57)  VALUE
098800     '622 033505 091       122  Y    SKIN GRAFTS & WOUND DEBRID'.
098900         05  FILLER   PIC X(57)  VALUE
099000     '623 018239 057       071  Y    SKIN GRAFTS & WOUND DEBRID'.
099100         05  FILLER   PIC X(57)  VALUE
099200     '624 009635 035       042  Y    SKIN GRAFTS & WOUND DEBRID'.
099300         05  FILLER   PIC X(57)  VALUE
099400     '625 024009 044       073       THYROID, PARATHYROID & THY'.
099500         05  FILLER   PIC X(57)  VALUE
099600     '626 012459 020       028       THYROID, PARATHYROID & THY'.
099700         05  FILLER   PIC X(57)  VALUE
099800     '627 008458 013       014       THYROID, PARATHYROID & THY'.
099900         05  FILLER   PIC X(57)  VALUE
100000     '628 033515 066       096  Y    OTHER ENDOCRINE, NUTRIT & '.
100100         05  FILLER   PIC X(57)  VALUE
100200     '629 021292 060       072  Y    OTHER ENDOCRINE, NUTRIT & '.
100300         05  FILLER   PIC X(57)  VALUE
100400     '630 013444 030       038  Y    OTHER ENDOCRINE, NUTRIT & '.
100500         05  FILLER   PIC X(57)  VALUE
100600     '637 013888 042       055  Y    DIABETES W MCC            '.
100700         05  FILLER   PIC X(57)  VALUE
100800     '638 008252 030       037  Y    DIABETES W CC             '.
100900         05  FILLER   PIC X(57)  VALUE
101000     '639 005708 022       026  Y    DIABETES W/O CC/MCC       '.
101100         05  FILLER   PIC X(57)  VALUE
101200     '640 011111 033       046  Y    MISC DISORDERS OF NUTRITIO'.
101300         05  FILLER   PIC X(57)  VALUE
101400     '641 006992 028       034  Y    MISC DISORDERS OF NUTRITIO'.
101500         05  FILLER   PIC X(57)  VALUE
101600     '642 010674 032       042       INBORN AND OTHER DISORDERS'.
101700         05  FILLER   PIC X(57)  VALUE
101800     '643 016693 055       069  Y    ENDOCRINE DISORDERS W MCC '.
101900         05  FILLER   PIC X(57)  VALUE
102000     '644 010194 039       047  Y    ENDOCRINE DISORDERS W CC  '.
102100         05  FILLER   PIC X(57)  VALUE
102200     '645 007041 028       034  Y    ENDOCRINE DISORDERS W/O CC'.
102300         05  FILLER   PIC X(57)  VALUE
102400     '652 031530 058       068       KIDNEY TRANSPLANT         '.
102500         05  FILLER   PIC X(57)  VALUE
102600     '653 059558 127       154  Y    MAJOR BLADDER PROCEDURES W'.
102700         05  FILLER   PIC X(57)  VALUE
102800     '654 030944 078       089  Y    MAJOR BLADDER PROCEDURES W'.
102900         05  FILLER   PIC X(57)  VALUE
103000     '655 021671 047       055  Y    MAJOR BLADDER PROCEDURES W'.
103100         05  FILLER   PIC X(57)  VALUE
103200     '656 035221 072       093       KIDNEY & URETER PROCEDURES'.
103300         05  FILLER   PIC X(57)  VALUE
103400     '657 020261 045       054       KIDNEY & URETER PROCEDURES'.
103500         05  FILLER   PIC X(57)  VALUE
103600     '658 015074 028       031       KIDNEY & URETER PROCEDURES'.
103700         05  FILLER   PIC X(57)  VALUE
103800     '659 034051 076       103  Y    KIDNEY & URETER PROCEDURES'.
103900         05  FILLER   PIC X(57)  VALUE
104000     '660 018827 043       056  Y    KIDNEY & URETER PROCEDURES'.
104100         05  FILLER   PIC X(57)  VALUE
104200     '661 013435 023       028  Y    KIDNEY & URETER PROCEDURES'.
104300         05  FILLER   PIC X(57)  VALUE
104400     '662 029801 077       102       MINOR BLADDER PROCEDURES W'.
104500         05  FILLER   PIC X(57)  VALUE
104600     '663 015666 039       053       MINOR BLADDER PROCEDURES W'.
104700         05  FILLER   PIC X(57)  VALUE
104800     '664 012208 017       022       MINOR BLADDER PROCEDURES W'.
104900         05  FILLER   PIC X(57)  VALUE
105000     '665 031414 092       117       PROSTATECTOMY W MCC       '.
105100         05  FILLER   PIC X(57)  VALUE
105200     '666 017042 045       062       PROSTATECTOMY W CC        '.
105300         05  FILLER   PIC X(57)  VALUE
105400     '667 008949 020       026       PROSTATECTOMY W/O CC/MCC  '.
105500         05  FILLER   PIC X(57)  VALUE
105600     '668 025573 066       088       TRANSURETHRAL PROCEDURES W'.
105700         05  FILLER   PIC X(57)  VALUE
105800     '669 012693 030       041       TRANSURETHRAL PROCEDURES W'.
105900         05  FILLER   PIC X(57)  VALUE
106000     '670 008354 019       024       TRANSURETHRAL PROCEDURES W'.
106100         05  FILLER   PIC X(57)  VALUE
106200     '671 015887 043       057       URETHRAL PROCEDURES W CC/M'.
106300         05  FILLER   PIC X(57)  VALUE
106400     '672 008835 019       023       URETHRAL PROCEDURES W/O CC'.
106500         05  FILLER   PIC X(57)  VALUE
106600     '673 031150 065       097       OTHER KIDNEY & URINARY TRA'.
106700         05  FILLER   PIC X(57)  VALUE
106800     '674 022378 051       069       OTHER KIDNEY & URINARY TRA'.
106900         05  FILLER   PIC X(57)  VALUE
107000     '675 013807 019       027       OTHER KIDNEY & URINARY TRA'.
107100         05  FILLER   PIC X(57)  VALUE
107200     '682 015401 047       062  Y    RENAL FAILURE W MCC       '.
107300         05  FILLER   PIC X(57)  VALUE
107400     '683 009655 037       045  Y    RENAL FAILURE W CC        '.
107500         05  FILLER   PIC X(57)  VALUE
107600     '684 006213 025       030  Y    RENAL FAILURE W/O CC/MCC  '.
107700         05  FILLER   PIC X(57)  VALUE
107800     '685 009282 026       034       ADMIT FOR RENAL DIALYSIS  '.
107900         05  FILLER   PIC X(57)  VALUE
108000     '686 017237 054       072       KIDNEY & URINARY TRACT NEO'.
108100         05  FILLER   PIC X(57)  VALUE
108200     '687 010441 037       048       KIDNEY & URINARY TRACT NEO'.
108300         05  FILLER   PIC X(57)  VALUE
108400     '688 006867 022       027       KIDNEY & URINARY TRACT NEO'.
108500         05  FILLER   PIC X(57)  VALUE
108600     '689 011300 043       053  Y    KIDNEY & URINARY TRACT INF'.
108700         05  FILLER   PIC X(57)  VALUE
108800     '690 007693 032       038  Y    KIDNEY & URINARY TRACT INF'.
108900         05  FILLER   PIC X(57)  VALUE
109000     '691 015454 030       038       URINARY STONES W ESW LITHO'.
109100         05  FILLER   PIC X(57)  VALUE
109200     '692 010690 017       020       URINARY STONES W ESW LITHO'.
109300         05  FILLER   PIC X(57)  VALUE
109400     '693 014186 041       053       URINARY STONES W/O ESW LIT'.
109500         05  FILLER   PIC X(57)  VALUE
109600     '694 006879 020       024       URINARY STONES W/O ESW LIT'.
109700         05  FILLER   PIC X(57)  VALUE
109800     '695 012773 042       055       KIDNEY & URINARY TRACT SIG'.
109900         05  FILLER   PIC X(57)  VALUE
110000     '696 006615 025       031       KIDNEY & URINARY TRACT SIG'.
110100         05  FILLER   PIC X(57)  VALUE
110200     '697 008225 025       032       URETHRAL STRICTURE        '.
110300         05  FILLER   PIC X(57)  VALUE
110400     '698 015681 051       064  Y    OTHER KIDNEY & URINARY TRA'.
110500         05  FILLER   PIC X(57)  VALUE
110600     '699 009890 035       044  Y    OTHER KIDNEY & URINARY TRA'.
110700         05  FILLER   PIC X(57)  VALUE
110800     '700 007026 026       032  Y    OTHER KIDNEY & URINARY TRA'.
110900         05  FILLER   PIC X(57)  VALUE
111000     '707 018265 030       041       MAJOR MALE PELVIC PROCEDUR'.
111100         05  FILLER   PIC X(57)  VALUE
111200     '708 012928 014       016       MAJOR MALE PELVIC PROCEDUR'.
111300         05  FILLER   PIC X(57)  VALUE
111400     '709 021038 040       062       PENIS PROCEDURES W CC/MCC '.
111500         05  FILLER   PIC X(57)  VALUE
111600     '710 013429 015       019       PENIS PROCEDURES W/O CC/MC'.
111700         05  FILLER   PIC X(57)  VALUE
111800     '711 020316 055       076       TESTES PROCEDURES W CC/MCC'.
111900         05  FILLER   PIC X(57)  VALUE
112000     '712 009580 023       030       TESTES PROCEDURES W/O CC/M'.
112100         05  FILLER   PIC X(57)  VALUE
112200     '713 013814 033       045       TRANSURETHRAL PROSTATECTOM'.
112300         05  FILLER   PIC X(57)  VALUE
112400     '714 007402 017       020       TRANSURETHRAL PROSTATECTOM'.
112500         05  FILLER   PIC X(57)  VALUE
112600     '715 022268 055       078       OTHER MALE REPRODUCTIVE SY'.
112700         05  FILLER   PIC X(57)  VALUE
112800     '716 009629 015       018       OTHER MALE REPRODUCTIVE SY'.
112900         05  FILLER   PIC X(57)  VALUE
113000     '717 017495 049       067       OTHER MALE REPRODUCTIVE SY'.
113100         05  FILLER   PIC X(57)  VALUE
113200     '718 008786 023       029       OTHER MALE REPRODUCTIVE SY'.
113300         05  FILLER   PIC X(57)  VALUE
113400     '722 016031 053       071       MALIGNANCY, MALE REPRODUCT'.
113500         05  FILLER   PIC X(57)  VALUE
113600     '723 010532 039       050       MALIGNANCY, MALE REPRODUCT'.
113700         05  FILLER   PIC X(57)  VALUE
113800     '724 005501 018       024       MALIGNANCY, MALE REPRODUCT'.
113900         05  FILLER   PIC X(57)  VALUE
114000     '725 012644 044       056       BENIGN PROSTATIC HYPERTROP'.
114100         05  FILLER   PIC X(57)  VALUE
114200     '726 007159 028       034       BENIGN PROSTATIC HYPERTROP'.
114300         05  FILLER   PIC X(57)  VALUE
114400     '727 014106 048       062       INFLAMMATION OF THE MALE R'.
114500         05  FILLER   PIC X(57)  VALUE
114600     '728 007821 032       039       INFLAMMATION OF THE MALE R'.
114700         05  FILLER   PIC X(57)  VALUE
114800     '729 011196 037       050       OTHER MALE REPRODUCTIVE SY'.
114900         05  FILLER   PIC X(57)  VALUE
115000     '730 006266 022       028       OTHER MALE REPRODUCTIVE SY'.
115100         05  FILLER   PIC X(57)  VALUE
115200     '734 025547 046       067       PELVIC EVISCERATION, RAD H'.
115300         05  FILLER   PIC X(57)  VALUE
115400     '735 011910 019       023       PELVIC EVISCERATION, RAD H'.
115500         05  FILLER   PIC X(57)  VALUE
115600     '736 042211 101       124       UTERINE & ADNEXA PROC FOR '.
115700         05  FILLER   PIC X(57)  VALUE
115800     '737 020310 053       062       UTERINE & ADNEXA PROC FOR '.
115900         05  FILLER   PIC X(57)  VALUE
116000     '738 012602 029       033       UTERINE & ADNEXA PROC FOR '.
116100         05  FILLER   PIC X(57)  VALUE
116200     '739 031647 065       087       UTERINE,ADNEXA PROC FOR NO'.
116300         05  FILLER   PIC X(57)  VALUE
116400     '740 015819 031       041       UTERINE,ADNEXA PROC FOR NO'.
116500         05  FILLER   PIC X(57)  VALUE
116600     '741 011470 018       021       UTERINE,ADNEXA PROC FOR NO'.
116700         05  FILLER   PIC X(57)  VALUE
116800     '742 014972 030       040       UTERINE & ADNEXA PROC FOR '.
116900         05  FILLER   PIC X(57)  VALUE
117000     '743 009903 017       019       UTERINE & ADNEXA PROC FOR '.
117100         05  FILLER   PIC X(57)  VALUE
117200     '744 015084 039       055       D&C, CONIZATION, LAPAROSCO'.
117300         05  FILLER   PIC X(57)  VALUE
117400     '745 008514 019       024       D&C, CONIZATION, LAPAROSCO'.
117500         05  FILLER   PIC X(57)  VALUE
117600     '746 013694 030       043       VAGINA, CERVIX & VULVA PRO'.
117700         05  FILLER   PIC X(57)  VALUE
117800     '747 008814 016       018       VAGINA, CERVIX & VULVA PRO'.
117900         05  FILLER   PIC X(57)  VALUE
118000     '748 010096 015       018       FEMALE REPRODUCTIVE SYSTEM'.
118100         05  FILLER   PIC X(57)  VALUE
118200     '749 026239 061       084       OTHER FEMALE REPRODUCTIVE '.
118300         05  FILLER   PIC X(57)  VALUE
118400     '750 010854 022       028       OTHER FEMALE REPRODUCTIVE '.
118500         05  FILLER   PIC X(57)  VALUE
118600     '754 019784 058       084       MALIGNANCY, FEMALE REPRODU'.
118700         05  FILLER   PIC X(57)  VALUE
118800     '755 010880 037       050       MALIGNANCY, FEMALE REPRODU'.
118900         05  FILLER   PIC X(57)  VALUE
119000     '756 006334 021       026       MALIGNANCY, FEMALE REPRODU'.
119100         05  FILLER   PIC X(57)  VALUE
119200     '757 015292 057       072       INFECTIONS, FEMALE REPRODU'.
119300         05  FILLER   PIC X(57)  VALUE
119400     '758 010452 042       052       INFECTIONS, FEMALE REPRODU'.
119500         05  FILLER   PIC X(57)  VALUE
119600     '759 006995 032       038       INFECTIONS, FEMALE REPRODU'.
119700         05  FILLER   PIC X(57)  VALUE
119800     '760 008063 028       036       MENSTRUAL & OTHER FEMALE R'.
119900         05  FILLER   PIC X(57)  VALUE
120000     '761 004904 018       022       MENSTRUAL & OTHER FEMALE R'.
120100         05  FILLER   PIC X(57)  VALUE
120200     '765 011125 039       048       CESAREAN SECTION W CC/MCC '.
120300         05  FILLER   PIC X(57)  VALUE
120400     '766 007766 029       031       CESAREAN SECTION W/O CC/MC'.
120500         05  FILLER   PIC X(57)  VALUE
120600     '767 009235 027       036       VAGINAL DELIVERY W STERILI'.
120700         05  FILLER   PIC X(57)  VALUE
120800     '768 010976 031       032       VAGINAL DELIVERY W O.R. PR'.
120900         05  FILLER   PIC X(57)  VALUE
121000     '769 021785 043       064       POSTPARTUM & POST ABORTION'.
121100         05  FILLER   PIC X(57)  VALUE
121200     '770 007070 016       021       ABORTION W D&C, ASPIRATION'.
121300         05  FILLER   PIC X(57)  VALUE
121400     '774 007137 025       030       VAGINAL DELIVERY W COMPLIC'.
121500         05  FILLER   PIC X(57)  VALUE
121600     '775 005625 021       023       VAGINAL DELIVERY W/O COMPL'.
121700         05  FILLER   PIC X(57)  VALUE
121800     '776 007075 025       034       POSTPARTUM & POST ABORTION'.
121900         05  FILLER   PIC X(57)  VALUE
122000     '777 009550 016       021       ECTOPIC PREGNANCY         '.
122100         05  FILLER   PIC X(57)  VALUE
122200     '778 005247 019       029       THREATENED ABORTION       '.
122300         05  FILLER   PIC X(57)  VALUE
122400     '779 004843 015       018       ABORTION W/O D&C          '.
122500         05  FILLER   PIC X(57)  VALUE
122600     '780 002515 012       014       FALSE LABOR               '.
122700         05  FILLER   PIC X(57)  VALUE
122800     '781 007568 027       039       OTHER ANTEPARTUM DIAGNOSES'.
122900         05  FILLER   PIC X(57)  VALUE
123000     '782 004463 016       023       OTHER ANTEPARTUM DIAGNOSES'.
123100         05  FILLER   PIC X(57)  VALUE
123200     '789 015258 018       018       NEONATES, DIED OR TRANSFER'.
123300         05  FILLER   PIC X(57)  VALUE
123400     '790 050315 179       179       EXTREME IMMATURITY OR RESP'.
123500         05  FILLER   PIC X(57)  VALUE
123600     '791 034363 133       133       PREMATURITY W MAJOR PROBLE'.
123700         05  FILLER   PIC X(57)  VALUE
123800     '792 020734 086       086       PREMATURITY W/O MAJOR PROB'.
123900         05  FILLER   PIC X(57)  VALUE
124000     '793 035299 047       047       FULL TERM NEONATE W MAJOR '.
124100         05  FILLER   PIC X(57)  VALUE
124200     '794 012494 034       034       NEONATE W OTHER SIGNIFICAN'.
124300         05  FILLER   PIC X(57)  VALUE
124400     '795 001692 031       031       NORMAL NEWBORN            '.
124500         05  FILLER   PIC X(57)  VALUE
124600     '799 050639 099       129       SPLENECTOMY W MCC         '.
124700         05  FILLER   PIC X(57)  VALUE
124800     '800 025234 052       068       SPLENECTOMY W CC          '.
124900         05  FILLER   PIC X(57)  VALUE
125000     '801 015980 028       035       SPLENECTOMY W/O CC/MCC    '.
125100         05  FILLER   PIC X(57)  VALUE
125200     '802 031642 077       104       OTHER O.R. PROC OF THE BLO'.
125300         05  FILLER   PIC X(57)  VALUE
125400     '803 018831 047       063       OTHER O.R. PROC OF THE BLO'.
125500         05  FILLER   PIC X(57)  VALUE
125600     '804 011558 023       030       OTHER O.R. PROC OF THE BLO'.
125700         05  FILLER   PIC X(57)  VALUE
125800     '808 022217 061       081       MAJOR HEMATOL/IMMUN DIAG E'.
125900         05  FILLER   PIC X(57)  VALUE
126000     '809 011901 038       048       MAJOR HEMATOL/IMMUN DIAG E'.
126100         05  FILLER   PIC X(57)  VALUE
126200     '810 008226 027       033       MAJOR HEMATOL/IMMUN DIAG E'.
126300         05  FILLER   PIC X(57)  VALUE
126400     '811 012488 036       048       RED BLOOD CELL DISORDERS W'.
126500         05  FILLER   PIC X(57)  VALUE
126600     '812 007985 026       034       RED BLOOD CELL DISORDERS W'.
126700         05  FILLER   PIC X(57)  VALUE
126800     '813 016433 036       050       COAGULATION DISORDERS     '.
126900         05  FILLER   PIC X(57)  VALUE
127000     '814 016910 049       068       RETICULOENDOTHELIAL & IMMU'.
127100         05  FILLER   PIC X(57)  VALUE
127200     '815 009844 033       042       RETICULOENDOTHELIAL & IMMU'.
127300         05  FILLER   PIC X(57)  VALUE
127400     '816 006655 024       029       RETICULOENDOTHELIAL & IMMU'.
127500         05  FILLER   PIC X(57)  VALUE
127600     '820 058779 130       171       LYMPHOMA & LEUKEMIA W MAJO'.
127700         05  FILLER   PIC X(57)  VALUE
127800     '821 024025 048       069       LYMPHOMA & LEUKEMIA W MAJO'.
127900         05  FILLER   PIC X(57)  VALUE
128000     '822 012336 022       028       LYMPHOMA & LEUKEMIA W MAJO'.
128100         05  FILLER   PIC X(57)  VALUE
128200     '823 044850 113       147       LYMPHOMA & NON-ACUTE LEUKE'.
128300         05  FILLER   PIC X(57)  VALUE
128400     '824 021684 059       077       LYMPHOMA & NON-ACUTE LEUKE'.
128500         05  FILLER   PIC X(57)  VALUE
128600     '825 012935 029       040       LYMPHOMA & NON-ACUTE LEUKE'.
128700         05  FILLER   PIC X(57)  VALUE
128800     '826 049280 108       140       MYELOPROLIF DISORD OR POOR'.
128900         05  FILLER   PIC X(57)  VALUE
129000     '827 022746 053       068       MYELOPROLIF DISORD OR POOR'.
129100         05  FILLER   PIC X(57)  VALUE
129200     '828 013642 027       033       MYELOPROLIF DISORD OR POOR'.
129300         05  FILLER   PIC X(57)  VALUE
129400     '829 031769 067       102       MYELOPROLIF DISORD OR POOR'.
129500         05  FILLER   PIC X(57)  VALUE
129600     '830 012781 024       031       MYELOPROLIF DISORD OR POOR'.
129700         05  FILLER   PIC X(57)  VALUE
129800     '834 053828 103       168       ACUTE LEUKEMIA W/O MAJOR O'.
129900         05  FILLER   PIC X(57)  VALUE
130000     '835 021606 046       075       ACUTE LEUKEMIA W/O MAJOR O'.
130100         05  FILLER   PIC X(57)  VALUE
130200     '836 012240 029       043       ACUTE LEUKEMIA W/O MAJOR O'.
130300         05  FILLER   PIC X(57)  VALUE
130400     '837 060485 156       212       CHEMO W ACUTE LEUKEMIA AS '.
130500         05  FILLER   PIC X(57)  VALUE
130600     '838 028181 067       097       CHEMO W ACUTE LEUKEMIA AS '.
130700         05  FILLER   PIC X(57)  VALUE
130800     '839 013175 048       055       CHEMO W ACUTE LEUKEMIA AS '.
130900         05  FILLER   PIC X(57)  VALUE
131000     '840 030843 075       105  Y    LYMPHOMA & NON-ACUTE LEUKE'.
131100         05  FILLER   PIC X(57)  VALUE
131200     '841 016167 048       063  Y    LYMPHOMA & NON-ACUTE LEUKE'.
131300         05  FILLER   PIC X(57)  VALUE
131400     '842 010830 031       041  Y    LYMPHOMA & NON-ACUTE LEUKE'.
131500         05  FILLER   PIC X(57)  VALUE
131600     '843 017768 053       072       OTHER MYELOPROLIF DIS OR P'.
131700         05  FILLER   PIC X(57)  VALUE
131800     '844 011701 041       053       OTHER MYELOPROLIF DIS OR P'.
131900         05  FILLER   PIC X(57)  VALUE
132000     '845 007830 028       037       OTHER MYELOPROLIF DIS OR P'.
132100         05  FILLER   PIC X(57)  VALUE
132200     '846 024337 057       082       CHEMOTHERAPY W/O ACUTE LEU'.
132300         05  FILLER   PIC X(57)  VALUE
132400     '847 011062 030       036       CHEMOTHERAPY W/O ACUTE LEU'.
132500         05  FILLER   PIC X(57)  VALUE
132600     '848 008635 025       030       CHEMOTHERAPY W/O ACUTE LEU'.
132700         05  FILLER   PIC X(57)  VALUE
132800     '849 014239 046       060       RADIOTHERAPY              '.
132900         05  FILLER   PIC X(57)  VALUE
133000     '853 053491 111       143  Y    INFECTIOUS & PARASITIC DIS'.
133100         05  FILLER   PIC X(57)  VALUE
133200     '854 024891 070       085  Y    INFECTIOUS & PARASITIC DIS'.
133300         05  FILLER   PIC X(57)  VALUE
133400     '855 015849 036       049  Y    INFECTIOUS & PARASITIC DIS'.
133500         05  FILLER   PIC X(57)  VALUE
133600     '856 047874 101       134  Y    POSTOPERATIVE OR POST-TRAU'.
133700         05  FILLER   PIC X(57)  VALUE
133800     '857 020412 057       071  Y    POSTOPERATIVE OR POST-TRAU'.
133900         05  FILLER   PIC X(57)  VALUE
134000     '858 013115 039       048  Y    POSTOPERATIVE OR POST-TRAU'.
134100         05  FILLER   PIC X(57)  VALUE
134200     '862 018903 056       074  Y    POSTOPERATIVE & POST-TRAUM'.
134300         05  FILLER   PIC X(57)  VALUE
134400     '863 009845 038       046  Y    POSTOPERATIVE & POST-TRAUM'.
134500         05  FILLER   PIC X(57)  VALUE
134600     '864 008441 029       036       FEVER                     '.
134700         05  FILLER   PIC X(57)  VALUE
134800     '865 017351 049       068       VIRAL ILLNESS W MCC       '.
134900         05  FILLER   PIC X(57)  VALUE
135000     '866 007855 029       035       VIRAL ILLNESS W/O MCC     '.
135100         05  FILLER   PIC X(57)  VALUE
135200     '867 026139 068       092  Y    OTHER INFECTIOUS & PARASIT'.
135300         05  FILLER   PIC X(57)  VALUE
135400     '868 010775 040       050  Y    OTHER INFECTIOUS & PARASIT'.
135500         05  FILLER   PIC X(57)  VALUE
135600     '869 007406 029       035  Y    OTHER INFECTIOUS & PARASIT'.
135700         05  FILLER   PIC X(57)  VALUE
135800     '870 059187 125       146  Y    SEPTICEMIA OR SEVERE SEPSI'.
135900         05  FILLER   PIC X(57)  VALUE
136000     '871 018527 051       067  Y    SEPTICEMIA OR SEVERE SEPSI'.
136100         05  FILLER   PIC X(57)  VALUE
136200     '872 010687 041       049  Y    SEPTICEMIA OR SEVERE SEPSI'.
136300         05  FILLER   PIC X(57)  VALUE
136400     '876 028172 075       123       O.R. PROCEDURE W PRINCIPAL'.
136500         05  FILLER   PIC X(57)  VALUE
136600     '880 006388 022       029       ACUTE ADJUSTMENT REACTION '.
136700         05  FILLER   PIC X(57)  VALUE
136800     '881 006541 032       044       DEPRESSIVE NEUROSES       '.
136900         05  FILLER   PIC X(57)  VALUE
137000     '882 006953 032       044       NEUROSES EXCEPT DEPRESSIVE'.
137100         05  FILLER   PIC X(57)  VALUE
137200     '883 012682 047       077       DISORDERS OF PERSONALITY &'.
137300         05  FILLER   PIC X(57)  VALUE
137400     '884 010060 040       057  Y    ORGANIC DISTURBANCES & MEN'.
137500         05  FILLER   PIC X(57)  VALUE
137600     '885 010048 054       073       PSYCHOSES                 '.
137700         05  FILLER   PIC X(57)  VALUE
137800     '886 009173 042       071       BEHAVIORAL & DEVELOPMENTAL'.
137900         05  FILLER   PIC X(57)  VALUE
138000     '887 009795 029       045       OTHER MENTAL DISORDER DIAG'.
138100         05  FILLER   PIC X(57)  VALUE
138200     '894 004509 021       029       ALCOHOL/DRUG ABUSE OR DEPE'.
138300         05  FILLER   PIC X(57)  VALUE
138400     '895 011939 091       117       ALCOHOL/DRUG ABUSE OR DEPE'.
138500         05  FILLER   PIC X(57)  VALUE
138600     '896 015146 047       065  Y    ALCOHOL/DRUG ABUSE OR DEPE'.
138700         05  FILLER   PIC X(57)  VALUE
138800     '897 006824 032       040  Y    ALCOHOL/DRUG ABUSE OR DEPE'.
138900         05  FILLER   PIC X(57)  VALUE
139000     '901 040316 093       139       WOUND DEBRIDEMENTS FOR INJ'.
139100         05  FILLER   PIC X(57)  VALUE
139200     '902 017077 049       066       WOUND DEBRIDEMENTS FOR INJ'.
139300         05  FILLER   PIC X(57)  VALUE
139400     '903 010527 031       042       WOUND DEBRIDEMENTS FOR INJ'.
139500         05  FILLER   PIC X(57)  VALUE
139600     '904 031738 072       107       SKIN GRAFTS FOR INJURIES W'.
139700         05  FILLER   PIC X(57)  VALUE
139800     '905 012475 032       043       SKIN GRAFTS FOR INJURIES W'.
139900         05  FILLER   PIC X(57)  VALUE
140000     '906 012228 024       035       HAND PROCEDURES FOR INJURI'.
140100         05  FILLER   PIC X(57)  VALUE
140200     '907 039235 077       107  Y    OTHER O.R. PROCEDURES FOR '.
140300         05  FILLER   PIC X(57)  VALUE
140400     '908 019485 044       058  Y    OTHER O.R. PROCEDURES FOR '.
140500         05  FILLER   PIC X(57)  VALUE
140600     '909 012150 025       032  Y    OTHER O.R. PROCEDURES FOR '.
140700         05  FILLER   PIC X(57)  VALUE
140800     '913 011683 037       050       TRAUMATIC INJURY W MCC    '.
140900         05  FILLER   PIC X(57)  VALUE
141000     '914 007110 025       031       TRAUMATIC INJURY W/O MCC  '.
141100         05  FILLER   PIC X(57)  VALUE
141200     '915 014721 036       049       ALLERGIC REACTIONS W MCC  '.
141300         05  FILLER   PIC X(57)  VALUE
141400     '916 005139 017       021       ALLERGIC REACTIONS W/O MCC'.
141500         05  FILLER   PIC X(57)  VALUE
141600     '917 014093 035       048  Y    POISONING & TOXIC EFFECTS '.
141700         05  FILLER   PIC X(57)  VALUE
141800     '918 006346 021       027  Y    POISONING & TOXIC EFFECTS '.
141900         05  FILLER   PIC X(57)  VALUE
142000     '919 017206 044       061       COMPLICATIONS OF TREATMENT'.
142100         05  FILLER   PIC X(57)  VALUE
142200     '920 009779 031       040       COMPLICATIONS OF TREATMENT'.
142300         05  FILLER   PIC X(57)  VALUE
142400     '921 006522 022       028       COMPLICATIONS OF TREATMENT'.
142500         05  FILLER   PIC X(57)  VALUE
142600     '922 015088 040       056       OTHER INJURY, POISONING & '.
142700         05  FILLER   PIC X(57)  VALUE
142800     '923 006620 022       029       OTHER INJURY, POISONING & '.
142900         05  FILLER   PIC X(57)  VALUE
143000     '927 164534 223       307       EXTENSIVE BURNS OR FULL TH'.
143100         05  FILLER   PIC X(57)  VALUE
143200     '928 057744 119       161       FULL THICKNESS BURN W SKIN'.
143300         05  FILLER   PIC X(57)  VALUE
143400     '929 022090 051       072       FULL THICKNESS BURN W SKIN'.
143500         05  FILLER   PIC X(57)  VALUE
143600     '933 032785 026       082       EXTENSIVE BURNS OR FULL TH'.
143700         05  FILLER   PIC X(57)  VALUE
143800     '934 016045 042       061       FULL THICKNESS BURN W/O SK'.
143900         05  FILLER   PIC X(57)  VALUE
144000     '935 013909 032       048       NON-EXTENSIVE BURNS       '.
144100         05  FILLER   PIC X(57)  VALUE
144200     '939 031182 066       098       O.R. PROC W DIAGNOSES OF O'.
144300         05  FILLER   PIC X(57)  VALUE
144400     '940 017675 037       053       O.R. PROC W DIAGNOSES OF O'.
144500         05  FILLER   PIC X(57)  VALUE
144600     '941 013403 022       028       O.R. PROC W DIAGNOSES OF O'.
144700         05  FILLER   PIC X(57)  VALUE
144800     '945 013804 083       101  Y    REHABILITATION W CC/MCC   '.
144900         05  FILLER   PIC X(57)  VALUE
145000     '946 012037 065       074  Y    REHABILITATION W/O CC/MCC '.
145100         05  FILLER   PIC X(57)  VALUE
145200     '947 011324 036       048  Y    SIGNS & SYMPTOMS W MCC    '.
145300         05  FILLER   PIC X(57)  VALUE
145400     '948 006897 026       033  Y    SIGNS & SYMPTOMS W/O MCC  '.
145500         05  FILLER   PIC X(57)  VALUE
145600     '949 010038 028       041       AFTERCARE W CC/MCC        '.
145700         05  FILLER   PIC X(57)  VALUE
145800     '950 006005 023       035       AFTERCARE W/O CC/MCC      '.
145900         05  FILLER   PIC X(57)  VALUE
146000     '951 008578 024       055       OTHER FACTORS INFLUENCING '.
146100         05  FILLER   PIC X(57)  VALUE
146200     '955 054056 072       106       CRANIOTOMY FOR MULTIPLE SI'.
146300         05  FILLER   PIC X(57)  VALUE
146400     '956 038321 068       083  Y    LIMB REATTACHMENT, HIP & F'.
146500         05  FILLER   PIC X(57)  VALUE
146600     '957 067306 097       139       OTHER O.R. PROCEDURES FOR '.
146700         05  FILLER   PIC X(57)  VALUE
146800     '958 038734 073       089       OTHER O.R. PROCEDURES FOR '.
146900         05  FILLER   PIC X(57)  VALUE
147000     '959 025391 043       054       OTHER O.R. PROCEDURES FOR '.
147100         05  FILLER   PIC X(57)  VALUE
147200     '963 026733 055       081       OTHER MULTIPLE SIGNIFICANT'.
147300         05  FILLER   PIC X(57)  VALUE
147400     '964 013904 041       050       OTHER MULTIPLE SIGNIFICANT'.
147500         05  FILLER   PIC X(57)  VALUE
147600     '965 009824 030       036       OTHER MULTIPLE SIGNIFICANT'.
147700         05  FILLER   PIC X(57)  VALUE
147800     '969 054896 120       167       HIV W EXTENSIVE O.R. PROCE'.
147900         05  FILLER   PIC X(57)  VALUE
148000     '970 022785 049       071       HIV W EXTENSIVE O.R. PROCE'.
148100         05  FILLER   PIC X(57)  VALUE
148200     '974 026335 067       093       HIV W MAJOR RELATED CONDIT'.
148300         05  FILLER   PIC X(57)  VALUE
148400     '975 013383 047       061       HIV W MAJOR RELATED CONDIT'.
148500         05  FILLER   PIC X(57)  VALUE
148600     '976 008627 033       042       HIV W MAJOR RELATED CONDIT'.
148700         05  FILLER   PIC X(57)  VALUE
148800     '977 011194 036       048       HIV W OR W/O OTHER RELATED'.
148900         05  FILLER   PIC X(57)  VALUE
149000     '981 049319 101       131  Y    EXTENSIVE O.R. PROCEDURE U'.
149100         05  FILLER   PIC X(57)  VALUE
149200     '982 028504 059       076  Y    EXTENSIVE O.R. PROCEDURE U'.
149300         05  FILLER   PIC X(57)  VALUE
149400     '983 017462 028       038  Y    EXTENSIVE O.R. PROCEDURE U'.
149500         05  FILLER   PIC X(57)  VALUE
149600     '984 034143 093       125       PROSTATIC O.R. PROCEDURE U'.
149700         05  FILLER   PIC X(57)  VALUE
149800     '985 018859 051       072       PROSTATIC O.R. PROCEDURE U'.
149900         05  FILLER   PIC X(57)  VALUE
150000     '986 010389 021       030       PROSTATIC O.R. PROCEDURE U'.
150100         05  FILLER   PIC X(57)  VALUE
150200     '987 033422 084       112  Y    NON-EXTENSIVE O.R. PROC UN'.
150300         05  FILLER   PIC X(57)  VALUE
150400     '988 017554 048       064  Y    NON-EXTENSIVE O.R. PROC UN'.
150500         05  FILLER   PIC X(57)  VALUE
150600     '989 010430 023       030  Y    NON-EXTENSIVE O.R. PROC UN'.
150700         05  FILLER   PIC X(57)  VALUE
150800     '998 000000 000       000       PRINCIPAL DIAGNOSIS INVALI'.
150900         05  FILLER   PIC X(57)  VALUE
151000     '999 000000 000       000       UNGROUPABLE               '.
151100     02  WK-DRG-DATA2 REDEFINES WK-DRG-DATA.
151200         05  DRG-TAB OCCURS 751
151300                     ASCENDING KEY IS WK-DRG-DRGX
151400                     INDEXED BY DRG-IDX.
151500             10  DRG-DATA-TAB.
151600               15  WK-DRG-DRGX               PIC X(03).
151700               15  FILLER1                   PIC X(01).
151800               15  DRG-WEIGHT                PIC 9(02)V9(04).
151900               15  FILLER2                   PIC X(01).
152000               15  DRG-GMALOS                PIC 9(02)V9(01).
152100               15  FILLER3                   PIC X(05).
152200               15  DRG-LOW                   PIC X(01).
152300               15  FILLER5                   PIC X(01).
152400               15  DRG-ARITH-ALOS            PIC 9(02)V9(01).
152500               15  FILLER6                   PIC X(02).
152600               15  DRG-PAC                   PIC X(01).
152700               15  FILLER7                   PIC X(01).
152800               15  DRG-SPPAC                 PIC X(01).
152900               15  FILLER8                   PIC X(02).
153000               15  DRG-DESC                  PIC X(26).
