016600 01  DRG-TABLE.                                                   01640000
016700     05  D-TAB.                                                   01650000
016800         10  FILLER                  PIC X(08) VALUE
016900       '20121001'.
017000         10  FILLER                  PIC X(56) VALUE
017100       '26029529400385139131155001971773692820034510883320900255'.
017200         10  FILLER                  PIC X(56) VALUE
017300       '10989416000217047178080000890961271470018205111009800114'.
017400         10  FILLER                  PIC X(56) VALUE
017500       '00000000000000038954080000860484341190014903157608500100'.
017600         10  FILLER                  PIC X(56) VALUE
017700       '01956605600065105255186002580000000000000006093217900199'.
017800         10  FILLER                  PIC X(56) VALUE
017900       '04581711000142000000000000000000000000000009101614500176'.
018000         10  FILLER                  PIC X(56) VALUE
018100       '06640011800135045056065000800523780790011103527904300065'.
018200         10  FILLER                  PIC X(56) VALUE
018300       '04595808100105029555053000680216310280003605602809900129'.
018400         10  FILLER                  PIC X(56) VALUE
018500       '02927704700064017854024000320426450850012002034803600053'.
018600         10  FILLER                  PIC X(56) VALUE
018700       '01438102000026036918047000700219650210003201661001300015'.
018800         10  FILLER                  PIC X(56) VALUE
018900       '03187005600083015741024000350102850140001603868008900117'.
019000         10  FILLER                  PIC X(56) VALUE
019100       '02133005000064017744026000340000000000000000000000000000'.
019200         10  FILLER                  PIC X(56) VALUE
019300       '00000000000000000000000000000000000000000000000000000000'.
019400         10  FILLER                  PIC X(56) VALUE
019500       '00000000000000000000000000000000000000000001490304300058'.
019600         10  FILLER                  PIC X(56) VALUE
019700       '00904602900035013962042000570104860320004301719405400071'.
019800         10  FILLER                  PIC X(56) VALUE
019900       '00968003600047016472054000700100880390004700780703100036'.
020000         10  FILLER                  PIC X(56) VALUE
020100       '02866806000078019551045000520153660320003701842404800066'.
020200         10  FILLER                  PIC X(56) VALUE
020300       '01134503700045008135026000310150740410005400889902600032'.
020400         10  FILLER                  PIC X(56) VALUE
020500       '00744902200027017056051000680101740370004700750602500030'.
020600         10  FILLER                  PIC X(56) VALUE
020700       '01282004100054008837031000400176110550007000894703200039'.
020800         10  FILLER                  PIC X(56) VALUE
020900       '01642604800060009790032000400072970240002901261603700052'.
021000         10  FILLER                  PIC X(56) VALUE
021100       '00741602700034019249033000560134580340004500869602200027'.
021200         10  FILLER                  PIC X(56) VALUE
021300       '02038705000068011874034000430076050220002701568704100053'.
021400         10  FILLER                  PIC X(56) VALUE
021500       '00979102700034007218018000220165830430006000921403100040'.
021600         10  FILLER                  PIC X(56) VALUE
021700       '00693802300028035656089001150246270630007902015804400055'.
021800         10  FILLER                  PIC X(56) VALUE
021900       '03371408900115018418061000770124270410004901557004300058'.
022000         10  FILLER                  PIC X(56) VALUE
022100       '00764302600033010209030000410068930230002900000000000000'.
022200         10  FILLER                  PIC X(56) VALUE
022300       '00000000000000000000000000000000000000000000000000000000'.
022400         10  FILLER                  PIC X(56) VALUE
022500       '00000000000000000000000000000000000000000000000000000000'.
022600         10  FILLER                  PIC X(56) VALUE
022700       '01858704100056009589022000290124070340004501502203500051'.
022800         10  FILLER                  PIC X(56) VALUE
022900       '00723401700023000000000000000000000000000000000000000000'.
023000         10  FILLER                  PIC X(56) VALUE
023100       '00958903900049006533032000390075420220002701188503600049'.
023200         10  FILLER                  PIC X(56) VALUE
023300       '00685002500032000000000000000000000000000000000000000000'.
023400         10  FILLER                  PIC X(56) VALUE
023500       '02150003700054012065023000290234430420006101236202100027'.
023600         10  FILLER                  PIC X(56) VALUE
023700       '01781803600054009177018000220200020400005901069701800023'.
023800         10  FILLER                  PIC X(56) VALUE
023900       '01319203800050007388019000230089220140001800000000000000'.
024000         10  FILLER                  PIC X(56) VALUE
024100       '00000000000000000000000000000000000000000000000000000000'.
024200         10  FILLER                  PIC X(56) VALUE
024300       '00000000000000022347063000910124860390005400748802400032'.
024400         10  FILLER                  PIC X(56) VALUE
024500       '00646202100025013890038000520064580220002801016603400044'.
024600         10  FILLER                  PIC X(56) VALUE
024700       '00660502500031014138043000570091370320004100634902300028'.
024800         10  FILLER                  PIC X(56) VALUE
024900       '01601004700066008988032000410059690210002600000000000000'.
025000         10  FILLER                  PIC X(56) VALUE
025100       '00000000000000000000000000000511931130013702619105800070'.
025200         10  FILLER                  PIC X(56) VALUE
025300       '01792203500041037513091001150200430540006801315303100041'.
025400         10  FILLER                  PIC X(56) VALUE
025500       '00000000000000000000000000000000000000000000000000000000'.
025600         10  FILLER                  PIC X(56) VALUE
025700       '00000000000000000000000000000158700550006601037903900046'.
025800         10  FILLER                  PIC X(56) VALUE
025900       '02054906600082014403053000640097990380004601756705600073'.
026000         10  FILLER                  PIC X(56) VALUE
026100       '01210803900051008275027000340148040500006201017103500042'.
026200         10  FILLER                  PIC X(56) VALUE
026300       '00696102400029015746049000640111690370004700754402600033'.
026400         10  FILLER                  PIC X(56) VALUE
026500       '01246104100052011860043000530095210360004400707202900034'.
026600         10  FILLER                  PIC X(56) VALUE
026700       '01489305100063009996039000470070780300003501682005500069'.
026800         10  FILLER                  PIC X(56) VALUE
026900       '01120903900048007879029000360189150610007801024203500045'.
027000         10  FILLER                  PIC X(56) VALUE
027100       '00679202600033008704033000400062280250003000682202100027'.
027200         10  FILLER                  PIC X(56) VALUE
027300       '01380904000053007763025000320536191250014602289905100070'.
027400         10  FILLER                  PIC X(56) VALUE
027500       '00000000000000000000000000000000000000000000000000000000'.
027600         10  FILLER                  PIC X(56) VALUE
027700       '00000000000000000000000000001410360850015009519013800164'.
027800         10  FILLER                  PIC X(56) VALUE
027900       '06349509000102053429065000740783901030012505243806800075'.
028000         10  FILLER                  PIC X(56) VALUE
028100       '04423205100056085506099001200610650440005907675808100100'.
028200         10  FILLER                  PIC X(56) VALUE
028300       '05760504000050067354061000870518860210003107081511200134'.
028400         10  FILLER                  PIC X(56) VALUE
028500       '04627907100080038111048000560752971030012105715108300091'.
028600         10  FILLER                  PIC X(56) VALUE
028700       '07229211900134048413081000870580140920010703777706000065'.
028800         10  FILLER                  PIC X(56) VALUE
028900       '05117007100100031863027000390461941110014102653107400091'.
029000         10  FILLER                  PIC X(56) VALUE
029100       '01482504700057037314061000780262040370004702062402300028'.
029200         10  FILLER                  PIC X(56) VALUE
029300       '04254002900043031566038000520199110200002503000304700064'.
029400         10  FILLER                  PIC X(56) VALUE
029500       '01796102300029029988052000710192370220003003022405300078'.
029600         10  FILLER                  PIC X(56) VALUE
029700       '02473904400059016609021000270243810670008801593405500068'.
029800         10  FILLER                  PIC X(56) VALUE
029900       '00953503200042026945050000650185900250003303662407700105'.
030000         10  FILLER                  PIC X(56) VALUE
030100       '01676903400044012343021000270190910380005902667405600083'.
030200         10  FILLER                  PIC X(56) VALUE
030300       '02439402500038000000000000000000000000000000000000000000'.
030400         10  FILLER                  PIC X(56) VALUE
030500       '00000000000000000000000000000000000000000000000000000000'.
030600         10  FILLER                  PIC X(56) VALUE
030700       '00000000000000000000000000000000000000000000000000000000'.
030800         10  FILLER                  PIC X(56) VALUE
030900       '00000000000000000000000000000000000000000001799904900063'.
031000         10  FILLER                  PIC X(56) VALUE
031100       '01096103200040007736021000260175390320005100804201900026'.
031200         10  FILLER                  PIC X(56) VALUE
031300       '00535301400017020617049000660107090240003102822907900099'.
031400         10  FILLER                  PIC X(56) VALUE
031500       '01814505900072012092041000500151740470006001003403800046'.
031600         10  FILLER                  PIC X(56) VALUE
031700       '00675102700032010229042000510064760350004001287801900028'.
031800         10  FILLER                  PIC X(56) VALUE
031900       '00645501300015004571011000120141860450005800967903700046'.
032000         10  FILLER                  PIC X(56) VALUE
032100       '00667902700034010142029000390057730190002301050303400044'.
032200         10  FILLER                  PIC X(56) VALUE
032300       '00618702100026013122040000520078400260003301228503900050'.
032400         10  FILLER                  PIC X(56) VALUE
032500       '00809802800035005541020000230052070180002200733902400029'.
032600         10  FILLER                  PIC X(56) VALUE
032700       '00561701700021018508049000670095270310004000622402000025'.
032800         10  FILLER                  PIC X(56) VALUE
032900       '00000000000000000000000000000000000000000000000000000000'.
033000         10  FILLER                  PIC X(56) VALUE
033100       '00000000000000000000000000000000000000000000000000000000'.
033200         10  FILLER                  PIC X(56) VALUE
033300       '00000000000000056118120001540268110630008201441302500033'.
033400         10  FILLER                  PIC X(56) VALUE
033500       '05259912100149025731074000860163610450005004614311200134'.
033600         10  FILLER                  PIC X(56) VALUE
033700       '02481406700078016181040000460431461120013402352907000084'.
033800         10  FILLER                  PIC X(56) VALUE
033900       '01553804000050032008083001000186750540006401202403000036'.
034000         10  FILLER                  PIC X(56) VALUE
034100       '02311604800066013516029000370095470160001903409409000115'.
034200         10  FILLER                  PIC X(56) VALUE
034300       '01712305600066011608039000440251690640008601390004200054'.
034400         10  FILLER                  PIC X(56) VALUE
034500       '00834302300028025082059000780137550340004400904302000024'.
034600         10  FILLER                  PIC X(56) VALUE
034700       '02819206300082015976040000500111720240002903946308900120'.
034800         10  FILLER                  PIC X(56) VALUE
034900       '02174705500071013629031000400000000000000000000000000000'.
035000         10  FILLER                  PIC X(56) VALUE
035100       '00000000000000000000000000000000000000000000000000000000'.
035200         10  FILLER                  PIC X(56) VALUE
035300       '00000000000000000000000000000000000000000001832705100066'.
035400         10  FILLER                  PIC X(56) VALUE
035500       '01066403500042007593025000300202000650008401227504900059'.
035600         10  FILLER                  PIC X(56) VALUE
035700       '00840103600043021284063000850127380430005500880902800035'.
035800         10  FILLER                  PIC X(56) VALUE
035900       '01781704900063010168034000400070150240002901931105600072'.
036000         10  FILLER                  PIC X(56) VALUE
036100       '01113003700046007917028000340133840440005600836502900035'.
036200         10  FILLER                  PIC X(56) VALUE
036300       '01907806300083010505041000510078780310003801656405400071'.
036400         10  FILLER                  PIC X(56) VALUE
036500       '00921703700046006372027000320118970390005100737502800034'.
036600         10  FILLER                  PIC X(56) VALUE
036700       '01666604800066009837035000440067910240003000000000000000'.
036800         10  FILLER                  PIC X(56) VALUE
036900       '00000000000000000000000000000000000000000000000000000000'.
037000         10  FILLER                  PIC X(56) VALUE
037100       '00000000000000000000000000000000000000000000000000000000'.
037200         10  FILLER                  PIC X(56) VALUE
037300       '05557511300152027303062000790182800410005003837510300128'.
037400         10  FILLER                  PIC X(56) VALUE
037500       '02268006900083016875048000570380400970011702598907000082'.
037600         10  FILLER                  PIC X(56) VALUE
037700       '01858204600053035643090001090207280600006901335403700044'.
037800         10  FILLER                  PIC X(56) VALUE
037900       '02518906100077017007042000510120500250003003850908700123'.
038000         10  FILLER                  PIC X(56) VALUE
038100       '01738104600062013006032000400433081020013602408106300083'.
038200         10  FILLER                  PIC X(56) VALUE
038300       '01575603800049000000000000000000000000000000000000000000'.
038400         10  FILLER                  PIC X(56) VALUE
038500       '00000000000000000000000000000000000000000001679204800063'.
038600         10  FILLER                  PIC X(56) VALUE
038700       '00931603400042006343026000320178160540007101193404000052'.
038800         10  FILLER                  PIC X(56) VALUE
038900       '00953702800036017844053000720096030370004600679002800033'.
039000         10  FILLER                  PIC X(56) VALUE
039100       '01876705100070009545035000440064730260003201603904700062'.
039200         10  FILLER                  PIC X(56) VALUE
039300       '01072003500043007583024000300000000000000000000000000000'.
039400         10  FILLER                  PIC X(56) VALUE
039500       '00000000000000000000000000000000000000000000000000000000'.
039600         10  FILLER                  PIC X(56) VALUE
039700       '10595210100126077979053000630587050310003609520410600131'.
039800         10  FILLER                  PIC X(56) VALUE
039900       '06417105600065049491033000370653900730009103878303100036'.
040000         10  FILLER                  PIC X(56) VALUE
040100       '04906206400077033745035000380544431090015102940606500082'.
040200         10  FILLER                  PIC X(56) VALUE
040300       '01880203900050050078070000870325160410004602607003100033'.
040400         10  FILLER                  PIC X(56) VALUE
040500       '03419606400076020953032000350470750650009002804102500036'.
040600         10  FILLER                  PIC X(56) VALUE
040700       '02125401500018035676089001160200710590007401017103000039'.
040800         10  FILLER                  PIC X(56) VALUE
040900       '03268108900110022663055000680169220320004103036707200085'.
041000         10  FILLER                  PIC X(56) VALUE
041100       '01934504900053015660040000430253140290003502095001900021'.
041200         10  FILLER                  PIC X(56) VALUE
041300       '03058308600103020808058000680148630420004901686503500043'.
041400         10  FILLER                  PIC X(56) VALUE
041500       '01248602400028018154032000450103540170002103103906700083'.
041600         10  FILLER                  PIC X(56) VALUE
041700       '01931004000048013938026000310299770750009801630604000052'.
041800         10  FILLER                  PIC X(56) VALUE
041900       '01120202000025021304053000720101060210002603136807800102'.
042000         10  FILLER                  PIC X(56) VALUE
042100       '01594004500057010670024000290230060680008701564104800059'.
042200         10  FILLER                  PIC X(56) VALUE
042300       '01147802600032013003030000400186890400005601207101800022'.
042400         10  FILLER                  PIC X(56) VALUE
042500       '01349402600037022963050000630152220320003801120101900022'.
042600         10  FILLER                  PIC X(56) VALUE
042700       '01340903600048008655021000260328310770009701974404600056'.
042800         10  FILLER                  PIC X(56) VALUE
042900       '01576702800035000000000000000000000000000000000000000000'.
043000         10  FILLER                  PIC X(56) VALUE
043100       '00000000000000000000000000000000000000000000000000000000'.
043200         10  FILLER                  PIC X(56) VALUE
043300       '00000000000000000000000000000000000000000000000000000000'.
043400         10  FILLER                  PIC X(56) VALUE
043500       '00000000000000000000000000000000000000000000000000000000'.
043600         10  FILLER                  PIC X(56) VALUE
043700       '01472504500061007366030000370127900420005400714603100035'.
043800         10  FILLER                  PIC X(56) VALUE
043900       '00863803400040006405024000280199820660008701269205000061'.
044000         10  FILLER                  PIC X(56) VALUE
044100       '00977003800048020293063000820117490430005400801203300039'.
044200         10  FILLER                  PIC X(56) VALUE
044300       '02478506100087011767041000520075810290003501746505800076'.
044400         10  FILLER                  PIC X(56) VALUE
044500       '01168304600056007723031000380163450500006400853303200039'.
044600         10  FILLER                  PIC X(56) VALUE
044700       '01208704300056006916029000360123480380005100703902600032'.
044800         10  FILLER                  PIC X(56) VALUE
044900       '01561305200065008594035000410187410520007001030003500044'.
045000         10  FILLER                  PIC X(56) VALUE
045100       '00611502000025013989044000560074630300003501445904700062'.
045200         10  FILLER                  PIC X(56) VALUE
045300       '00938603600045006786026000320000000000000000000000000000'.
045400         10  FILLER                  PIC X(56) VALUE
045500       '00000000000000024688075000990149690550006701003603900047'.
045600         10  FILLER                  PIC X(56) VALUE
045700       '03563708600130024469072000950132660400005304245708500129'.
045800         10  FILLER                  PIC X(56) VALUE
045900       '01896303900058011312023000320271860730009601487503700051'.
046000         10  FILLER                  PIC X(56) VALUE
046100       '00991602000025011283020000270089920150001701655003700053'.
046200         10  FILLER                  PIC X(56) VALUE
046300       '01138101800022000000000000000000000000000000000000000000'.
046400         10  FILLER                  PIC X(56) VALUE
046500       '00000000000000000000000000000000000000000001463205300069'.
046600         10  FILLER                  PIC X(56) VALUE
046700       '00991204400053006782032000390188030590007700888003600045'.
046800         10  FILLER                  PIC X(56) VALUE
046900       '01602605400072012280041000550066500230003100996804000050'.
047000         10  FILLER                  PIC X(56) VALUE
047100       '00624703000036014883052000650083920360004301329703900053'.
047200         10  FILLER                  PIC X(56) VALUE
047300       '00755202600032013936042000600068920280003600000000000000'.
047400         10  FILLER                  PIC X(56) VALUE
047500       '00000000000000000000000000000000000000000000000000000000'.
047600         10  FILLER                  PIC X(56) VALUE
047700       '00000000000000023998042000570140360230002704352511500141'.
047800         10  FILLER                  PIC X(56) VALUE
047900       '01971606200075011287040000500348760460007301860102500031'.
048000         10  FILLER                  PIC X(56) VALUE
048100       '01502601600019035668097001280182210590007300966203600044'.
048200         10  FILLER                  PIC X(56) VALUE
048300       '02360604400068012163020000290082170120001403293606800100'.
048400         10  FILLER                  PIC X(56) VALUE
048500       '02144006100074012266031000410000000000000000000000000000'.
048600         10  FILLER                  PIC X(56) VALUE
048700       '00000000000000000000000000000000000000000000000000000000'.
048800         10  FILLER                  PIC X(56) VALUE
048900       '01407004300057008218031000380055580220002701107603400047'.
049000         10  FILLER                  PIC X(56) VALUE
049100       '00692002700034011233033000460170940570007101050804000049'.
049200         10  FILLER                  PIC X(56) VALUE
049300       '00723302800034000000000000000000000000000000000000000000'.
049400         10  FILLER                  PIC X(56) VALUE
049500       '00000000000000000000000000000000000000000003082506000070'.
049600         10  FILLER                  PIC X(56) VALUE
049700       '06164913100160031279079000900209130470005603513607300095'.
049800         10  FILLER                  PIC X(56) VALUE
049900       '01990404600054014836029000320351920790010801882904400058'.
050000         10  FILLER                  PIC X(56) VALUE
050100       '01333502300029029941075001030152950380005201126001600020'.
050200         10  FILLER                  PIC X(56) VALUE
050300       '03073709500119016602045000620087600200002602473106700088'.
050400         10  FILLER                  PIC X(56) VALUE
050500       '01301503100042008326019000240145130370005200838301800023'.
050600         10  FILLER                  PIC X(56) VALUE
050700       '03059106400098021887051000700135580180002500000000000000'.
050800         10  FILLER                  PIC X(56) VALUE
050900       '00000000000000000000000000000000000000000000000000000000'.
051000         10  FILLER                  PIC X(56) VALUE
051100       '00000000000000015862049000650099580380004700643202600031'.
051200         10  FILLER                  PIC X(56) VALUE
051300       '00889902500035016823054000720104990360004700680502200029'.
051400         10  FILLER                  PIC X(56) VALUE
051500       '01178404500055007810032000390156320300004001056301700021'.
051600         10  FILLER                  PIC X(56) VALUE
051700       '01416904000052007017020000240129440420005500663902500031'.
051800         10  FILLER                  PIC X(56) VALUE
051900       '00824602500032015995052000660099980360004500685402600033'.
052000         10  FILLER                  PIC X(56) VALUE
052100       '00000000000000000000000000000000000000000000000000000000'.
052200         10  FILLER                  PIC X(56) VALUE
052300       '00000000000000000000000000000181340300004101293601500017'.
052400         10  FILLER                  PIC X(56) VALUE
052500       '02008704000064012991015000180196310550007800841802300032'.
052600         10  FILLER                  PIC X(56) VALUE
052700       '01323403100044006983016000180191490440006600965601300015'.
052800         10  FILLER                  PIC X(56) VALUE
052900       '01726104500062008657022000300000000000000000000000000000'.
053000         10  FILLER                  PIC X(56) VALUE
053100       '00000000000000016690054000720110660400005100650902000026'.
053200         10  FILLER                  PIC X(56) VALUE
053300       '01297604600059007085027000340140140500006300772103300039'.
053400         10  FILLER                  PIC X(56) VALUE
053500       '01035703400044006113020000250000000000000000000000000000'.
053600         10  FILLER                  PIC X(56) VALUE
053700       '00000000000000026652050000710116820190002304414010700130'.
053800         10  FILLER                  PIC X(56) VALUE
053900       '02004905400064012853030000340332190680009201568803300042'.
054000         10  FILLER                  PIC X(56) VALUE
054100       '01149901800022014157029000390096530170001901557304100059'.
054200         10  FILLER                  PIC X(56) VALUE
054300       '00810901800022013850030000440088180150001800977301400017'.
054400         10  FILLER                  PIC X(56) VALUE
054500       '02575506100086010675024000300000000000000000000000000000'.
054600         10  FILLER                  PIC X(56) VALUE
054700       '00000000000000019833059000810109900380005000577702100027'.
054800         10  FILLER                  PIC X(56) VALUE
054900       '01694506000078010790044000540071730310003700806202800036'.
055000         10  FILLER                  PIC X(56) VALUE
055100       '00495101800022000000000000000000000000000000000000000000'.
055200         10  FILLER                  PIC X(56) VALUE
055300       '01219403800048008586029000310092250250003201830404700058'.
055400         10  FILLER                  PIC X(56) VALUE
055500       '01466803300050006489016000200000000000000000000000000000'.
055600         10  FILLER                  PIC X(56) VALUE
055700       '00000000000000007217026000330057550210002400656502500032'.
055800         10  FILLER                  PIC X(56) VALUE
055900       '00877701900023005049021000310049620160001900189601100012'.
056000         10  FILLER                  PIC X(56) VALUE
056100       '00668702600038004050018000260000000000000000000000000000'.
056200         10  FILLER                  PIC X(56) VALUE
056300       '00000000000000000000000000000000000000000000000000000000'.
056400         10  FILLER                  PIC X(56) VALUE
056500       '01503501800018049579179001790338611330013302043108600086'.
056600         10  FILLER                  PIC X(56) VALUE
056700       '03478304700047012311034000340016670310003100000000000000'.
056800         10  FILLER                  PIC X(56) VALUE
056900       '00000000000000000000000000000514960970012702637205500071'.
057000         10  FILLER                  PIC X(56) VALUE
057100       '01573603000038036452083001140175760440005801121102300031'.
057200         10  FILLER                  PIC X(56) VALUE
057300       '00000000000000000000000000000000000000000002090205900078'.
057400         10  FILLER                  PIC X(56) VALUE
057500       '01176703700047008490027000340125560370005000787202600034'.
057600         10  FILLER                  PIC X(56) VALUE
057700       '01584103600050016794049000660101020350004500691802500031'.
057800         10  FILLER                  PIC X(56) VALUE
057900       '00000000000000000000000000000000000000000005722812700169'.
058000         10  FILLER                  PIC X(56) VALUE
058100       '02306605000069011935022000280453971170014802260306200081'.
058200         10  FILLER                  PIC X(56) VALUE
058300       '01271202700038048680109001400217650530006801340902800034'.
058400         10  FILLER                  PIC X(56) VALUE
058500       '03033506400096011804025000330000000000000000000000000000'.
058600         10  FILLER                  PIC X(56) VALUE
058700       '00000000000000051622099001610221330510008301099202800040'.
058800         10  FILLER                  PIC X(56) VALUE
058900       '06488116700225027537072001020124120470005603010307700105'.
059000         10  FILLER                  PIC X(56) VALUE
059100       '01619204800064010450030000400187190590007901221604300056'.
059200         10  FILLER                  PIC X(56) VALUE
059300       '00861202900038024374057000830104470290003500787802400030'.
059400         10  FILLER                  PIC X(56) VALUE
059500       '01339604600062000000000000000000000000000000000000000000'.
059600         10  FILLER                  PIC X(56) VALUE
059700       '05343111300146025583073000880153310350004904812510500140'.
059800         10  FILLER                  PIC X(56) VALUE
059900       '02064905800074012534038000470000000000000000000000000000'.
060000         10  FILLER                  PIC X(56) VALUE
060100       '00000000000000020099057000760098220380004700844302900037'.
060200         10  FILLER                  PIC X(56) VALUE
060300       '01518104400062007594028000340258610700009401076203900049'.
060400         10  FILLER                  PIC X(56) VALUE
060500       '00741502800035058399126001480188030520006901098804200050'.
060600         10  FILLER                  PIC X(56) VALUE
060700       '00000000000000000000000000000000000000000002709707500122'.
060800         10  FILLER                  PIC X(56) VALUE
060900       '00000000000000000000000000000000000000000000647402200030'.
061000         10  FILLER                  PIC X(56) VALUE
061100       '00635603200043006271031000420136130470008100985003900054'.
061200         10  FILLER                  PIC X(56) VALUE
061300       '00953905400074007812038000610094730310004700000000000000'.
061400         10  FILLER                  PIC X(56) VALUE
061500       '00000000000000000000000000000000000000000000000000000000'.
061600         10  FILLER                  PIC X(56) VALUE
061700       '00000000000000004278021000300109630920011701527104800067'.
061800         10  FILLER                  PIC X(56) VALUE
061900       '00678803200040000000000000000000000000000000000000000000'.
062000         10  FILLER                  PIC X(56) VALUE
062100       '04347709900149017079050000690098900300004002914507000101'.
062200         10  FILLER                  PIC X(56) VALUE
062300       '01263003400046011596024000360385650770010901951904500060'.
062400         10  FILLER                  PIC X(56) VALUE
062500       '01205102600033000000000000000000000000000000000000000000'.
062600         10  FILLER                  PIC X(56) VALUE
062700       '01227303800051006998025000310151680370005100504201700021'.
062800         10  FILLER                  PIC X(56) VALUE
062900       '01454203600049006304021000270166150440006000969303100040'.
063000         10  FILLER                  PIC X(56) VALUE
063100       '00663702200028014305039000570064380220002900000000000000'.
063200         10  FILLER                  PIC X(56) VALUE
063300       '00000000000000000000000000001640262250029604791911200153'.
063400         10  FILLER                  PIC X(56) VALUE
063500       '02242005200073000000000000000000000000000000000000000000'.
063600         10  FILLER                  PIC X(56) VALUE
063700       '02374002500053015123040000570134100330005000000000000000'.
063800         10  FILLER                  PIC X(56) VALUE
063900       '00000000000000000000000000000277690620009101810803600053'.
064000         10  FILLER                  PIC X(56) VALUE
064100       '01177602100027000000000000000000000000000000000000000000'.
064200         10  FILLER                  PIC X(56) VALUE
064300       '01320408300101012530065000740111310360004800701002700033'.
064400         10  FILLER                  PIC X(56) VALUE
064500       '00937202800042005693023000330081050240005900000000000000'.
064600         10  FILLER                  PIC X(56) VALUE
064700       '00000000000000000000000000000541700810011503637206900084'.
064800         10  FILLER                  PIC X(56) VALUE
064900       '06418209900139039004072000910256460470005800000000000000'.
065000         10  FILLER                  PIC X(56) VALUE
065100       '00000000000000000000000000000284830580008501497504400055'.
065200         10  FILLER                  PIC X(56) VALUE
065300       '00960003000036000000000000000000000000000000000000000000'.
065400         10  FILLER                  PIC X(56) VALUE
065500       '05481512000163026631055000740000000000000000000000000000'.
065600         10  FILLER                  PIC X(56) VALUE
065700       '00000000000000025943068000960131420480006200841603300041'.
065800         10  FILLER                  PIC X(56) VALUE
065900       '01051703500047000000000000000000000000000000000000000000'.
066000         10  FILLER                  PIC X(56) VALUE
066100       '05027010500137028276060000780171750290003803621710600131'.
066200         10  FILLER                  PIC X(56) VALUE
066300       '02089506100082010710025000360333740860011401814105000067'.
066400         10  FILLER                  PIC X(56) VALUE
066500       '01015002200030000000000000000000000000000000000000000000'.
066600         10  FILLER                  PIC X(56) VALUE
066700       '00000000000000000000000000000000000000000000000000000000'.
066800         10  FILLER                  PIC X(56) VALUE
066900       '00000000000000000000000000000000000000000000000000000000'.
067000     05  DRGX-TAB REDEFINES D-TAB.                                04619000
067100         10  DRGX-PERIOD               OCCURS 1                   04619100
067200                                        INDEXED BY DX5.           04619200
067300             15  DRGX-EFF-DATE         PIC X(08).                 04619300
067400             15  DRG-DATA              OCCURS 1000                04619400
067500                                        INDEXED BY DX6.           04619500
067600                 20  DRG-WT            PIC 9(02)V9(04).           04619600
067700                 20  DRG-ALOS          PIC 9(02)V9(01).           04619700
067800                 20  DRG-DAYS-TRIM     PIC 9(02).                 04619800
067900                 20  DRG-ARITH-ALOS    PIC 9(02)V9(01).           04619900
068000
