       01  DRG-TABLE.                                                   00010000
           05  D-TAB.                                                   00020000
             10  FILLER                  PIC X(08) VALUE                00030000
           '20091001'.                                                  00040000
             10  FILLER                  PIC X(56) VALUE                00050000
           '24854831500439117540164002121826673160038511194122900282'.  00060000
             10  FILLER                  PIC X(56) VALUE                00070000
           '10135814900203047569083000920945431560018605061510400123'.  00080000
             10  FILLER                  PIC X(56) VALUE                00090000
           '06541917700213042752089001000473411270016303030608800105'.  00100000
             10  FILLER                  PIC X(56) VALUE                00110000
           '01864305700069000000000000000000000000000000000000000000'.  00120000
             10  FILLER                  PIC X(56) VALUE                00130000
           '00000000000000000000000000000000000000000008439214800183'.  00140000
             10  FILLER                  PIC X(56) VALUE                00150000
           '06206812200144043765074000890494010850012103256605700080'.  00160000
             10  FILLER                  PIC X(56) VALUE                00170000
           '04823609400121029421061000770209020310004105109010200134'.  00180000
             10  FILLER                  PIC X(56) VALUE                00190000
           '02776804800067016019027000350453410900013201918603700055'.  00200000
             10  FILLER                  PIC X(56) VALUE                00210000
           '01333102200028031900044000690201650200002901574401300016'.  00220000
             10  FILLER                  PIC X(56) VALUE                00230000
           '02919005700083014783024000340100330140001703951809400129'.  00240000
             10  FILLER                  PIC X(56) VALUE                00250000
           '02124905200070016448024000330000000000000000000000000000'.  00260000
             10  FILLER                  PIC X(56) VALUE                00270000
           '00000000000000000000000000000000000000000000000000000000'.  00280000
             10  FILLER                  PIC X(56) VALUE                00290000
           '00000000000000000000000000000000000000000001483604500063'.  00300000
             10  FILLER                  PIC X(56) VALUE                00310000
           '00838203100040015637050000680106130360004901695205700077'.  00320000
             10  FILLER                  PIC X(56) VALUE                00330000
           '00902803900050015512058000780095810420005100708303200038'.  00340000
             10  FILLER                  PIC X(56) VALUE                00350000
           '02916806500087019290050000590151870360004201825805300072'.  00360000
             10  FILLER                  PIC X(56) VALUE                00370000
           '01158004100050008223029000350133350430005500859302700034'.  00380000
             10  FILLER                  PIC X(56) VALUE                00390000
           '00728902400029017919057000740110270410005200761602600033'.  00400000
             10  FILLER                  PIC X(56) VALUE                00410000
           '01293904500060008380033000410166700570007300833603300039'.  00420000
             10  FILLER                  PIC X(56) VALUE                00430000
           '01624505300066009822036000430073590270003201146103700050'.  00440000
             10  FILLER                  PIC X(56) VALUE                00450000
           '00711302700034020130037000630130310360004900853202200029'.  00460000
             10  FILLER                  PIC X(56) VALUE                00470000
           '02057205300074012098038000490078150240003101474104200055'.  00480000
             10  FILLER                  PIC X(56) VALUE                00490000
           '00929802900037006818019000240154650450006200916703400043'.  00500000
             10  FILLER                  PIC X(56) VALUE                00510000
           '00669102400030034161090001170224160640008101792704700059'.  00520000
             10  FILLER                  PIC X(56) VALUE                00530000
           '03023309100115017985063000800120840460005501477804500061'.  00540000
             10  FILLER                  PIC X(56) VALUE                00550000
           '00757702800036009772032000440063550240003000000000000000'.  00560000
             10  FILLER                  PIC X(56) VALUE                00570000
           '00000000000000000000000000000000000000000000000000000000'.  00580000
             10  FILLER                  PIC X(56) VALUE                00590000
           '00000000000000000000000000000000000000000000000000000000'.  00600000
             10  FILLER                  PIC X(56) VALUE                00610000
           '01770204000057008825020000260115890320004401141802700040'.  00620000
             10  FILLER                  PIC X(56) VALUE                00630000
           '00691401600021000000000000000000000000000000000000000000'.  00640000
             10  FILLER                  PIC X(56) VALUE                00650000
           '01000604400056006713034000420071530230002801184304100056'.  00660000
             10  FILLER                  PIC X(56) VALUE                00670000
           '00662702600033000000000000000000000000000000000000000000'.  00680000
             10  FILLER                  PIC X(56) VALUE                00690000
           '02066103600052012054024000300201460390005701135502100027'.  00700000
             10  FILLER                  PIC X(56) VALUE                00710000
           '01588403700055008166017000220185200430006500901501700021'.  00720000
             10  FILLER                  PIC X(56) VALUE                00730000
           '01400404000054007458019000240080800140001700000000000000'.  00740000
             10  FILLER                  PIC X(56) VALUE                00750000
           '00000000000000000000000000000000000000000000000000000000'.  00760000
             10  FILLER                  PIC X(56) VALUE                00770000
           '00000000000000021291067000950123450400005800699502300032'.  00780000
             10  FILLER                  PIC X(56) VALUE                00790000
           '00629302200027013363040000540061940230002900939603600046'.  00800000
             10  FILLER                  PIC X(56) VALUE                00810000
           '00608402700033013872045000610088230340004300620102400030'.  00820000
             10  FILLER                  PIC X(56) VALUE                00830000
           '01476304800066009235035000460059490230003000000000000000'.  00840000
             10  FILLER                  PIC X(56) VALUE                00850000
           '00000000000000000000000000000495491170014302516406300075'.  00860000
             10  FILLER                  PIC X(56) VALUE                00870000
           '01766204000047037227098001250200680600007601302603400046'.  00880000
             10  FILLER                  PIC X(56) VALUE                00890000
           '00000000000000000000000000000000000000000000000000000000'.  00900000
             10  FILLER                  PIC X(56) VALUE                00910000
           '00000000000000000000000000000161210590007101068504300051'.  00920000
             10  FILLER                  PIC X(56) VALUE                00930000
           '02048307100089014860058000710100880430005201726305900077'.  00940000
             10  FILLER                  PIC X(56) VALUE                00950000
           '01206204300056008159030000380144320520006600948303700045'.  00960000
             10  FILLER                  PIC X(56) VALUE                00970000
           '00666502600032015917055000710106200390005000761202900036'.  00980000
             10  FILLER                  PIC X(56) VALUE                00990000
           '01345504700060012076047000580096220400004800717503200038'.  01000000
             10  FILLER                  PIC X(56) VALUE                01010000
           '01437805300066009977043000510070950330003901539605600070'.  01020000
             10  FILLER                  PIC X(56) VALUE                01030000
           '01064704200051008137032000390182660640008300974503700048'.  01040000
             10  FILLER                  PIC X(56) VALUE                01050000
           '00714402900038008374035000430060550270003300647202100028'.  01060000
             10  FILLER                  PIC X(56) VALUE                01070000
           '01256604000054007294026000330517801280015102235805100072'.  01080000
             10  FILLER                  PIC X(56) VALUE                01090000
           '00000000000000000000000000000000000000000000000000000000'.  01100000
             10  FILLER                  PIC X(56) VALUE                01110000
           '00000000000000000000000000001283040700014410196715500181'.  01120000
             10  FILLER                  PIC X(56) VALUE                01130000
           '06593210100112052809076000830793361110013605176707300080'.  01140000
             10  FILLER                  PIC X(56) VALUE                01150000
           '04392605700061084829098001240622290380005407547707800099'.  01160000
             10  FILLER                  PIC X(56) VALUE                01170000
           '05832103900050065457057000850505190180002807540111800142'.  01180000
             10  FILLER                  PIC X(56) VALUE                01190000
           '04842807500085037989050000590767841080012905558908300092'.  01200000
             10  FILLER                  PIC X(56) VALUE                01210000
           '06924012000137046212081000870568980950011103612806000065'.  01220000
             10  FILLER                  PIC X(56) VALUE                01230000
           '05035507300105029366030000430472751220015502537707900097'.  01240000
             10  FILLER                  PIC X(56) VALUE                01250000
           '01492205300063035878063000810257370360004801988802100027'.  01260000
             10  FILLER                  PIC X(56) VALUE                01270000
           '04053402200034030955035000500191210170002102841904300060'.  01280000
             10  FILLER                  PIC X(56) VALUE                01290000
           '01684002000025027546050000700164550200002702944305300082'.  01300000
             10  FILLER                  PIC X(56) VALUE                01310000
           '02281704200059015713019000260253880740009901551805600071'.  01320000
             10  FILLER                  PIC X(56) VALUE                01330000
           '00952903400045028006050000680171910200002803295607400107'.  01340000
             10  FILLER                  PIC X(56) VALUE                01350000
           '01467702900041010412019000250161630330005402508705600085'.  01360000
             10  FILLER                  PIC X(56) VALUE                01370000
           '02240702300034000000000000000000000000000000000000000000'.  01380000
             10  FILLER                  PIC X(56) VALUE                01390000
           '00000000000000000000000000000000000000000000000000000000'.  01400000
             10  FILLER                  PIC X(56) VALUE                01410000
           '00000000000000000000000000000000000000000000000000000000'.  01420000
             10  FILLER                  PIC X(56) VALUE                01430000
           '00000000000000000000000000000000000000000001831305400068'.  01440000
             10  FILLER                  PIC X(56) VALUE                01450000
           '01162003600045008177023000290167170330005300802401900027'.  01460000
             10  FILLER                  PIC X(56) VALUE                01470000
           '00560201500019019634050000670103210240003103088809200118'.  01480000
             10  FILLER                  PIC X(56) VALUE                01490000
           '01849606600080012313045000550146090500006400974003900047'.  01500000
             10  FILLER                  PIC X(56) VALUE                01510000
           '00694002900034010104046000570065040360004201166501900030'.  01520000
             10  FILLER                  PIC X(56) VALUE                01530000
           '00670401400018004469011000120140450500006400937804000050'.  01540000
             10  FILLER                  PIC X(56) VALUE                01550000
           '00652202900036009999031000420056810200002401024203700048'.  01560000
             10  FILLER                  PIC X(56) VALUE                01570000
           '00595902200028013076041000560076240260003301218804000053'.  01580000
             10  FILLER                  PIC X(56) VALUE                01590000
           '00820703000038005710021000260051280190002300721502500031'.  01600000
             10  FILLER                  PIC X(56) VALUE                01610000
           '00540401700021017589050000690095980340004400621102200027'.  01620000
             10  FILLER                  PIC X(56) VALUE                01630000
           '00000000000000000000000000000000000000000000000000000000'.  01640000
             10  FILLER                  PIC X(56) VALUE                01650000
           '00000000000000000000000000000000000000000000000000000000'.  01660000
             10  FILLER                  PIC X(56) VALUE                01670000
           '00000000000000056845129001660270620720009201395003000040'.  01680000
             10  FILLER                  PIC X(56) VALUE                01690000
           '05139612700157024981079000920159520490005504776212100145'.  01700000
             10  FILLER                  PIC X(56) VALUE                01710000
           '02415007300084016208045000520414221150014002245807300088'.  01720000
             10  FILLER                  PIC X(56) VALUE                01730000
           '01444104200052030677086001030179790570006601219703400039'.  01740000
             10  FILLER                  PIC X(56) VALUE                01750000
           '02210905100068013112031000390093600170002103034509100113'.  01760000
             10  FILLER                  PIC X(56) VALUE                01770000
           '01617905900070011755043000480226570640008701323704200055'.  01780000
             10  FILLER                  PIC X(56) VALUE                01790000
           '00766502300029022798057000780126280340004400821001900024'.  01800000
             10  FILLER                  PIC X(56) VALUE                01810000
           '02534906400084014337039000490098780230002803959709500130'.  01820000
             10  FILLER                  PIC X(56) VALUE                01830000
           '02116005900077013008033000430000000000000000000000000000'.  01840000
             10  FILLER                  PIC X(56) VALUE                01850000
           '00000000000000000000000000000000000000000000000000000000'.  01860000
             10  FILLER                  PIC X(56) VALUE                01870000
           '00000000000000000000000000000000000000000001658405000066'.  01880000
             10  FILLER                  PIC X(56) VALUE                01890000
           '01048003800046007501027000320192140670008701286505400066'.  01900000
             10  FILLER                  PIC X(56) VALUE                01910000
           '00861904100048020149064000860126310450005900888303000039'.  01920000
             10  FILLER                  PIC X(56) VALUE                01930000
           '01614904900063009873036000430071790270003201733305500070'.  01940000
             10  FILLER                  PIC X(56) VALUE                01950000
           '01085303900048007785029000350123990440005500814603100037'.  01960000
             10  FILLER                  PIC X(56) VALUE                01970000
           '01708906100080010423043000540078710340004101506005300070'.  01980000
             10  FILLER                  PIC X(56) VALUE                01990000
           '00926803900049006341029000350109580390005100692102800035'.  02000000
             10  FILLER                  PIC X(56) VALUE                02010000
           '01563204900068009572037000470066660260003200000000000000'.  02020000
             10  FILLER                  PIC X(56) VALUE                02030000
           '00000000000000000000000000000000000000000000000000000000'.  02040000
             10  FILLER                  PIC X(56) VALUE                02050000
           '00000000000000000000000000000000000000000000000000000000'.  02060000
             10  FILLER                  PIC X(56) VALUE                02070000
           '05591112500166026729067000850180680410005204084411300140'.  02080000
             10  FILLER                  PIC X(56) VALUE                02090000
           '02310307500088016134052000610396551030012402398207300084'.  02100000
             10  FILLER                  PIC X(56) VALUE                02110000
           '01622204500054036023096001170198240620007301290403900045'.  02120000
             10  FILLER                  PIC X(56) VALUE                02130000
           '02405006400080016354043000530113340240003004118210200140'.  02140000
             10  FILLER                  PIC X(56) VALUE                02150000
           '01698704900068011791032000440422551120014902210506900090'.  02160000
             10  FILLER                  PIC X(56) VALUE                02170000
           '01447703900052000000000000000000000000000000000000000000'.  02180000
             10  FILLER                  PIC X(56) VALUE                02190000
           '00000000000000000000000000000000000000000001636905100068'.  02200000
             10  FILLER                  PIC X(56) VALUE                02210000
           '00907603600046006489027000340172930570007401183104300056'.  02220000
             10  FILLER                  PIC X(56) VALUE                02230000
           '00878003000039016993055000740099600400005100686503000036'.  02240000
             10  FILLER                  PIC X(56) VALUE                02250000
           '01729005200072009407037000480066310280003501505504900064'.  02260000
             10  FILLER                  PIC X(56) VALUE                02270000
           '01038603700046007239025000310000000000000000000000000000'.  02280000
             10  FILLER                  PIC X(56) VALUE                02290000
           '00000000000000000000000000000000000000000000000000000000'.  02300000
             10  FILLER                  PIC X(56) VALUE                02310000
           '10010811200144069533058000720501970330004008741211200140'.  02320000
             10  FILLER                  PIC X(56) VALUE                02330000
           '05961706100072048966038000430615060750009303709703500040'.  02340000
             10  FILLER                  PIC X(56) VALUE                02350000
           '04561406500081032056038000420530251220016802838407300095'.  02360000
             10  FILLER                  PIC X(56) VALUE                02370000
           '01789604400057046698074000920312070450005202516703400037'.  02380000
             10  FILLER                  PIC X(56) VALUE                02390000
           '03328206600079020613035000380461820720010102754702800041'.  02400000
             10  FILLER                  PIC X(56) VALUE                02410000
           '02003301500019035040097001250192300620008001065003500046'.  02420000
             10  FILLER                  PIC X(56) VALUE                02430000
           '03134308700111021321047000650151210190002802875207600089'.  02440000
             10  FILLER                  PIC X(56) VALUE                02450000
           '01837305200057015071043000470230240320003901835802000023'.  02460000
             10  FILLER                  PIC X(56) VALUE                02470000
           '03087109300114020558064000760143380450005201677403900050'.  02480000
             10  FILLER                  PIC X(56) VALUE                02490000
           '01183002500029017718030000430095220170002102850006800085'.  02500000
             10  FILLER                  PIC X(56) VALUE                02510000
           '01780604200051012619027000320287430740010101625404200057'.  02520000
             10  FILLER                  PIC X(56) VALUE                02530000
           '01034402000026019228054000740089750220002803024408100110'.  02540000
             10  FILLER                  PIC X(56) VALUE                02550000
           '01516904600060009834023000290218350670008801508205100064'.  02560000
             10  FILLER                  PIC X(56) VALUE                02570000
           '01028202500033011381025000360181880350004801256801700020'.  02580000
             10  FILLER                  PIC X(56) VALUE                02590000
           '01206502200031021482050000640137470320003901003301800022'.  02600000
             10  FILLER                  PIC X(56) VALUE                02610000
           '01232703500047007712020000250304140780010101835504500058'.  02620000
             10  FILLER                  PIC X(56) VALUE                02630000
           '01364002200030000000000000000000000000000000000000000000'.  02640000
             10  FILLER                  PIC X(56) VALUE                02650000
           '00000000000000000000000000000000000000000000000000000000'.  02660000
             10  FILLER                  PIC X(56) VALUE                02670000
           '00000000000000000000000000000000000000000000000000000000'.  02680000
             10  FILLER                  PIC X(56) VALUE                02690000
           '00000000000000000000000000000000000000000000000000000000'.  02700000
             10  FILLER                  PIC X(56) VALUE                02710000
           '01563205000069007386032000390129140450005900712703300039'.  02720000
             10  FILLER                  PIC X(56) VALUE                02730000
           '00883103700043005863025000300228390790010501383905700072'.  02740000
             10  FILLER                  PIC X(56) VALUE                02750000
           '00942204100052019540066000860112110460005800771703600042'.  02760000
             10  FILLER                  PIC X(56) VALUE                02770000
           '02278306300087010758043000530074750300003701928106700090'.  02780000
             10  FILLER                  PIC X(56) VALUE                02790000
           '01175805000063007082033000410154420540006900793703300041'.  02800000
             10  FILLER                  PIC X(56) VALUE                02810000
           '01105704500057006478029000360096980340004700602702500031'.  02820000
             10  FILLER                  PIC X(56) VALUE                02830000
           '01468505400066008387036000430175140520007200985203700048'.  02840000
             10  FILLER                  PIC X(56) VALUE                02850000
           '00595902100027013793048000610069270310003601506805300070'.  02860000
             10  FILLER                  PIC X(56) VALUE                02870000
           '00907003900048006498028000350000000000000000000000000000'.  02880000
             10  FILLER                  PIC X(56) VALUE                02890000
           '00000000000000000000000000000000000000000000000000000000'.  02900000
             10  FILLER                  PIC X(56) VALUE                02910000
           '03528610000139019090068000890112600450005603359808200126'.  02920000
             10  FILLER                  PIC X(56) VALUE                02930000
           '01723504100062009925024000320285560800010701399703600053'.  02940000
             10  FILLER                  PIC X(56) VALUE                02950000
           '00858901800024010226021000280078890150001801487703600055'.  02960000
             10  FILLER                  PIC X(56) VALUE                02970000
           '00859301700021000000000000000000000000000000000000000000'.  02980000
             10  FILLER                  PIC X(56) VALUE                02990000
           '00000000000000000000000000000000000000000001849906600088'.  03000000
             10  FILLER                  PIC X(56) VALUE                03010000
           '01080704900063007523037000470176910600008200828503700047'.  03020000
             10  FILLER                  PIC X(56) VALUE                03030000
           '01630205600080010650042000570061020260003500980104200054'.  03040000
             10  FILLER                  PIC X(56) VALUE                03050000
           '00594103000036014300055000690081780380004601171904100055'.  03060000
             10  FILLER                  PIC X(56) VALUE                03070000
           '00682402700034011964043000590064030280003600000000000000'.  03080000
             10  FILLER                  PIC X(56) VALUE                03090000
           '00000000000000000000000000000000000000000000000000000000'.  03100000
             10  FILLER                  PIC X(56) VALUE                03110000
           '00000000000000026525050000710138590260003104853713200168'.  03120000
             10  FILLER                  PIC X(56) VALUE                03130000
           '02031606900085012713050000610358390500007901825802600034'.  03140000
             10  FILLER                  PIC X(56) VALUE                03150000
           '01450001700019042285113001600202710690008901130404500056'.  03160000
             10  FILLER                  PIC X(56) VALUE                03170000
           '02238004700071011339020000300075450130001403397807400111'.  03180000
             10  FILLER                  PIC X(56) VALUE                03190000
           '02300306800085014359035000480000000000000000000000000000'.  03200000
             10  FILLER                  PIC X(56) VALUE                03210000
           '00000000000000000000000000000000000000000000000000000000'.  03220000
             10  FILLER                  PIC X(56) VALUE                03230000
           '01330304400058008263033000420055470240002901089603700051'.  03240000
             10  FILLER                  PIC X(56) VALUE                03250000
           '00684303000037010463036000490163250580007301045304200053'.  03260000
             10  FILLER                  PIC X(56) VALUE                03270000
           '00718703000037000000000000000000000000000000000000000000'.  03280000
             10  FILLER                  PIC X(56) VALUE                03290000
           '00000000000000000000000000000000000000000002973606500075'.  03300000
             10  FILLER                  PIC X(56) VALUE                03310000
           '05818913300165028942083000940191800500005903259207700099'.  03320000
             10  FILLER                  PIC X(56) VALUE                03330000
           '01852304800056013668030000340328120780010701813604400060'.  03340000
             10  FILLER                  PIC X(56) VALUE                03350000
           '01281702400030027753074001020137130340004901019301500019'.  03360000
             10  FILLER                  PIC X(56) VALUE                03370000
           '02805209000114015506041000610076150180002302248106100084'.  03380000
             10  FILLER                  PIC X(56) VALUE                03390000
           '01193803000042007573018000230146980400006000769901900024'.  03400000
             10  FILLER                  PIC X(56) VALUE                03410000
           '02919205700097020576045000680131290150002100000000000000'.  03420000
             10  FILLER                  PIC X(56) VALUE                03430000
           '00000000000000000000000000000000000000000000000000000000'.  03440000
             10  FILLER                  PIC X(56) VALUE                03450000
           '00000000000000016422051000700105230420005200674602900035'.  03460000
             10  FILLER                  PIC X(56) VALUE                03470000
           '00899402500034015362055000730102600390005100685202300030'.  03480000
             10  FILLER                  PIC X(56) VALUE                03490000
           '01212204800060007708035000420147110310004101104401900023'.  03500000
             10  FILLER                  PIC X(56) VALUE                03510000
           '01149603500046006539020000250123960420005700645302600032'.  03520000
             10  FILLER                  PIC X(56) VALUE                03530000
           '00814002500035014877050000660095180370004700653302600033'.  03540000
             10  FILLER                  PIC X(56) VALUE                03550000
           '00000000000000000000000000000000000000000000000000000000'.  03560000
             10  FILLER                  PIC X(56) VALUE                03570000
           '00000000000000000000000000000166910320004201202401700020'.  03580000
             10  FILLER                  PIC X(56) VALUE                03590000
           '01835003600060013227013000160171280500007400766601900026'.  03600000
             10  FILLER                  PIC X(56) VALUE                03610000
           '01128502900041006364016000190174600410006301005301300015'.  03620000
             10  FILLER                  PIC X(56) VALUE                03630000
           '01678204800068007921020000270000000000000000000000000000'.  03640000
             10  FILLER                  PIC X(56) VALUE                03650000
           '00000000000000014962054000700097320390005100628802100028'.  03660000
             10  FILLER                  PIC X(56) VALUE                03670000
           '01068503900051006979028000350131620500006400733103300041'.  03680000
             10  FILLER                  PIC X(56) VALUE                03690000
           '00964203700049005786023000280000000000000000000000000000'.  03700000
             10  FILLER                  PIC X(56) VALUE                03710000
           '00000000000000025091056000770113700250003004349011400140'.  03720000
             10  FILLER                  PIC X(56) VALUE                03730000
           '01965105800068011766033000370305530770010001502804100049'.  03740000
             10  FILLER                  PIC X(56) VALUE                03750000
           '01056802400028013481033000430087870190002201469904100057'.  03760000
             10  FILLER                  PIC X(56) VALUE                03770000
           '00772102000025012251029000400084710160001800878401500017'.  03780000
             10  FILLER                  PIC X(56) VALUE                03790000
           '02437806600091010159023000300000000000000000000000000000'.  03800000
             10  FILLER                  PIC X(56) VALUE                03810000
           '00000000000000018829062000850111840410005500588302200029'.  03820000
             10  FILLER                  PIC X(56) VALUE                03830000
           '01718906500084010980048000590077190360004400799203000039'.  03840000
             10  FILLER                  PIC X(56) VALUE                03850000
           '00495201900024000000000000000000000000000000000000000000'.  03860000
             10  FILLER                  PIC X(56) VALUE                03870000
           '01108304000052007526029000300083890250003001775404700058'.  03880000
             10  FILLER                  PIC X(56) VALUE                03890000
           '01890003900069005367015000190000000000000000000000000000'.  03900000
             10  FILLER                  PIC X(56) VALUE                03910000
           '00000000000000006873026000330049710210002300680802600035'.  03920000
             10  FILLER                  PIC X(56) VALUE                03930000
           '00778601900023004229019000300043860160002100202301200013'.  03940000
             10  FILLER                  PIC X(56) VALUE                03950000
           '00635702700038004504017000240000000000000000000000000000'.  03960000
             10  FILLER                  PIC X(56) VALUE                03970000
           '00000000000000000000000000000000000000000000000000000000'.  03980000
             10  FILLER                  PIC X(56) VALUE                03990000
           '01458301800018048090179001790328441330013301981708600086'.  04000000
             10  FILLER                  PIC X(56) VALUE                04010000
           '03373804700047011941034000340016170310003100000000000000'.  04020000
             10  FILLER                  PIC X(56) VALUE                04030000
           '00000000000000000000000000000510871050013702531505700074'.  04040000
             10  FILLER                  PIC X(56) VALUE                04050000
           '01586503200040034788088001190176800490006901038802400032'.  04060000
             10  FILLER                  PIC X(56) VALUE                04070000
           '00000000000000000000000000000000000000000002048706300082'.  04080000
             10  FILLER                  PIC X(56) VALUE                04090000
           '01172504100052008689031000390124310390005400775102800037'.  04100000
             10  FILLER                  PIC X(56) VALUE                04110000
           '01384603700052015144051000680095960360004600695302700034'.  04120000
             10  FILLER                  PIC X(56) VALUE                04130000
           '00000000000000000000000000000000000000000005367312800168'.  04140000
             10  FILLER                  PIC X(56) VALUE                04150000
           '02267205200075011632024000330390101150014802152006300086'.  04160000
             10  FILLER                  PIC X(56) VALUE                04170000
           '01200302900041045104117001490201110520006901238402800035'.  04180000
             10  FILLER                  PIC X(56) VALUE                04190000
           '02608806400096009784023000310000000000000000000000000000'.  04200000
             10  FILLER                  PIC X(56) VALUE                04210000
           '00000000000000043709093001510248170590009701259503200049'.  04220000
             10  FILLER                  PIC X(56) VALUE                04230000
           '06361618100234030949085001290124960480005902725807700105'.  04240000
             10  FILLER                  PIC X(56) VALUE                04250000
           '01507105000067009803032000430168520590007901199704500060'.  04260000
             10  FILLER                  PIC X(56) VALUE                04270000
           '00804303100041021717060000850094510270003400823502500032'.  04280000
             10  FILLER                  PIC X(56) VALUE                04290000
           '01283704400062000000000000000000000000000000000000000000'.  04300000
             10  FILLER                  PIC X(56) VALUE                04310000
           '05494612500163027290088001080170400550007304924911400155'.  04320000
             10  FILLER                  PIC X(56) VALUE                04330000
           '02043906300081013521044000550000000000000000000000000000'.  04340000
             10  FILLER                  PIC X(56) VALUE                04350000
           '00000000000000019008060000800097020410005100815303100039'.  04360000
             10  FILLER                  PIC X(56) VALUE                04370000
           '01360104400062006736028000350237050690009401068004200054'.  04380000
             10  FILLER                  PIC X(56) VALUE                04390000
           '00741903300041058007129001550184370540007301115504600056'.  04400000
             10  FILLER                  PIC X(56) VALUE                04410000
           '00000000000000000000000000000000000000000002589208000131'.  04420000
             10  FILLER                  PIC X(56) VALUE                04430000
           '00000000000000000000000000000000000000000000619102400032'.  04440000
             10  FILLER                  PIC X(56) VALUE                04450000
           '00604803100043006676031000440111880490008200945204200056'.  04460000
             10  FILLER                  PIC X(56) VALUE                04470000
           '00889905500075007895037000600083360310004700000000000000'.  04480000
             10  FILLER                  PIC X(56) VALUE                04490000
           '00000000000000000000000000000000000000000000000000000000'.  04500000
             10  FILLER                  PIC X(56) VALUE                04510000
           '00000000000000004021021000290097420820010601415504900068'.  04520000
             10  FILLER                  PIC X(56) VALUE                04530000
           '00628803200040000000000000000000000000000000000000000000'.  04540000
             10  FILLER                  PIC X(56) VALUE                04550000
           '04054510000150017850057000800101370330004502860107300113'.  04560000
             10  FILLER                  PIC X(56) VALUE                04570000
           '01090103400046009991021000310380720810011601873604700065'.  04580000
             10  FILLER                  PIC X(56) VALUE                04590000
           '01113502600034000000000000000000000000000000000000000000'.  04600000
             10  FILLER                  PIC X(56) VALUE                04610000
           '01347304200060006789026000340125450330004600451301700021'.  04620000
             10  FILLER                  PIC X(56) VALUE                04630000
           '01444903700052005839020000270158830440006300940503200043'.  04640000
             10  FILLER                  PIC X(56) VALUE                04650000
           '00612102300028013114038000550065560230003200000000000000'.  04660000
             10  FILLER                  PIC X(56) VALUE                04670000
           '00000000000000000000000000001373512440032705305211700164'.  04680000
             10  FILLER                  PIC X(56) VALUE                04690000
           '02008605000074000000000000000000000000000000000000000000'.  04700000
             10  FILLER                  PIC X(56) VALUE                04710000
           '02308102400057013403042000620125070350005300000000000000'.  04720000
             10  FILLER                  PIC X(56) VALUE                04730000
           '00000000000000000000000000000285930720010901682103500057'.  04740000
             10  FILLER                  PIC X(56) VALUE                04750000
           '01129802000026000000000000000000000000000000000000000000'.  04760000
             10  FILLER                  PIC X(56) VALUE                04770000
           '01238808200100011159067000770109220380005100668902800035'.  04780000
             10  FILLER                  PIC X(56) VALUE                04790000
           '00975802700048005459025000340072390210004200000000000000'.  04800000
             10  FILLER                  PIC X(56) VALUE                04810000
           '00000000000000000000000000000567810890012803436407300091'.  04820000
             10  FILLER                  PIC X(56) VALUE                04830000
           '06299310500151036544073000950220000450005800000000000000'.  04840000
             10  FILLER                  PIC X(56) VALUE                04850000
           '00000000000000000000000000000276870620009201502604600058'.  04860000
             10  FILLER                  PIC X(56) VALUE                04870000
           '00978103100038000000000000000000000000000000000000000000'.  04880000
             10  FILLER                  PIC X(56) VALUE                04890000
           '05507413200188025627061000890000000000000000000000000000'.  04900000
             10  FILLER                  PIC X(56) VALUE                04910000
           '00000000000000024810071001000135970520006800896703700047'.  04920000
             10  FILLER                  PIC X(56) VALUE                04930000
           '01053803700050000000000000000000000000000000000000000000'.  04940000
             10  FILLER                  PIC X(56) VALUE                04950000
           '05038911300146028954070000900180720340004603344311700146'.  04960000
             10  FILLER                  PIC X(56) VALUE                04970000
           '01948106200087011079029000430340200940012601783605400073'.  04980000
             10  FILLER                  PIC X(56) VALUE                04990000
           '01035802600037000000000000000000000000000000000000000000'.  05000000
             10  FILLER                  PIC X(56) VALUE                05010000
           '00000000000000000000000000000000000000000000000000000000'.  05020000
             10  FILLER                  PIC X(56) VALUE                05030000
           '00000000000000000000000000000000000000000000000000000000'.  05040000
           05  DRGX-TAB REDEFINES D-TAB.                                05050000
               10  DRGX-PERIOD               OCCURS 1                   05060000
                                              INDEXED BY DX5.           05070000
                   15  DRGX-EFF-DATE         PIC X(08).                 05080000
                   15  DRG-DATA              OCCURS 1000                05090000
                                              INDEXED BY DX6.           05100000
                       20  DRG-WT            PIC 9(02)V9(04).           05110000
                       20  DRG-ALOS          PIC 9(02)V9(01).           05120000
                       20  DRG-DAYS-TRIM     PIC 9(02).                 05130000
                       20  DRG-ARITH-ALOS    PIC 9(02)V9(01).           05140000
