//MYJOBA JOB 'MyAccounting',CLASS=B,MSGCLASS=P,NOTIFY=&SYSUID
//SAS    EXEC SAS94,REG=8M,OPTIONS='LINESIZE=80'
//WORK   DD  UNIT=SYSDA,SPACE=(CYL,(200,50),,,ROUND),
//           DCB=(RECFM=FS,LRECL=27648,BLKSIZE=27648)
//           DSNTYPE=LARGE
//SASAUTOS DD DSN=MYLIB.SAS.$MAC,DISP=SHR
//INPUT    DD DSN=MYLIB.POC.INPUT.CSV,DISP=SHR
//OUTPUTP   DD DSN=MYLIB.POC.OUTPUT.CSV(-1),DISP=OLD
//OUTPUT   DD DSN=MYLIB.POC.OUTPUT.CSV(0),DISP=OLD
//OUTRDP   DD DSN=MYLIB.POC.OUTPUT.RDP,DISP=OLD
//SYSIN  DD DSN=MYLIB.SAS.$PGM(SASPOC)
/*

