000100 01  W-DRG-FILLS.
000200     03                          PIC X(45)   VALUE
000300         '003412776120510004293454350363011091522310193'.
000400     03                          PIC X(45)   VALUE
000500         '012076892230148013045721740100014055741970164'.
000600     03                          PIC X(45)   VALUE
000700         '016055741970164017055741970164020086222270189'.
000800     03                          PIC X(45)   VALUE
000900         '021055401960163022055401960127023162273450195'.
001000     03                          PIC X(45)   VALUE
001100         '024076892230112025162273450163026076892230105'.
001200     03                          PIC X(45)   VALUE
001300         '027076892230054028162273450202029112592740103'.
001400     03                          PIC X(45)   VALUE
001500         '030060372030052031162273450186032060372030079'.
001600     03                          PIC X(45)   VALUE
001700         '033060372030038034112592740119035112592740048'.
001800     03                          PIC X(45)   VALUE
001900         '036112592740021037162273450134038112592740056'.
002000     03                          PIC X(45)   VALUE
002100         '039045721740023040144503590179041092642860103'.
002200     03                          PIC X(45)   VALUE
002300         '042060031980054052120353570086053120353570052'.
002400     03                          PIC X(45)   VALUE
002500         '054074792110088055045721740066056079142500112'.
002600     03                          PIC X(45)   VALUE
002700         '057056552330073058076892230112059060031980074'.
002800     03                          PIC X(45)   VALUE
002900         '060045721740056061082122460122062068982550074'.
003000     03                          PIC X(45)   VALUE
003100         '063045721740050064086222270104065055401960066'.
003200     03                          PIC X(45)   VALUE
003300         '066055401960044067076892230084068045721740047'.
003400     03                          PIC X(45)   VALUE
003500         '069076892230039070082122460105071068982550072'.
003600     03                          PIC X(45)   VALUE
003700         '072045721740044073085552330084074060372030061'.
003800     03                          PIC X(45)   VALUE
003900         '075060031980100076045721740057077112592740094'.
004000     03                          PIC X(45)   VALUE
004100         '078045721740061079045721740043080076892230082'.
004200     03                          PIC X(45)   VALUE
004300         '081060031980053082112592740094083076892230070'.
004400     03                          PIC X(45)   VALUE
004500         '084045721740041085089062490110086063672210065'.
004600     03                          PIC X(45)   VALUE
004700         '087045721740041088112592740080089076892230052'.
004800     03                          PIC X(45)   VALUE
004900         '090076892230034091100842470095092061572120061'.
005000     03                          PIC X(45)   VALUE
005100         '093060031980041094110512810181095081312370125'.
005200     03                          PIC X(45)   VALUE
005300         '096081312370087097081472050171098060031980117'.
005400     03                          PIC X(45)   VALUE
005500         '099045721740079100068552070090101045721740050'.
005600     03                          PIC X(45)   VALUE
005700         '102112592740067103045721740044113162273450090'.
005800     03                          PIC X(45)   VALUE
005900         '114060031980046115060031980068116162273450076'.
006000     03                          PIC X(45)   VALUE
006100         '117060031980036121076892230075122060031980054'.
006200     03                          PIC X(45)   VALUE
006300         '123060031980040124162273450082125060031980049'.
006400     03                          PIC X(45)   VALUE
006500         '129125912670082130125912670040131076892230088'.
006600     03                          PIC X(45)   VALUE
006700         '132045721740039133076892230086134045721740036'.
006800     03                          PIC X(45)   VALUE
006900         '135076892230098136045721740036137076892230081'.
007000     03                          PIC X(45)   VALUE
007100         '138045721740038139070372460028146125912670136'.
007200     03                          PIC X(45)   VALUE
007300         '147125912670088148070372460047149045721740038'.
007400     03                          PIC X(45)   VALUE
007500         '150080622180079151045721740043152080622180066'.
007600     03                          PIC X(45)   VALUE
007700         '153045721740045154091522310089155076892230062'.
007800     03                          PIC X(45)   VALUE
007900         '156045721740043157119412690100158070372460062'.
008000     03                          PIC X(45)   VALUE
008100         '159070372460039163226463850211164162273450104'.
008200     03                          PIC X(45)   VALUE
008300         '165162273450061166243084000177167127682980107'.
008400     03                          PIC X(45)   VALUE
008500         '168076892230062175070852020099176053241790069'.
008600     03                          PIC X(45)   VALUE
008700         '177088032220125178069601970095179055211740070'.
008800     03                          PIC X(45)   VALUE
008900         '180070671790115181064571710081182045721740052'.
009000     03                          PIC X(45)   VALUE
009100         '183060031980093184060031980064185060031980045'.
009200     03                          PIC X(45)   VALUE
009300         '186083462060102187066211770072188045721740051'.
009400     03                          PIC X(45)   VALUE
009500         '189091612160080190073771950078191062851820065'.
009600     03                          PIC X(45)   VALUE
009700         '192049561560051193076932020095194060011770070'.
009800     03                          PIC X(45)   VALUE
009900         '195048291530052196072161850108197063941890073'.
010000     03                          PIC X(45)   VALUE
010100         '198060031980056199078662030122200045721740068'.
010200     03                          PIC X(45)   VALUE
010300         '201045721740051202065411850060203060031980046'.
010400     03                          PIC X(45)   VALUE
010500         '204076642130041205088122160085206063141800050'.
010600     03                          PIC X(45)   VALUE
010700         '207197253220208208110662180116215045721740145'.
010800     03                          PIC X(45)   VALUE
010900         '216045721740145217045721740145218045721740113'.
011000     03                          PIC X(45)   VALUE
011100         '219162273450188220162273450103221112592740080'.
011200     03                          PIC X(45)   VALUE
011300         '222162273450187223112592740105224162273450155'.
011400     03                          PIC X(45)   VALUE
011500         '225076892230078226162273450144227112592740051'.
011600     03                          PIC X(45)   VALUE
011700         '228154343310203229119753090115230112592740078'.
011800     03                          PIC X(45)   VALUE
011900         '231162273450189232112592740130233112592740193'.
012000     03                          PIC X(45)   VALUE
012100         '234112592740117235162273450155236112592740088'.
012200     03                          PIC X(45)   VALUE
012300         '237162273450171238112592740061239150923730221'.
012400     03                          PIC X(45)   VALUE
012500         '240111383070137241076892230083242162273450122'.
012600     03                          PIC X(45)   VALUE
012700         '243112592740073244112592740045245076892230076'.
012800     03                          PIC X(45)   VALUE
012900         '246162273450085247112592740038248112592740101'.
013000     03                          PIC X(45)   VALUE
013100         '249112592740045250162273450115251112592740048'.
013200     03                          PIC X(45)   VALUE
013300         '252154343310130253119753090092254045721740044'.
013400     03                          PIC X(45)   VALUE
013500         '255129723300143256110683080103257060031980060'.
013600     03                          PIC X(45)   VALUE
013700         '258112592740099259112592740054260162273450176'.
013800     03                          PIC X(45)   VALUE
013900         '261045721740069262045721740045263112592740086'.
014000     03                          PIC X(45)   VALUE
014100         '264108572980137265162273450057280080322250097'.
014200     03                          PIC X(45)   VALUE
014300         '281063182040059282045721740038283080511650076'.
014400     03                          PIC X(45)   VALUE
014500         '284076892230037285076892230024286162273450108'.
014600     03                          PIC X(45)   VALUE
014700         '287060031980048288101032570158289082012540111'.
014800     03                          PIC X(45)   VALUE
014900         '290076892230077291081582130094292061051920070'.
015000     03                          PIC X(45)   VALUE
015100         '293047541690047294058192030078295045721740056'.
015200     03                          PIC X(45)   VALUE
015300         '296081582130043297061051920020298047541690013'.
015400     03                          PIC X(45)   VALUE
015500         '299079902280091300058192030071301045721740052'.
015600     03                          PIC X(45)   VALUE
015700         '302072011950060303069902260035304076892230069'.
015800     03                          PIC X(45)   VALUE
015900         '305045721740039306083442240084307083442240051'.
016000     03                          PIC X(45)   VALUE
016100         '308076352120078309051491720052310045721740034'.
016200     03                          PIC X(45)   VALUE
016300         '311060031980033312056242070045313076892230032'.
016400     03                          PIC X(45)   VALUE
016500         '314093372330110315067172040063316060031980038'.
016600     03                          PIC X(45)   VALUE
016700         '326206513870242327162273450132328045721740053'.
016800     03                          PIC X(45)   VALUE
016900         '329179963790231330112592740127331045721740071'.
017000     03                          PIC X(45)   VALUE
017100         '332112592740204333060031980113334045721740067'.
017200     03                          PIC X(45)   VALUE
017300         '335162273450205336162273450132337045721740080'.
017400     03                          PIC X(45)   VALUE
017500         '338093652400149339069342050092340060031980054'.
017600     03                          PIC X(45)   VALUE
017700         '341093652400103342069342050055343060031980027'.
017800     03                          PIC X(45)   VALUE
017900         '344162273450178345069342050097346060031980063'.
018000     03                          PIC X(45)   VALUE
018100         '347112592740139348060031980082349060031980046'.
018200     03                          PIC X(45)   VALUE
018300         '350045721740130351045721740071352045721740038'.
018400     03                          PIC X(45)   VALUE
018500         '353162273450131354069342050079355060031980046'.
018600     03                          PIC X(45)   VALUE
018700         '356144223400190357095562770111358045721740065'.
018800     03                          PIC X(45)   VALUE
018900         '368100922480105369060031980065370060031980045'.
019000     03                          PIC X(45)   VALUE
019100         '371093652400127372069342050089373060031980064'.
019200     03                          PIC X(45)   VALUE
019300         '374094212210137375065341980087376045721740055'.
019400     03                          PIC X(45)   VALUE
019500         '377089232350096378057981980060379045721740042'.
019600     03                          PIC X(45)   VALUE
019700         '380103452480114381060031980071382060031980050'.
019800     03                          PIC X(45)   VALUE
019900         '383076892230084384060031980054385087772230125'.
020000     03                          PIC X(45)   VALUE
020100         '386058791940078387058791940059388099242310113'.
020200     03                          PIC X(45)   VALUE
020300         '389065721900070390045721740049391084852320081'.
020400     03                          PIC X(45)   VALUE
020500         '392062641990054393106092550106394071602180069'.
020600     03                          PIC X(45)   VALUE
020700         '395060031980046405162273450236406162273450125'.
020800     03                          PIC X(45)   VALUE
020900         '407162273450081408060031980165409060031980123'.
021000     03                          PIC X(45)   VALUE
021100         '410060031980078411112592740175412112592740116'.
021200     03                          PIC X(45)   VALUE
021300         '413112592740079414112592740162415112592740101'.
021400     03                          PIC X(45)   VALUE
021500         '416060031980063417112592740118418060031980077'.
021600     03                          PIC X(45)   VALUE
021700         '419060031980047420076892230186421076892230104'.
021800     03                          PIC X(45)   VALUE
021900         '422076892230062423162273450213424162273450133'.
022000     03                          PIC X(45)   VALUE
022100         '425162273450077432071932000101433045721740065'.
022200     03                          PIC X(45)   VALUE
022300         '434045721740045435087012170111436076892230081'.
022400     03                          PIC X(45)   VALUE
022500         '437076892230057438107502510113439069311950069'.
022600     03                          PIC X(45)   VALUE
022700         '440045721740049441082312060111442058942020067'.
022800     03                          PIC X(45)   VALUE
022900         '443045721740049444086172310098445055611870066'.
023000     03                          PIC X(45)   VALUE
023100         '446045721740045453162273450190454162273450092'.
023200     03                          PIC X(45)   VALUE
023300         '455162273450054456162273450190457162273450096'.
023400     03                          PIC X(45)   VALUE
023500         '458162273450056459162273450133460162273450054'.
023600     03                          PIC X(45)   VALUE
023700         '461162273450111462162273450051463140393780221'.
023800     03                          PIC X(45)   VALUE
023900         '464109173310122465109173310075466162273450129'.
024000     03                          PIC X(45)   VALUE
024100         '467162273450063468162273450043469162273450110'.
024200     03                          PIC X(45)   VALUE
024300         '470162273450045471112592740150472112592740056'.
024400     03                          PIC X(45)   VALUE
024500         '473076892230026474158543790184475125163300113'.
024600     03                          PIC X(45)   VALUE
024700         '476060031980062477147163880169478112592740106'.
024800     03                          PIC X(45)   VALUE
024900         '479060031980068480162273450123481162273450071'.
025000     03                          PIC X(45)   VALUE
025100         '482162273450057483162273450050484162273450029'.
025200     03                          PIC X(45)   VALUE
025300         '485112592740157486112592740095487076892230069'.
025400     03                          PIC X(45)   VALUE
025500         '488162273450064489162273450041490162273450073'.
025600     03                          PIC X(45)   VALUE
025700         '491162273450034492162273450124493112592740072'.
025800     03                          PIC X(45)   VALUE
025900         '494112592740047495147483850156496108583590083'.
026000     03                          PIC X(45)   VALUE
026100         '497076892230039498112592740115499076892230039'.
026200     03                          PIC X(45)   VALUE
026300         '500137373540159501090063100086502060031980045'.
026400     03                          PIC X(45)   VALUE
026500         '503125203070126504088792360093505088792360050'.
026600     03                          PIC X(45)   VALUE
026700         '506045721740060507162273450089508162273450036'.
026800     03                          PIC X(45)   VALUE
026900         '509060031980056510137373540094511090063100059'.
027000     03                          PIC X(45)   VALUE
027100         '512060031980035513112592740079514045721740042'.
027200     03                          PIC X(45)   VALUE
027300         '515127963080151516112592740086517060031980054'.
027400     03                          PIC X(45)   VALUE
027500         '533060031980091534060031980055535060031980084'.
027600     03                          PIC X(45)   VALUE
027700         '536045721740052537060031980061538060031980043'.
027800     03                          PIC X(45)   VALUE
027900         '539103242970129540082212740094541075332550074'.
028000     03                          PIC X(45)   VALUE
028100         '542088982210128543060031980082544060031980056'.
028200     03                          PIC X(45)   VALUE
028300         '545085942220139546070531820079547045721740055'.
028400     03                          PIC X(45)   VALUE
028500         '548094112610125549074622510081550055142280059'.
028600     03                          PIC X(45)   VALUE
028700         '551102312890102552070152390060553112592740087'.
028800     03                          PIC X(45)   VALUE
028900         '554045721740055555060031980079556060031980050'.
029000     03                          PIC X(45)   VALUE
029100         '557081802380099558062432030061559089152600113'.
029200     03                          PIC X(45)   VALUE
029300         '560074812510069561061022190038562076892230087'.
029400     03                          PIC X(45)   VALUE
029500         '563045721740053564088812380099565073252340070'.
029600     03                          PIC X(45)   VALUE
029700         '566060031980051570116923320147571087392710100'.
029800     03                          PIC X(45)   VALUE
029900         '572067532570070573152344260200574092533130157'.
030000     03                          PIC X(45)   VALUE
030100         '575076892230087576162273450211577162273450096'.
030200     03                          PIC X(45)   VALUE
030300         '578076892230051579120153380148580096402730084'.
030400     03                          PIC X(45)   VALUE
030500         '581060031980040582096402730040583060031980025'.
030600     03                          PIC X(45)   VALUE
030700         '584162273450078585057702000040592083012520103'.
030800     03                          PIC X(45)   VALUE
030900         '593064112230079594055392000063595089812380125'.
031000     03                          PIC X(45)   VALUE
031100         '596059772120072597112592740118598060031980082'.
031200     03                          PIC X(45)   VALUE
031300         '599045721740049600112592740074601045721740052'.
031400     03                          PIC X(45)   VALUE
031500         '602073912150099603052981850065604088672400081'.
031600     03                          PIC X(45)   VALUE
031700         '605065662250049606086942340096607057702000056'.
031800     03                          PIC X(45)   VALUE
031900         '614107202890094615107202890040616152723870201'.
032000     03                          PIC X(45)   VALUE
032100         '617106593080115618076892230083619144223400118'.
032200     03                          PIC X(45)   VALUE
032300         '620095562770049621045721740028622126993450194'.
032400     03                          PIC X(45)   VALUE
032500         '623098362990110624060031980066625162273450113'.
032600     03                          PIC X(45)   VALUE
032700         '626107202890043627107202890020628136073490162'.
032800     03                          PIC X(45)   VALUE
032900         '629107202890112630107202890061637093512640087'.
033000     03                          PIC X(45)   VALUE
033100         '638074522370058639060031980040640081812250073'.
033200     03                          PIC X(45)   VALUE
033300         '641061202010053642060031980067643096172420109'.
033400     03                          PIC X(45)   VALUE
033500         '644060031980074645045721740052653162273450238'.
033600     03                          PIC X(45)   VALUE
033700         '654076892230130655076892230087656112592740147'.
033800     03                          PIC X(45)   VALUE
033900         '657060031980081658045721740046659162273450167'.
034000     03                          PIC X(45)   VALUE
034100         '660076892230091661076892230042662076892230171'.
034200     03                          PIC X(45)   VALUE
034300         '663076892230086664045721740032665112592740190'.
034400     03                          PIC X(45)   VALUE
034500         '666096782450103667076892230039668162273450145'.
034600     03                          PIC X(45)   VALUE
034700         '669112592740066670112592740036671076892230093'.
034800     03                          PIC X(45)   VALUE
034900         '672076892230035673136643190165674096782450115'.
035000     03                          PIC X(45)   VALUE
035100         '675076892230041682091732310101683068822050069'.
035200     03                          PIC X(45)   VALUE
035300         '684045721740046685112592740053686112592740119'.
035400     03                          PIC X(45)   VALUE
035500         '687060031980076688045721740041689068762150081'.
035600     03                          PIC X(45)   VALUE
035700         '690050971820058691112592740061692060031980030'.
035800     03                          PIC X(45)   VALUE
035900         '693112592740086694060031980037695112592740088'.
036000     03                          PIC X(45)   VALUE
036100         '696045721740048697045721740051698085962320101'.
036200     03                          PIC X(45)   VALUE
036300         '699064162050068700064162050050707096782450063'.
036400     03                          PIC X(45)   VALUE
036500         '708076892230023709112592740100710112592740027'.
036600     03                          PIC X(45)   VALUE
036700         '711162273450129712162273450048713096782450072'.
036800     03                          PIC X(45)   VALUE
036900         '714076892230029715060031980131716045721740026'.
037000     03                          PIC X(45)   VALUE
037100         '717112592740107718076892230045722060031980117'.
037200     03                          PIC X(45)   VALUE
037300         '723060031980080724060031980037725060031980088'.
037400     03                          PIC X(45)   VALUE
037500         '726060031980053727081212190099728060162030059'.
037600     03                          PIC X(45)   VALUE
037700         '729078202280079730060031980043734076892230109'.
037800     03                          PIC X(45)   VALUE
037900         '735076892230034736076892230186737076892230094'.
038000     03                          PIC X(45)   VALUE
038100         '738076892230050739136073490141740107202890064'.
038200     03                          PIC X(45)   VALUE
038300         '741107202890031742076892230061743076892230028'.
038400     03                          PIC X(45)   VALUE
038500         '744076892230088745076892230035746112592740068'.
038600     03                          PIC X(45)   VALUE
038700         '747076892230027748076892230025749076892230140'.
038800     03                          PIC X(45)   VALUE
038900         '750076892230044754112592740139755076892230080'.
039000     03                          PIC X(45)   VALUE
039100         '756045721740041757070392180114758070332280081'.
039200     03                          PIC X(45)   VALUE
039300         '759070332280059760162273450055761162273450033'.
039400     03                          PIC X(45)   VALUE
039500         '765076892230067766076892230041767076892230048'.
039600     03                          PIC X(45)   VALUE
039700         '768076892230043769076892230101770076892230030'.
039800     03                          PIC X(45)   VALUE
039900         '774076892230042775076892230031776112592740052'.
040000     03                          PIC X(45)   VALUE
040100         '777112592740030778112592740041779112592740026'.
040200     03                          PIC X(45)   VALUE
040300         '780112592740018781045721740060782112592740034'.
040400     03                          PIC X(45)   VALUE
040500         '789112592740010790112592740010791112592740010'.
040600     03                          PIC X(45)   VALUE
040700         '792112592740010793112592740010794112592740010'.
040800     03                          PIC X(45)   VALUE
040900         '795112592740010799144223400208800095562770108'.
041000     03                          PIC X(45)   VALUE
041100         '801045721740054802112592740168803076892230100'.
041200     03                          PIC X(45)   VALUE
041300         '804076892230047808087662050130809060031980075'.
041400     03                          PIC X(45)   VALUE
041500         '810055741970052811082312180077812055741970053'.
041600     03                          PIC X(45)   VALUE
041700         '813076071910079814076892230109815045721740067'.
041800     03                          PIC X(45)   VALUE
041900         '816045721740045820076892230186821076892230115'.
042000     03                          PIC X(45)   VALUE
042100         '822045721740044823112592740228824076892230127'.
042200     03                          PIC X(45)   VALUE
042300         '825076892230064826112592740226827076892230109'.
042400     03                          PIC X(45)   VALUE
042500         '828076892230052829112592740170830076892230049'.
042600     03                          PIC X(45)   VALUE
042700         '834076892230186835060031980120836060031980067'.
042800     03                          PIC X(45)   VALUE
042900         '837162273450288838162273450149839060031980079'.
043000     03                          PIC X(45)   VALUE
043100         '840097932080173841060031980103842045721740065'.
043200     03                          PIC X(45)   VALUE
043300         '843076892230119844045721740085845045721740059'.
043400     03                          PIC X(45)   VALUE
043500         '846124442660131847110062600055848076892230048'.
043600     03                          PIC X(45)   VALUE
043700         '849091532200094853176133730233854091972780131'.
043800     03                          PIC X(45)   VALUE
043900         '855060031980080856154603530214857103343010111'.
044000     03                          PIC X(45)   VALUE
044100         '858076892230074862100782530118863072922310071'.
044200     03                          PIC X(45)   VALUE
044300         '864060031980055865073062030110866073062030054'.
044400     03                          PIC X(45)   VALUE
044500         '867107042340149868071142100078869071142100055'.
044600     03                          PIC X(45)   VALUE
044700         '870212543070217871088132280111872059511960075'.
044800     03                          PIC X(45)   VALUE
044900         '876112592740201880045721740045881045721740070'.
045000     03                          PIC X(45)   VALUE
045100         '882039422290071883044632430121884040432230086'.
045200     03                          PIC X(45)   VALUE
045300         '885047352260117886045721740106887045721740068'.
045400     03                          PIC X(45)   VALUE
045500         '894045721740044895043892560190896060031980104'.
045600     03                          PIC X(45)   VALUE
045700         '897040802360061901144603430229902098913020106'.
045800     03                          PIC X(45)   VALUE
045900         '903045721740067904137863500176905137863500068'.
046000     03                          PIC X(45)   VALUE
046100         '906045721740054907152153420178908096032850094'.
046200     03                          PIC X(45)   VALUE
046300         '909058472020050913085932280079914058472020047'.
046400     03                          PIC X(45)   VALUE
046500         '915045721740080916045721740031917076892230077'.
046600     03                          PIC X(45)   VALUE
046700         '918045721740042919113622690098920074972260063'.
046800     03                          PIC X(45)   VALUE
046900         '921050001760043922076892230091923076892230044'.
047000     03                          PIC X(45)   VALUE
047100         '927112592740228928112592740228929112592740121'.
047200     03                          PIC X(45)   VALUE
047300         '933076892230081934071852360101935072142310076'.
047400     03                          PIC X(45)   VALUE
047500         '939131183210166940087012840087941060031980043'.
047600     03                          PIC X(45)   VALUE
047700         '945062922080158946039251820111947079032140076'.
047800     03                          PIC X(45)   VALUE
047900         '948049152000051949072862200063950040101610050'.
048000     03                          PIC X(45)   VALUE
048100         '951118072960064955162273450187956162273450124'.
048200     03                          PIC X(45)   VALUE
048300         '957162273450253958076892230140959076892230086'.
048400     03                          PIC X(45)   VALUE
048500         '963112592740142964076892230079965076892230056'.
048600     03                          PIC X(45)   VALUE
048700         '969165023290274970076892230120974102672230154'.
048800     03                          PIC X(45)   VALUE
048900         '975053761690096976053761690066977062552110076'.
049000     03                          PIC X(45)   VALUE
049100         '981212973890213982106913070125983076892230061'.
049200     03                          PIC X(45)   VALUE
049300         '984162273450204985076892230122986076892230046'.
049400     03                          PIC X(45)   VALUE
049500         '987165163660185988107812930107989060031980048'.
049600 01  W-DRG-TABLE REDEFINES W-DRG-FILLS.
049700     03  WWM-ENTRY OCCURS 741 TIMES
049800             ASCENDING KEY IS WWM-DRG
049900             INDEXED BY WWM-INDX.
050000         05  WWM-DRG             PIC X(3).
050100         05  WWM-RELWT           PIC 9(1)V9(4).
050200         05  WWM-ALOS            PIC 9(2)V9(1).
050300         05  WWM-IPTHRESH        PIC 9(3)V9(1).
